org $1C8000

;===================================================================================================
; NOTE:
; An open box (␣) (U+2423) is used to represent a space ( ) in some comments.
; Brackets ([])  are used to denote dynamically written text from commands.
;===================================================================================================
Message_Data:

;===================================================================================================
; NULL - UNUSED
;===================================================================================================
Message_0000:
|1C8000| db $FB ; end of message

;===================================================================================================
; CHOOSE 2 LOW option 1
;===================================================================================================
; ␣␣▶
; ␣␣␣
;===================================================================================================
Message_0001:
|1C8001| db $FC, $00 ; text speed: 0
|1C8003| db $F9 ; row 3
|1C8004| db $FF, $FF, $FF ; ␣␣␣
|1C8007| db $F8 ; row 2
|1C8008| db $FF, $FF, $E4 ; ␣␣▶
|1C800B| db $FE, $68 ; choose 2 low
|1C800D| db $FB ; end of message

;===================================================================================================
; CHOOSE 2 LOW option 2
;===================================================================================================
; ␣␣␣
; ␣␣▶
;===================================================================================================
Message_0002:
|1C800E| db $FC, $00 ; text speed: 0
|1C8010| db $F8 ; row 2
|1C8011| db $FF, $FF, $FF ; ␣␣␣
|1C8014| db $F9 ; row 3
|1C8015| db $FF, $FF, $E4 ; ␣␣▶
|1C8018| db $FE, $68 ; choose 2 low
|1C801A| db $FB ; end of message

;===================================================================================================
; Death options
;---------------------------------------------------------------------------------------------------
; Save and continue
; Save and quit
; Continue without saving
;===================================================================================================
; セーブして続ける
; セーブしておわる
; セーブしないで続ける
;===================================================================================================
Message_0003:
|1C801B| db $FC, $00 ; text speed: 0
|1C801D| db $63, $C9, $8F, $11, $1B ; セーブして
|1C8022| db $FD, $82 ; kanji 続
|1C8024| db $0B, $3A ; ける
|1C8026| db $F8 ; row 2
|1C8027| db $63, $C9, $8F, $11, $1B, $04, $0D, $3A ; セーブしておわる
|1C802F| db $F9 ; row 3
|1C8030| db $63, $C9, $8F, $11, $20, $01, $36 ; セーブしないで
|1C8037| db $FD, $82 ; kanji 続
|1C8039| db $0B, $3A ; ける
|1C803B| db $FB ; end of message

;===================================================================================================
; BCD debug - UNUSED
;===================================================================================================
; 0は [BCD], 1は [BCD]
; 2は [BCD], 3は [BCD]
;===================================================================================================
Message_0004:
|1C803C| db $FC, $00 ; text speed: 0
|1C803E| db $A0, $28, $FF ; 0は␣
|1C8041| db $FE, $6C, $00 ; BCD digit 0
|1C8044| db $C8, $FF, $A1, $28, $FF ; ,␣1は␣
|1C8049| db $FE, $6C, $01 ; BCD digit 1
|1C804C| db $F8 ; row 2
|1C804D| db $A2, $28, $FF ; 2は␣
|1C8050| db $FE, $6C, $02 ; BCD digit 2
|1C8053| db $C8, $FF, $A3, $28, $FF ; ,␣3は␣
|1C8058| db $FE, $6C, $03 ; BCD digit 3
|1C805B| db $FB ; end of message

;===================================================================================================
; Followers forbidden
;---------------------------------------------------------------------------------------------------
; You can't go in there with me.
;===================================================================================================
; 私といっしょじゃ 入れないよ
;===================================================================================================
Message_0005:
|1C805C| db $FD, $26 ; kanji 私
|1C805E| db $1C, $01, $4A, $11, $49, $25, $47, $FF ; といっしょじゃ␣
|1C8066| db $FD, $49 ; kanji 入
|1C8068| db $3B, $20, $01, $07 ; れないよ
|1C806C| db $FB ; end of message

;===================================================================================================
; CHOOSE 3 option 1
;===================================================================================================
; ▶
; ␣
; ␣
;===================================================================================================
Message_0006:
|1C806D| db $FC, $00 ; text speed: 0
|1C806F| db $F7 ; row 1
|1C8070| db $E4 ; ▶
|1C8071| db $F8 ; row 2
|1C8072| db $FF ; ␣
|1C8073| db $F9 ; row 3
|1C8074| db $FF ; ␣
|1C8075| db $FE, $71 ; choose 3
|1C8077| db $FB ; end of message

;===================================================================================================
; CHOOSE 3 option 2
;===================================================================================================
; ␣
; ▶
; ␣
;===================================================================================================
Message_0007:
|1C8078| db $FC, $00 ; text speed: 0
|1C807A| db $F7 ; row 1
|1C807B| db $FF ; ␣
|1C807C| db $F8 ; row 2
|1C807D| db $E4 ; ▶
|1C807E| db $F9 ; row 3
|1C807F| db $FF ; ␣
|1C8080| db $FE, $71 ; choose 3
|1C8082| db $FB ; end of message

;===================================================================================================
; CHOOSE 3 option 3
;===================================================================================================
; ␣
; ␣
; ▶
;===================================================================================================
Message_0008:
|1C8083| db $FC, $00 ; text speed: 0
|1C8085| db $F7 ; row 1
|1C8086| db $FF ; ␣
|1C8087| db $F8 ; row 2
|1C8088| db $FF ; ␣
|1C8089| db $F9 ; row 3
|1C808A| db $E4 ; ▶
|1C808B| db $FE, $71 ; choose 3
|1C808D| db $FB ; end of message

;===================================================================================================
; CHOOSE 2 HIGH option 1
;===================================================================================================
; ▶
; ␣
;===================================================================================================
Message_0009:
|1C808E| db $FC, $00 ; text speed: 0
|1C8090| db $F7 ; row 1
|1C8091| db $E4 ; ▶
|1C8092| db $F8 ; row 2
|1C8093| db $FF ; ␣
|1C8094| db $FE, $72 ; choose 2 high
|1C8096| db $FB ; end of message

;===================================================================================================
; CHOOSE 2 HIGH option 2
;===================================================================================================
; ␣
; ▶
;===================================================================================================
Message_000A:
|1C8097| db $FC, $00 ; text speed: 0
|1C8099| db $F7 ; row 1
|1C809A| db $FF ; ␣
|1C809B| db $F8 ; row 2
|1C809C| db $E4 ; ▶
|1C809D| db $FE, $72 ; choose 2 high
|1C809F| db $FB ; end of message

;===================================================================================================
; Uncle leaving house
;===================================================================================================
; [LINK],わしはちょっと
; 出かけてくる。
; 心配する事はない。
; 朝までには戻ってくる。
; 家を出るんじゃないぞ。
;===================================================================================================
Message_000B:
|1C80A0| db $FE, $6A ; write player name
|1C80A2| db $C8, $0D, $11, $28, $19, $49, $4A, $1C ; ,わしはちょっと
|1C80AA| db $F8 ; row 2
|1C80AB| db $FD, $23 ; kanji 出
|1C80AD| db $08, $0B, $1B, $0A, $3A, $CD ; かけてくる。
|1C80B3| db $F9 ; row 3
|1C80B4| db $FD, $E6 ; kanji 心
|1C80B6| db $FD, $8E ; kanji 配
|1C80B8| db $12, $3A ; する
|1C80BA| db $FD, $22 ; kanji 事
|1C80BC| db $28, $20, $01, $CD ; はない。
|1C80C0| db $FA ; wait for key
|1C80C1| db $F6 ; scroll
|1C80C2| db $FD, $C9 ; kanji 朝
|1C80C4| db $30, $36, $21, $28 ; までには
|1C80C8| db $FD, $0F ; kanji 戻
|1C80CA| db $4A, $1B, $0A, $3A, $CD ; ってくる。
|1C80CF| db $F6 ; scroll
|1C80D0| db $FD, $56 ; kanji 家
|1C80D2| db $0E ; を
|1C80D3| db $FD, $23 ; kanji 出
|1C80D5| db $3A, $0F, $25, $47, $20, $01, $2D, $CD ; るんじゃないぞ。
|1C80DD| db $F6 ; scroll
|1C80DE| db $FB ; end of message

;===================================================================================================
; Dead uncle
;===================================================================================================
; うう⋯。[LINK],お前だけは
; まきこみたくなかった⋯
; 家を出るなと言ったのに⋯
; ⋯こ,この剣と盾を持って行け
; よくきけ⋯Bボタンを押し続け
; 剣に力をためるのだ。
; そうすれば,あるー族だけに
; 伝わる秘剣が使えるはずだ⋯。
; [LINK]よ,お前ならできる⋯
; ゼルダ姫を お救いするのだ。
; お,お前は,姫の ⋯ ⋯。
;===================================================================================================
Message_000C:
|1C80DF| db $02, $02, $CC, $CD ; うう⋯。
|1C80E3| db $FE, $6A ; write player name
|1C80E5| db $C8, $04 ; ,お
|1C80E7| db $FD, $78 ; kanji 前
|1C80E9| db $2E, $0B, $28 ; だけは
|1C80EC| db $F8 ; row 2
|1C80ED| db $30, $09, $0C, $31, $18, $0A, $20, $08 ; まきこみたくなか
|1C80F5| db $4A, $18, $CC ; った⋯
|1C80F8| db $F9 ; row 3
|1C80F9| db $FD, $56 ; kanji 家
|1C80FB| db $0E ; を
|1C80FC| db $FD, $23 ; kanji 出
|1C80FE| db $3A, $20, $1C ; るなと
|1C8101| db $FD, $16 ; kanji 言
|1C8103| db $4A, $18, $24, $21, $CC ; ったのに⋯
|1C8108| db $FA ; wait for key
|1C8109| db $F6 ; scroll
|1C810A| db $CC, $0C, $C8, $0C, $24 ; ⋯こ,この
|1C810F| db $FD, $1A ; kanji 剣
|1C8111| db $1C ; と
|1C8112| db $FD, $1B ; kanji 盾
|1C8114| db $0E ; を
|1C8115| db $FD, $DB ; kanji 持
|1C8117| db $4A, $1B ; って
|1C8119| db $FD, $02 ; kanji 行
|1C811B| db $0B ; け
|1C811C| db $F6 ; scroll
|1C811D| db $07, $0A, $09, $0B, $CC, $AB, $91, $68 ; よくきけ⋯Bボタ
|1C8125| db $5F, $0E ; ンを
|1C8127| db $FD, $77 ; kanji 押
|1C8129| db $11 ; し
|1C812A| db $FD, $82 ; kanji 続
|1C812C| db $0B ; け
|1C812D| db $F6 ; scroll
|1C812E| db $FD, $1A ; kanji 剣
|1C8130| db $21 ; に
|1C8131| db $FD, $99 ; kanji 力
|1C8133| db $0E, $18, $33, $3A, $24, $2E, $CD ; をためるのだ。
|1C813A| db $FA ; wait for key
|1C813B| db $F6 ; scroll
|1C813C| db $14, $02, $12, $3B, $3D, $C8, $00, $3A ; そうすれば,ある
|1C8144| db $C9 ; ー
|1C8145| db $FD, $F2 ; kanji 族
|1C8147| db $2E, $0B, $21 ; だけに
|1C814A| db $F6 ; scroll
|1C814B| db $FD, $2E ; kanji 伝
|1C814D| db $0D, $3A ; わる
|1C814F| db $FD, $C1 ; kanji 秘
|1C8151| db $FD, $1A ; kanji 剣
|1C8153| db $15 ; が
|1C8154| db $FD, $89 ; kanji 使
|1C8156| db $03, $3A, $28, $26, $2E, $CC, $CD ; えるはずだ⋯。
|1C815D| db $F6 ; scroll
|1C815E| db $FE, $6A ; write player name
|1C8160| db $07, $C8, $04 ; よ,お
|1C8163| db $FD, $78 ; kanji 前
|1C8165| db $20, $38, $36, $09, $3A, $CC ; ならできる⋯
|1C816B| db $FA ; wait for key
|1C816C| db $F6 ; scroll
|1C816D| db $77, $8A, $7E ; ゼルダ
|1C8170| db $FD, $FF ; kanji 姫
|1C8172| db $0E, $FF, $04 ; を␣お
|1C8175| db $FD, $28 ; kanji 救
|1C8177| db $01, $12, $3A, $24, $2E, $CD ; いするのだ。
|1C817D| db $F6 ; scroll
|1C817E| db $04, $C8, $04 ; お,お
|1C8181| db $FD, $78 ; kanji 前
|1C8183| db $28, $C8 ; は,
|1C8185| db $FD, $FF ; kanji 姫
|1C8187| db $24, $FF, $CC, $FF, $CC, $CD ; の␣⋯␣⋯。
|1C818D| db $F6 ; scroll
|1C818E| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 1
;===================================================================================================
; 子どもが 夜ふけにウロウロ
; してるんじゃない!
; 大人になってからだよ。
;===================================================================================================
Message_000D:
|1C818F| db $FD, $11 ; kanji 子
|1C8191| db $37, $34, $15, $FF ; どもが␣
|1C8195| db $FD, $79 ; kanji 夜
|1C8197| db $2A, $0B, $21, $52, $8C, $52, $8C ; ふけにウロウロ
|1C819E| db $F8 ; row 2
|1C819F| db $11, $1B, $3A, $0F, $25, $47, $20, $01 ; してるんじゃない
|1C81A7| db $C7 ; !
|1C81A8| db $F9 ; row 3
|1C81A9| db $FD, $5F ; kanji 大
|1C81AB| db $FD, $38 ; kanji 人
|1C81AD| db $21, $20, $4A, $1B, $08, $38, $2E, $07 ; になってからだよ
|1C81B5| db $CD ; 。
|1C81B6| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 2
;---------------------------------------------------------------------------------------------------
; Press X for map
;===================================================================================================
; 道に迷ったらXボタンPUSH
; 地図が見れるぜ ⋯ ⋯
; お前 知ってるかい?
;===================================================================================================
Message_000E:
|1C81B7| db $FD, $5D ; kanji 道
|1C81B9| db $21 ; に
|1C81BA| db $FD, $70 ; kanji 迷
|1C81BC| db $4A, $18, $38, $C1, $91, $68, $5F, $B9 ; ったらXボタンP
|1C81C4| db $BE, $BC, $B1 ; USH
|1C81C7| db $F8 ; row 2
|1C81C8| db $FD, $33 ; kanji 地
|1C81CA| db $FD, $34 ; kanji 図
|1C81CC| db $15 ; が
|1C81CD| db $FD, $4C ; kanji 見
|1C81CF| db $3B, $3A, $27, $FF, $CC, $FF, $CC ; れるぜ␣⋯␣⋯
|1C81D6| db $F9 ; row 3
|1C81D7| db $04 ; お
|1C81D8| db $FD, $78 ; kanji 前
|1C81DA| db $FF ; ␣
|1C81DB| db $FD, $93 ; kanji 知
|1C81DD| db $4A, $1B, $3A, $08, $01, $C6 ; ってるかい?
|1C81E3| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 3
;===================================================================================================
; 物にさわってAボタンを押す。
; 物が,かつげたりするぜ ⋯
; お前 知ってるかい?
;===================================================================================================
Message_000F:
|1C81E4| db $FD, $51 ; kanji 物
|1C81E6| db $21, $10, $0D, $4A, $1B, $AA, $91, $68 ; にさわってAボタ
|1C81EE| db $5F, $0E ; ンを
|1C81F0| db $FD, $77 ; kanji 押
|1C81F2| db $12, $CD ; す。
|1C81F4| db $F8 ; row 2
|1C81F5| db $FD, $51 ; kanji 物
|1C81F7| db $15, $C8, $08, $1A, $1D, $18, $39, $12 ; が,かつげたりす
|1C81FF| db $3A, $27, $FF, $CC ; るぜ␣⋯
|1C8203| db $F9 ; row 3
|1C8204| db $04 ; お
|1C8205| db $FD, $78 ; kanji 前
|1C8207| db $FF ; ␣
|1C8208| db $FD, $93 ; kanji 知
|1C820A| db $4A, $1B, $3A, $08, $01, $C6 ; ってるかい?
|1C8210| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 4
;===================================================================================================
; お前が 剣を手にした時は
; Bボタンで 使うんだぞ ⋯
; お前 忘れるなよっ!
;===================================================================================================
Message_0010:
|1C8211| db $04 ; お
|1C8212| db $FD, $78 ; kanji 前
|1C8214| db $15, $FF ; が␣
|1C8216| db $FD, $1A ; kanji 剣
|1C8218| db $0E ; を
|1C8219| db $FD, $3E ; kanji 手
|1C821B| db $21, $11, $18 ; にした
|1C821E| db $FD, $88 ; kanji 時
|1C8220| db $28 ; は
|1C8221| db $F8 ; row 2
|1C8222| db $AB, $91, $68, $5F, $36, $FF ; Bボタンで␣
|1C8228| db $FD, $89 ; kanji 使
|1C822A| db $02, $0F, $2E, $2D, $FF, $CC ; うんだぞ␣⋯
|1C8230| db $F9 ; row 3
|1C8231| db $04 ; お
|1C8232| db $FD, $78 ; kanji 前
|1C8234| db $FF ; ␣
|1C8235| db $FD, $D8 ; kanji 忘
|1C8237| db $3B, $3A, $20, $07, $4A, $C7 ; れるなよっ!
|1C823D| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 5
;===================================================================================================
; 地図の上で光る点は
; たぶん 目的地だ ⋯ ⋯
; お前 知ってるかい?
;===================================================================================================
Message_0011:
|1C823E| db $FD, $33 ; kanji 地
|1C8240| db $FD, $34 ; kanji 図
|1C8242| db $24 ; の
|1C8243| db $FD, $72 ; kanji 上
|1C8245| db $36 ; で
|1C8246| db $FD, $73 ; kanji 光
|1C8248| db $3A ; る
|1C8249| db $FD, $74 ; kanji 点
|1C824B| db $28 ; は
|1C824C| db $F8 ; row 2
|1C824D| db $18, $3F, $0F, $FF ; たぶん␣
|1C8251| db $FD, $75 ; kanji 目
|1C8253| db $FD, $76 ; kanji 的
|1C8255| db $FD, $33 ; kanji 地
|1C8257| db $2E, $FF, $CC, $FF, $CC ; だ␣⋯␣⋯
|1C825C| db $F9 ; row 3
|1C825D| db $04 ; お
|1C825E| db $FD, $78 ; kanji 前
|1C8260| db $FF ; ␣
|1C8261| db $FD, $93 ; kanji 知
|1C8263| db $4A, $1B, $3A, $08, $01, $C6 ; ってるかい?
|1C8269| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 6
;===================================================================================================
; 宝箱の前でAボタンを押す。
; 宝箱が,開くはずだ。
; お前 知ってるかい?
;===================================================================================================
Message_0012:
|1C826A| db $FD, $9A ; kanji 宝
|1C826C| db $FD, $EA ; kanji 箱
|1C826E| db $24 ; の
|1C826F| db $FD, $78 ; kanji 前
|1C8271| db $36, $AA, $91, $68, $5F, $0E ; でAボタンを
|1C8277| db $FD, $77 ; kanji 押
|1C8279| db $12, $CD ; す。
|1C827B| db $F8 ; row 2
|1C827C| db $FD, $9A ; kanji 宝
|1C827E| db $FD, $EA ; kanji 箱
|1C8280| db $15, $C8 ; が,
|1C8282| db $FD, $4B ; kanji 開
|1C8284| db $0A, $28, $26, $2E, $CD ; くはずだ。
|1C8289| db $F9 ; row 3
|1C828A| db $04 ; お
|1C828B| db $FD, $78 ; kanji 前
|1C828D| db $FF ; ␣
|1C828E| db $FD, $93 ; kanji 知
|1C8290| db $4A, $1B, $3A, $08, $01, $C6 ; ってるかい?
|1C8296| db $FB ; end of message

;===================================================================================================
; Tutorial guard message 7
;===================================================================================================
; おれ達と話すと 色々わかって
; タメになるぞ ⋯
; お前 知ってるだろ!
;===================================================================================================
Message_0013:
|1C8297| db $04, $3B ; おれ
|1C8299| db $FD, $13 ; kanji 達
|1C829B| db $1C ; と
|1C829C| db $FD, $A3 ; kanji 話
|1C829E| db $12, $1C, $FF ; すと␣
|1C82A1| db $FD, $A4 ; kanji 色
|1C82A3| db $FD, $A5 ; kanji 々
|1C82A5| db $0D, $08, $4A, $1B ; わかって
|1C82A9| db $F8 ; row 2
|1C82AA| db $68, $83, $21, $20, $3A, $2D, $FF, $CC ; タメになるぞ␣⋯
|1C82B2| db $F9 ; row 3
|1C82B3| db $04 ; お
|1C82B4| db $FD, $78 ; kanji 前
|1C82B6| db $FF ; ␣
|1C82B7| db $FD, $93 ; kanji 知
|1C82B9| db $4A, $1B, $3A, $2E, $3C, $C7 ; ってるだろ!
|1C82BF| db $FB ; end of message

;===================================================================================================
; Priest: Go find the elders
;===================================================================================================
; 村の長老に会いなさい。そして
; マスターソードを手に入れる
; ことです。
;===================================================================================================
Message_0014:
|1C82C0| db $FD, $8C ; kanji 村
|1C82C2| db $24 ; の
|1C82C3| db $FD, $8D ; kanji 長
|1C82C5| db $FD, $E5 ; kanji 老
|1C82C7| db $21 ; に
|1C82C8| db $FD, $04 ; kanji 会
|1C82CA| db $01, $20, $10, $01, $CD, $14, $11, $1B ; いなさい。そして
|1C82D2| db $F8 ; row 2
|1C82D3| db $80, $62, $68, $C9, $64, $C9, $87, $0E ; マスターソードを
|1C82DB| db $FD, $3E ; kanji 手
|1C82DD| db $21 ; に
|1C82DE| db $FD, $49 ; kanji 入
|1C82E0| db $3B, $3A ; れる
|1C82E2| db $F9 ; row 3
|1C82E3| db $0C, $1C, $36, $12, $CD ; ことです。
|1C82E8| db $FB ; end of message

;===================================================================================================
; Priest: Zelda!!!
;===================================================================================================
; おお ゼルダ姫無事でしたか!
; [LINK] お前が助け出して
; くれたのですね。
;===================================================================================================
Message_0015:
|1C82E9| db $04, $04, $FF, $77, $8A, $7E ; おお␣ゼルダ
|1C82EF| db $FD, $FF ; kanji 姫
|1C82F1| db $FD, $21 ; kanji 無
|1C82F3| db $FD, $22 ; kanji 事
|1C82F5| db $36, $11, $18, $08, $C7 ; でしたか!
|1C82FA| db $F8 ; row 2
|1C82FB| db $FE, $6A ; write player name
|1C82FD| db $FF, $04 ; ␣お
|1C82FF| db $FD, $78 ; kanji 前
|1C8301| db $15 ; が
|1C8302| db $FD, $CA ; kanji 助
|1C8304| db $0B ; け
|1C8305| db $FD, $23 ; kanji 出
|1C8307| db $11, $1B ; して
|1C8309| db $F9 ; row 3
|1C830A| db $0A, $3B, $18, $24, $36, $12, $23, $CD ; くれたのですね。
|1C8312| db $FB ; end of message

;===================================================================================================
; Priest in Sanctuary
;===================================================================================================
; うむ,どうやら司祭には魔物が
; とりついている様ですね⋯。
; あやつを倒すには 伝説の
; 退魔の剣『マスターソード』が
; 必要でしょう。
; くわしい事は私には わかりま
; せんが,村の長老が7賢者の
; しそんの1人だと言う事です。
; まず 彼を訪ねると良い
; でしょう⋯ ⋯
; 地図に印をつけておきます。
; でも,気をつけて行くのですよ
; 今ごろは城の兵が あなた達を
; 探しまわっているはずです。
; ⋯ ⋯ ⋯ ゼルダ姫は,
; ここに,かくまっておきます。
; 心配せずに 行きなさい。
; ⋯ ⋯ ⋯
; ちゃんと きこえましたか?
; ▶ う ん
;   ぜんぜん
;===================================================================================================
Message_0016:
|1C8313| db $F8 ; row 2
|1C8314| db $02, $32, $C8, $37, $02, $05, $38 ; うむ,どうやら
|1C831B| db $FD, $0D ; kanji 司
|1C831D| db $FD, $17 ; kanji 祭
|1C831F| db $21, $28 ; には
|1C8321| db $FD, $2D ; kanji 魔
|1C8323| db $FD, $51 ; kanji 物
|1C8325| db $15 ; が
|1C8326| db $F9 ; row 3
|1C8327| db $1C, $39, $1A, $01, $1B, $01, $3A ; とりついている
|1C832E| db $FD, $10 ; kanji 様
|1C8330| db $36, $12, $23, $CC, $CD ; ですね⋯。
|1C8335| db $FA ; wait for key
|1C8336| db $F6 ; scroll
|1C8337| db $00, $05, $1A, $0E ; あやつを
|1C833B| db $FD, $29 ; kanji 倒
|1C833D| db $12, $21, $28, $FF ; すには␣
|1C8341| db $FD, $2E ; kanji 伝
|1C8343| db $FD, $2F ; kanji 説
|1C8345| db $24 ; の
|1C8346| db $F6 ; scroll
|1C8347| db $FD, $2C ; kanji 退
|1C8349| db $FD, $2D ; kanji 魔
|1C834B| db $24 ; の
|1C834C| db $FD, $1A ; kanji 剣
|1C834E| db $C4, $80, $62, $68, $C9, $64, $C9, $87 ; 『マスターソード
|1C8356| db $C5, $15 ; 』が
|1C8358| db $F6 ; scroll
|1C8359| db $FD, $30 ; kanji 必
|1C835B| db $FD, $31 ; kanji 要
|1C835D| db $36, $11, $49, $02, $CD ; でしょう。
|1C8362| db $FA ; wait for key
|1C8363| db $F6 ; scroll
|1C8364| db $0A, $0D, $11, $01 ; くわしい
|1C8368| db $FD, $22 ; kanji 事
|1C836A| db $28 ; は
|1C836B| db $FD, $26 ; kanji 私
|1C836D| db $21, $28, $FF, $0D, $08, $39, $30 ; には␣わかりま
|1C8374| db $F6 ; scroll
|1C8375| db $13, $0F, $15, $C8 ; せんが,
|1C8379| db $FD, $8C ; kanji 村
|1C837B| db $24 ; の
|1C837C| db $FD, $8D ; kanji 長
|1C837E| db $FD, $E5 ; kanji 老
|1C8380| db $15, $A7 ; が7
|1C8382| db $FD, $C4 ; kanji 賢
|1C8384| db $FD, $1E ; kanji 者
|1C8386| db $24 ; の
|1C8387| db $F6 ; scroll
|1C8388| db $11, $14, $0F, $24, $A1 ; しそんの1
|1C838D| db $FD, $38 ; kanji 人
|1C838F| db $2E, $1C ; だと
|1C8391| db $FD, $16 ; kanji 言
|1C8393| db $02 ; う
|1C8394| db $FD, $22 ; kanji 事
|1C8396| db $36, $12, $CD ; です。
|1C8399| db $FA ; wait for key
|1C839A| db $F6 ; scroll
|1C839B| db $30, $26, $FF ; まず␣
|1C839E| db $FD, $14 ; kanji 彼
|1C83A0| db $0E ; を
|1C83A1| db $FD, $07 ; kanji 訪
|1C83A3| db $23, $3A, $1C ; ねると
|1C83A6| db $FD, $32 ; kanji 良
|1C83A8| db $01 ; い
|1C83A9| db $F6 ; scroll
|1C83AA| db $36, $11, $49, $02, $CC, $FF, $CC ; でしょう⋯␣⋯
|1C83B1| db $F6 ; scroll
|1C83B2| db $FD, $33 ; kanji 地
|1C83B4| db $FD, $34 ; kanji 図
|1C83B6| db $21 ; に
|1C83B7| db $FD, $35 ; kanji 印
|1C83B9| db $0E, $1A, $0B, $1B, $04, $09, $30, $12 ; をつけておきます
|1C83C1| db $CD ; 。
|1C83C2| db $FE, $79, $2D ; SFX3.2D
|1C83C5| db $FA ; wait for key
|1C83C6| db $F6 ; scroll
|1C83C7| db $36, $34, $C8 ; でも,
|1C83CA| db $FD, $37 ; kanji 気
|1C83CC| db $0E, $1A, $0B, $1B ; をつけて
|1C83D0| db $FD, $02 ; kanji 行
|1C83D2| db $0A, $24, $36, $12, $07 ; くのですよ
|1C83D7| db $F6 ; scroll
|1C83D8| db $FD, $6A ; kanji 今
|1C83DA| db $1E, $3C, $28 ; ごろは
|1C83DD| db $FD, $01 ; kanji 城
|1C83DF| db $24 ; の
|1C83E0| db $FD, $3A ; kanji 兵
|1C83E2| db $15, $FF, $00, $20, $18 ; が␣あなた
|1C83E7| db $FD, $13 ; kanji 達
|1C83E9| db $0E ; を
|1C83EA| db $F6 ; scroll
|1C83EB| db $FD, $69 ; kanji 探
|1C83ED| db $11, $30, $0D, $4A, $1B, $01, $3A, $28 ; しまわっているは
|1C83F5| db $26, $36, $12, $CD ; ずです。
|1C83F9| db $FA ; wait for key
|1C83FA| db $F6 ; scroll
|1C83FB| db $FF, $CC, $FF, $CC, $FF, $CC, $FF, $FF ; ␣⋯␣⋯␣⋯␣␣
|1C8403| db $77, $8A, $7E ; ゼルダ
|1C8406| db $FD, $FF ; kanji 姫
|1C8408| db $28, $C8 ; は,
|1C840A| db $F6 ; scroll
|1C840B| db $0C, $0C, $21, $C8, $08, $0A, $30, $4A ; ここに,かくまっ
|1C8413| db $1B, $04, $09, $30, $12, $CD ; ておきます。
|1C8419| db $F6 ; scroll
|1C841A| db $FD, $E6 ; kanji 心
|1C841C| db $FD, $8E ; kanji 配
|1C841E| db $13, $26, $21, $FF ; せずに␣
|1C8422| db $FD, $02 ; kanji 行
|1C8424| db $09, $20, $10, $01, $CD ; きなさい。
|1C8429| db $FA ; wait for key
|1C842A| db $F6 ; scroll
|1C842B| db $F6 ; scroll
|1C842C| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C8432| db $F6 ; scroll
|1C8433| db $FA ; wait for key
|1C8434| db $F6 ; scroll
|1C8435| db $19, $47, $0F, $1C, $FF, $09, $0C, $03 ; ちゃんと␣きこえ
|1C843D| db $30, $11, $18, $08, $C6 ; ましたか?
|1C8442| db $F6 ; scroll
|1C8443| db $FF, $FF, $E4, $FF, $02, $FF, $FF, $0F ; ␣␣▶␣う␣␣ん
|1C844B| db $F6 ; scroll
|1C844C| db $FF, $FF, $FF, $FF, $27, $0F, $27, $0F ; ␣␣␣␣ぜんぜん
|1C8454| db $FE, $68 ; choose 2 low
|1C8456| db $FB ; end of message

;===================================================================================================
; Priest idle: go find pendants
;===================================================================================================
; 司祭を倒せば,城の者たちも,
; 正気に戻るかもしれません。
; 3つの紋章を集めるのです。
;===================================================================================================
Message_0017:
|1C8457| db $FD, $0D ; kanji 司
|1C8459| db $FD, $17 ; kanji 祭
|1C845B| db $0E ; を
|1C845C| db $FD, $29 ; kanji 倒
|1C845E| db $13, $3D, $C8 ; せば,
|1C8461| db $FD, $01 ; kanji 城
|1C8463| db $24 ; の
|1C8464| db $FD, $1E ; kanji 者
|1C8466| db $18, $19, $34, $C8 ; たちも,
|1C846A| db $F8 ; row 2
|1C846B| db $FD, $4D ; kanji 正
|1C846D| db $FD, $37 ; kanji 気
|1C846F| db $21 ; に
|1C8470| db $FD, $0F ; kanji 戻
|1C8472| db $3A, $08, $34, $11, $3B, $30, $13, $0F ; るかもしれません
|1C847A| db $CD ; 。
|1C847B| db $F9 ; row 3
|1C847C| db $A3, $1A, $24 ; 3つの
|1C847F| db $FD, $53 ; kanji 紋
|1C8481| db $FD, $54 ; kanji 章
|1C8483| db $0E ; を
|1C8484| db $FD, $E0 ; kanji 集
|1C8486| db $33, $3A, $24, $36, $12, $CD ; めるのです。
|1C848C| db $FB ; end of message

;===================================================================================================
; Priest idle: go get the Master Sword
;===================================================================================================
; さあ,3つの紋章をもって
; 森へ行きなさい。
; マスターソードがまっています
;===================================================================================================
Message_0018:
|1C848D| db $10, $00, $C8, $A3, $1A, $24 ; さあ,3つの
|1C8493| db $FD, $53 ; kanji 紋
|1C8495| db $FD, $54 ; kanji 章
|1C8497| db $0E, $34, $4A, $1B ; をもって
|1C849B| db $F8 ; row 2
|1C849C| db $FD, $65 ; kanji 森
|1C849E| db $2B ; へ
|1C849F| db $FD, $02 ; kanji 行
|1C84A1| db $09, $20, $10, $01, $CD ; きなさい。
|1C84A6| db $F9 ; row 3
|1C84A7| db $80, $62, $68, $C9, $64, $C9, $87, $15 ; マスターソードが
|1C84AF| db $30, $4A, $1B, $01, $30, $12 ; まっています
|1C84B5| db $FB ; end of message

;===================================================================================================
; Priest dead
;===================================================================================================
; おお,[LINK] ひと足おそか
; った⋯。 私がふがいない
; ばっかりに,ゼルダ姫を城へ
; 連れて行かれてしまいました。
; お,おそらく城の塔の1ばん上
; にある部屋でしょう。
; ゼルダ姫が,イケニエにされる
; その前に,なんとか⋯
; ひ,姫を頼みま⋯す⋯。
;===================================================================================================
Message_0019:
|1C84B6| db $04, $04, $C8 ; おお,
|1C84B9| db $FE, $6A ; write player name
|1C84BB| db $FF, $29, $1C ; ␣ひと
|1C84BE| db $FD, $96 ; kanji 足
|1C84C0| db $04, $14, $08 ; おそか
|1C84C3| db $F8 ; row 2
|1C84C4| db $4A, $18, $CC, $CD, $FF ; った⋯。␣
|1C84C9| db $FD, $26 ; kanji 私
|1C84CB| db $15, $2A, $15, $01, $20, $01 ; がふがいない
|1C84D1| db $F9 ; row 3
|1C84D2| db $3D, $4A, $08, $39, $21, $C8, $77, $8A ; ばっかりに,ゼル
|1C84DA| db $7E ; ダ
|1C84DB| db $FD, $FF ; kanji 姫
|1C84DD| db $0E ; を
|1C84DE| db $FD, $01 ; kanji 城
|1C84E0| db $2B ; へ
|1C84E1| db $FA ; wait for key
|1C84E2| db $F6 ; scroll
|1C84E3| db $FD, $40 ; kanji 連
|1C84E5| db $3B, $1B ; れて
|1C84E7| db $FD, $02 ; kanji 行
|1C84E9| db $08, $3B, $1B, $11, $30, $01, $30, $11 ; かれてしまいまし
|1C84F1| db $18, $CD ; た。
|1C84F3| db $F6 ; scroll
|1C84F4| db $04, $C8, $04, $14, $38, $0A ; お,おそらく
|1C84FA| db $FD, $01 ; kanji 城
|1C84FC| db $24 ; の
|1C84FD| db $FD, $D5 ; kanji 塔
|1C84FF| db $24, $A1, $3D, $0F ; の1ばん
|1C8503| db $FD, $72 ; kanji 上
|1C8505| db $F6 ; scroll
|1C8506| db $21, $00, $3A ; にある
|1C8509| db $FD, $B7 ; kanji 部
|1C850B| db $FD, $3D ; kanji 屋
|1C850D| db $36, $11, $49, $02, $CD ; でしょう。
|1C8512| db $FA ; wait for key
|1C8513| db $F6 ; scroll
|1C8514| db $77, $8A, $7E ; ゼルダ
|1C8517| db $FD, $FF ; kanji 姫
|1C8519| db $15, $C8, $51, $5B, $71, $53, $21, $10 ; が,イケニエにさ
|1C8521| db $3B, $3A ; れる
|1C8523| db $F6 ; scroll
|1C8524| db $14, $24 ; その
|1C8526| db $FD, $78 ; kanji 前
|1C8528| db $21, $C8, $20, $0F, $1C, $08, $CC ; に,なんとか⋯
|1C852F| db $F6 ; scroll
|1C8530| db $29, $C8 ; ひ,
|1C8532| db $FD, $FF ; kanji 姫
|1C8534| db $0E ; を
|1C8535| db $FD, $08 ; kanji 頼
|1C8537| db $31, $30, $CC, $12, $CC, $CD ; みま⋯す⋯。
|1C853D| db $FB ; end of message

;===================================================================================================
; Zelda prison greeting
;===================================================================================================
; ありがとう [LINK]
; あなたが 近づいてくるのを
; 感じていたわ。
;===================================================================================================
Message_001A:
|1C853E| db $00, $39, $15, $1C, $02, $FF ; ありがとう␣
|1C8544| db $FE, $6A ; write player name
|1C8546| db $F8 ; row 2
|1C8547| db $00, $20, $18, $15, $FF ; あなたが␣
|1C854C| db $FD, $C8 ; kanji 近
|1C854E| db $35, $01, $1B, $0A, $3A, $24, $0E ; づいてくるのを
|1C8555| db $F9 ; row 3
|1C8556| db $FD, $C3 ; kanji 感
|1C8558| db $25, $1B, $01, $18, $0D, $CD ; じていたわ。
|1C855E| db $FB ; end of message

;===================================================================================================
; Zelda: Yes, Link rescued me!!!
;===================================================================================================
; 神父さま,本当に [LINK]の
; おかげです。
; 司祭が 言ってました。
; 『さいごのイケニエのお前を
; ささげれば賢者の封印は開く』
; って⋯ ⋯ ⋯
; ねえ [LINK] お願い!
; このハイラルの国を
; 司祭なんかに わたさないで。
; 7賢者の封印が 解かれたら
; 魔の力が どっとおしよせて
; くるわ。
; その前に ⋯ ⋯ ⋯
; その前に司祭を倒して!
; この国を守って!
; あなたなら きっとできる
; ⋯ あなたなら ⋯
;===================================================================================================
Message_001B:
|1C855F| db $FD, $05 ; kanji 神
|1C8561| db $FD, $06 ; kanji 父
|1C8563| db $10, $30, $C8 ; さま,
|1C8566| db $FD, $24 ; kanji 本
|1C8568| db $FD, $25 ; kanji 当
|1C856A| db $21, $FF ; に␣
|1C856C| db $FE, $6A ; write player name
|1C856E| db $24 ; の
|1C856F| db $F8 ; row 2
|1C8570| db $04, $08, $1D, $36, $12, $CD ; おかげです。
|1C8576| db $F9 ; row 3
|1C8577| db $FD, $0D ; kanji 司
|1C8579| db $FD, $17 ; kanji 祭
|1C857B| db $15, $FF ; が␣
|1C857D| db $FD, $16 ; kanji 言
|1C857F| db $4A, $1B, $30, $11, $18, $CD ; ってました。
|1C8585| db $FA ; wait for key
|1C8586| db $F6 ; scroll
|1C8587| db $C4, $10, $01, $1E, $24, $51, $5B, $71 ; 『さいごのイケニ
|1C858F| db $53, $24, $04 ; エのお
|1C8592| db $FD, $78 ; kanji 前
|1C8594| db $0E ; を
|1C8595| db $F6 ; scroll
|1C8596| db $10, $10, $1D, $3B, $3D ; ささげれば
|1C859B| db $FD, $C4 ; kanji 賢
|1C859D| db $FD, $1E ; kanji 者
|1C859F| db $24 ; の
|1C85A0| db $FD, $9E ; kanji 封
|1C85A2| db $FD, $35 ; kanji 印
|1C85A4| db $28 ; は
|1C85A5| db $FD, $4B ; kanji 開
|1C85A7| db $0A, $C5 ; く』
|1C85A9| db $F6 ; scroll
|1C85AA| db $4A, $1B, $CC, $FF, $CC, $FF, $CC ; って⋯␣⋯␣⋯
|1C85B1| db $FA ; wait for key
|1C85B2| db $F6 ; scroll
|1C85B3| db $23, $03, $FF ; ねえ␣
|1C85B6| db $FE, $6A ; write player name
|1C85B8| db $FF, $04 ; ␣お
|1C85BA| db $FD, $0A ; kanji 願
|1C85BC| db $01, $C7 ; い!
|1C85BE| db $F6 ; scroll
|1C85BF| db $0C, $24, $78, $51, $88, $8A, $24 ; このハイラルの
|1C85C6| db $FD, $2B ; kanji 国
|1C85C8| db $0E ; を
|1C85C9| db $F6 ; scroll
|1C85CA| db $FD, $0D ; kanji 司
|1C85CC| db $FD, $17 ; kanji 祭
|1C85CE| db $20, $0F, $08, $21, $FF, $0D, $18, $10 ; なんかに␣わたさ
|1C85D6| db $20, $01, $36, $CD ; ないで。
|1C85DA| db $FA ; wait for key
|1C85DB| db $F6 ; scroll
|1C85DC| db $A7 ; 7
|1C85DD| db $FD, $C4 ; kanji 賢
|1C85DF| db $FD, $1E ; kanji 者
|1C85E1| db $24 ; の
|1C85E2| db $FD, $9E ; kanji 封
|1C85E4| db $FD, $35 ; kanji 印
|1C85E6| db $15, $FF ; が␣
|1C85E8| db $FD, $1C ; kanji 解
|1C85EA| db $08, $3B, $18, $38 ; かれたら
|1C85EE| db $F6 ; scroll
|1C85EF| db $FD, $2D ; kanji 魔
|1C85F1| db $24 ; の
|1C85F2| db $FD, $99 ; kanji 力
|1C85F4| db $15, $FF, $37, $4A, $1C, $04, $11, $07 ; が␣どっとおしよ
|1C85FC| db $13, $1B ; せて
|1C85FE| db $F6 ; scroll
|1C85FF| db $0A, $3A, $0D, $CD ; くるわ。
|1C8603| db $FA ; wait for key
|1C8604| db $F6 ; scroll
|1C8605| db $14, $24 ; その
|1C8607| db $FD, $78 ; kanji 前
|1C8609| db $21, $FF, $CC, $FF, $CC, $FF, $CC ; に␣⋯␣⋯␣⋯
|1C8610| db $F6 ; scroll
|1C8611| db $F6 ; scroll
|1C8612| db $14, $24 ; その
|1C8614| db $FD, $78 ; kanji 前
|1C8616| db $21 ; に
|1C8617| db $FD, $0D ; kanji 司
|1C8619| db $FD, $17 ; kanji 祭
|1C861B| db $0E ; を
|1C861C| db $FD, $29 ; kanji 倒
|1C861E| db $11, $1B, $C7 ; して!
|1C8621| db $FA ; wait for key
|1C8622| db $F6 ; scroll
|1C8623| db $0C, $24 ; この
|1C8625| db $FD, $2B ; kanji 国
|1C8627| db $0E ; を
|1C8628| db $FD, $91 ; kanji 守
|1C862A| db $4A, $1B, $C7 ; って!
|1C862D| db $F6 ; scroll
|1C862E| db $00, $20, $18, $20, $38, $FF, $09, $4A ; あなたなら␣きっ
|1C8636| db $1C, $36, $09, $3A ; とできる
|1C863A| db $F6 ; scroll
|1C863B| db $FF, $FF, $FF, $CC, $FF, $00, $20, $18 ; ␣␣␣⋯␣あなた
|1C8643| db $20, $38, $FF, $CC ; なら␣⋯
|1C8647| db $FB ; end of message

;===================================================================================================
; Zelda in Sanctuary: good luck
;===================================================================================================
; [LINK] 気を付けてね!
; ここで あなたの無事を
; お祈りしているわ!
;===================================================================================================
Message_001C:
|1C8648| db $FE, $6A ; write player name
|1C864A| db $FF ; ␣
|1C864B| db $FD, $37 ; kanji 気
|1C864D| db $0E ; を
|1C864E| db $FD, $52 ; kanji 付
|1C8650| db $0B, $1B, $23, $C7 ; けてね!
|1C8654| db $F8 ; row 2
|1C8655| db $0C, $0C, $36, $FF, $00, $20, $18, $24 ; ここで␣あなたの
|1C865D| db $FD, $21 ; kanji 無
|1C865F| db $FD, $22 ; kanji 事
|1C8661| db $0E ; を
|1C8662| db $F9 ; row 3
|1C8663| db $04 ; お
|1C8664| db $FD, $AF ; kanji 祈
|1C8666| db $39, $11, $1B, $01, $3A, $0D, $C7 ; りしているわ!
|1C866D| db $FB ; end of message

;===================================================================================================
; Zelda bed telepathy
;===================================================================================================
; たすけて⋯ ⋯
; たすけてください⋯
; 私は,お城の地下ろうに
; 捕えられています。
; 私の名前はゼルダ⋯⋯
; 6人のイケニエが ささげられ
; 私が さいごの1人⋯
; 城にやって来た司祭アグニムは
; イケニエを使い,7賢者の封印
; を再び開こうとしています。
; ⋯ ⋯
; 私は,お城の地下ろうの中⋯
; たすけて⋯ ⋯
;===================================================================================================
Message_001D:
|1C866E| db $FE, $6B, $02 ; border: 2
|1C8671| db $FC, $06 ; text speed: 6
|1C8673| db $18, $12, $0B, $1B, $CC, $FF, $CC ; たすけて⋯␣⋯
|1C867A| db $FE, $78, $01 ; wait
|1C867D| db $F8 ; row 2
|1C867E| db $18, $12, $0B, $1B, $0A, $2E, $10, $01 ; たすけてください
|1C8686| db $CC ; ⋯
|1C8687| db $F9 ; row 3
|1C8688| db $FD, $26 ; kanji 私
|1C868A| db $28, $C8, $04 ; は,お
|1C868D| db $FD, $01 ; kanji 城
|1C868F| db $24 ; の
|1C8690| db $FD, $33 ; kanji 地
|1C8692| db $FD, $61 ; kanji 下
|1C8694| db $3C, $02, $21 ; ろうに
|1C8697| db $F6 ; scroll
|1C8698| db $FD, $9F ; kanji 捕
|1C869A| db $03, $38, $3B, $1B, $01, $30, $12, $CD ; えられています。
|1C86A2| db $FA ; wait for key
|1C86A3| db $F6 ; scroll
|1C86A4| db $FD, $26 ; kanji 私
|1C86A6| db $24 ; の
|1C86A7| db $FD, $6F ; kanji 名
|1C86A9| db $FD, $78 ; kanji 前
|1C86AB| db $28, $77, $8A, $7E, $CC, $CC ; はゼルダ⋯⋯
|1C86B1| db $F6 ; scroll
|1C86B2| db $A6 ; 6
|1C86B3| db $FD, $38 ; kanji 人
|1C86B5| db $24, $51, $5B, $71, $53, $15, $FF, $10 ; のイケニエが␣さ
|1C86BD| db $10, $1D, $38, $3B ; さげられ
|1C86C1| db $F6 ; scroll
|1C86C2| db $FD, $26 ; kanji 私
|1C86C4| db $15, $FF, $10, $01, $1E, $24, $A1 ; が␣さいごの1
|1C86CB| db $FD, $38 ; kanji 人
|1C86CD| db $CC ; ⋯
|1C86CE| db $FA ; wait for key
|1C86CF| db $F6 ; scroll
|1C86D0| db $FD, $01 ; kanji 城
|1C86D2| db $21, $05, $4A, $1B ; にやって
|1C86D6| db $FD, $D6 ; kanji 来
|1C86D8| db $18 ; た
|1C86D9| db $FD, $0D ; kanji 司
|1C86DB| db $FD, $17 ; kanji 祭
|1C86DD| db $50, $67, $71, $82, $28 ; アグニムは
|1C86E2| db $F6 ; scroll
|1C86E3| db $51, $5B, $71, $53, $0E ; イケニエを
|1C86E8| db $FD, $89 ; kanji 使
|1C86EA| db $01, $C8, $A7 ; い,7
|1C86ED| db $FD, $C4 ; kanji 賢
|1C86EF| db $FD, $1E ; kanji 者
|1C86F1| db $24 ; の
|1C86F2| db $FD, $9E ; kanji 封
|1C86F4| db $FD, $35 ; kanji 印
|1C86F6| db $F6 ; scroll
|1C86F7| db $0E ; を
|1C86F8| db $FD, $B3 ; kanji 再
|1C86FA| db $3E ; び
|1C86FB| db $FD, $4B ; kanji 開
|1C86FD| db $0C, $02, $1C, $11, $1B, $01, $30, $12 ; こうとしています
|1C8705| db $CD ; 。
|1C8706| db $FA ; wait for key
|1C8707| db $F6 ; scroll
|1C8708| db $FF, $CC, $FF, $CC ; ␣⋯␣⋯
|1C870C| db $F6 ; scroll
|1C870D| db $FD, $26 ; kanji 私
|1C870F| db $28, $C8, $04 ; は,お
|1C8712| db $FD, $01 ; kanji 城
|1C8714| db $24 ; の
|1C8715| db $FD, $33 ; kanji 地
|1C8717| db $FD, $61 ; kanji 下
|1C8719| db $3C, $02, $24 ; ろうの
|1C871C| db $FD, $AE ; kanji 中
|1C871E| db $CC ; ⋯
|1C871F| db $F6 ; scroll
|1C8720| db $18, $12, $0B, $1B, $CC, $FF, $CC ; たすけて⋯␣⋯
|1C8727| db $FB ; end of message

;===================================================================================================
; Zelda telepathy passage hint
;===================================================================================================
; たすけてください⋯
; 私は お城の地下ろうに
; 捕えられています。
; お城のまわりから,
; 中庭へ通じる抜け穴が
; あるはずよ。
;===================================================================================================
Message_001E:
|1C8728| db $FE, $6B, $02 ; border: 2
|1C872B| db $FC, $06 ; text speed: 6
|1C872D| db $18, $12, $0B, $1B, $0A, $2E, $10, $01 ; たすけてください
|1C8735| db $CC ; ⋯
|1C8736| db $F8 ; row 2
|1C8737| db $FD, $26 ; kanji 私
|1C8739| db $28, $FF, $04 ; は␣お
|1C873C| db $FD, $01 ; kanji 城
|1C873E| db $24 ; の
|1C873F| db $FD, $33 ; kanji 地
|1C8741| db $FD, $61 ; kanji 下
|1C8743| db $3C, $02, $21 ; ろうに
|1C8746| db $F9 ; row 3
|1C8747| db $FD, $9F ; kanji 捕
|1C8749| db $03, $38, $3B, $1B, $01, $30, $12, $CD ; えられています。
|1C8751| db $FA ; wait for key
|1C8752| db $F6 ; scroll
|1C8753| db $04 ; お
|1C8754| db $FD, $01 ; kanji 城
|1C8756| db $24, $30, $0D, $39, $08, $38, $C8 ; のまわりから,
|1C875D| db $F6 ; scroll
|1C875E| db $FD, $AE ; kanji 中
|1C8760| db $FD, $B5 ; kanji 庭
|1C8762| db $2B ; へ
|1C8763| db $FD, $09 ; kanji 通
|1C8765| db $25, $3A ; じる
|1C8767| db $FD, $1D ; kanji 抜
|1C8769| db $0B ; け
|1C876A| db $FD, $5C ; kanji 穴
|1C876C| db $15 ; が
|1C876D| db $F6 ; scroll
|1C876E| db $00, $3A, $28, $26, $07, $CD ; あるはずよ。
|1C8774| db $FB ; end of message

;===================================================================================================
; Zelda lobby hint: secret passage in throne room
;===================================================================================================
; お父様の部屋から教会に抜ける
; 通路があるわ。神父様はきっと
; 私達の力になってくれるわ。
;===================================================================================================
Message_001F:
|1C8775| db $04 ; お
|1C8776| db $FD, $06 ; kanji 父
|1C8778| db $FD, $10 ; kanji 様
|1C877A| db $24 ; の
|1C877B| db $FD, $B7 ; kanji 部
|1C877D| db $FD, $3D ; kanji 屋
|1C877F| db $08, $38 ; から
|1C8781| db $FD, $03 ; kanji 教
|1C8783| db $FD, $04 ; kanji 会
|1C8785| db $21 ; に
|1C8786| db $FD, $1D ; kanji 抜
|1C8788| db $0B, $3A ; ける
|1C878A| db $F8 ; row 2
|1C878B| db $FD, $09 ; kanji 通
|1C878D| db $FD, $B6 ; kanji 路
|1C878F| db $15, $00, $3A, $0D, $CD ; があるわ。
|1C8794| db $FD, $05 ; kanji 神
|1C8796| db $FD, $06 ; kanji 父
|1C8798| db $FD, $10 ; kanji 様
|1C879A| db $28, $09, $4A, $1C ; はきっと
|1C879E| db $F9 ; row 3
|1C879F| db $FD, $26 ; kanji 私
|1C87A1| db $FD, $13 ; kanji 達
|1C87A3| db $24 ; の
|1C87A4| db $FD, $99 ; kanji 力
|1C87A6| db $21, $20, $4A, $1B, $0A, $3B, $3A, $0D ; になってくれるわ
|1C87AE| db $CD ; 。
|1C87AF| db $FB ; end of message

;===================================================================================================
; Zelda throne room hint: push the shelf
;===================================================================================================
; このかざりだなが開くはずよ。
; 何かあかりはある? 中は
; まっくらで,何も見えないの。
; よういが良ければ行きましょう
; 左側から押すといいわ。
; 力をかして!
;===================================================================================================
Message_0020:
|1C87B0| db $0C, $24, $08, $1F, $39, $2E, $20, $15 ; このかざりだなが
|1C87B8| db $FD, $4B ; kanji 開
|1C87BA| db $0A, $28, $26, $07, $CD ; くはずよ。
|1C87BF| db $F8 ; row 2
|1C87C0| db $FD, $8B ; kanji 何
|1C87C2| db $08, $00, $08, $39, $28, $00, $3A, $C6 ; かあかりはある?
|1C87CA| db $FF ; ␣
|1C87CB| db $FD, $AE ; kanji 中
|1C87CD| db $28 ; は
|1C87CE| db $F9 ; row 3
|1C87CF| db $30, $4A, $0A, $38, $36, $C8 ; まっくらで,
|1C87D5| db $FD, $8B ; kanji 何
|1C87D7| db $34 ; も
|1C87D8| db $FD, $4C ; kanji 見
|1C87DA| db $03, $20, $01, $24, $CD ; えないの。
|1C87DF| db $FA ; wait for key
|1C87E0| db $F6 ; scroll
|1C87E1| db $07, $02, $01, $15 ; よういが
|1C87E5| db $FD, $32 ; kanji 良
|1C87E7| db $0B, $3B, $3D ; ければ
|1C87EA| db $FD, $02 ; kanji 行
|1C87EC| db $09, $30, $11, $49, $02 ; きましょう
|1C87F1| db $F6 ; scroll
|1C87F2| db $FD, $59 ; kanji 左
|1C87F4| db $FD, $5A ; kanji 側
|1C87F6| db $08, $38 ; から
|1C87F8| db $FD, $77 ; kanji 押
|1C87FA| db $12, $1C, $01, $01, $0D, $CD ; すといいわ。
|1C8800| db $F6 ; scroll
|1C8801| db $FD, $99 ; kanji 力
|1C8803| db $0E, $08, $11, $1B, $C7 ; をかして!
|1C8808| db $FB ; end of message

;===================================================================================================
; Zelda escape lever hint
;===================================================================================================
; ここのレバーを引くのよ。
; Aボタンを押したまま
; 十字ボタンを手前に入れてみて
;===================================================================================================
Message_0021:
|1C8809| db $0C, $0C, $24, $8B, $8D, $C9, $0E ; ここのレバーを
|1C8810| db $FD, $48 ; kanji 引
|1C8812| db $0A, $24, $07, $CD ; くのよ。
|1C8816| db $F8 ; row 2
|1C8817| db $AA, $91, $68, $5F, $0E ; Aボタンを
|1C881C| db $FD, $77 ; kanji 押
|1C881E| db $11, $18, $30, $30 ; したまま
|1C8822| db $F9 ; row 3
|1C8823| db $FD, $7A ; kanji 十
|1C8825| db $FD, $7B ; kanji 字
|1C8827| db $91, $68, $5F, $0E ; ボタンを
|1C882B| db $FD, $3E ; kanji 手
|1C882D| db $FD, $78 ; kanji 前
|1C882F| db $21 ; に
|1C8830| db $FD, $49 ; kanji 入
|1C8832| db $3B, $1B, $31, $1B ; れてみて
|1C8836| db $FB ; end of message

;===================================================================================================
; Zelda prison: Let's get outta here!
;===================================================================================================
; じゃあ,司祭に気づかれる前に
; 急いで逃げましょう!
; 私 秘密の抜け道を知ってるの
; とにかく,1Fのホールまで
; 私を連れて行って。
; さあ,急いで⋯。
;===================================================================================================
Message_0022:
|1C8837| db $25, $47, $00, $C8 ; じゃあ,
|1C883B| db $FD, $0D ; kanji 司
|1C883D| db $FD, $17 ; kanji 祭
|1C883F| db $21 ; に
|1C8840| db $FD, $37 ; kanji 気
|1C8842| db $35, $08, $3B, $3A ; づかれる
|1C8846| db $FD, $78 ; kanji 前
|1C8848| db $21 ; に
|1C8849| db $F8 ; row 2
|1C884A| db $FD, $7D ; kanji 急
|1C884C| db $01, $36 ; いで
|1C884E| db $FD, $DD ; kanji 逃
|1C8850| db $1D, $30, $11, $49, $02, $C7 ; げましょう!
|1C8856| db $F9 ; row 3
|1C8857| db $FD, $26 ; kanji 私
|1C8859| db $FF ; ␣
|1C885A| db $FD, $C1 ; kanji 秘
|1C885C| db $FD, $C2 ; kanji 密
|1C885E| db $24 ; の
|1C885F| db $FD, $1D ; kanji 抜
|1C8861| db $0B ; け
|1C8862| db $FD, $5D ; kanji 道
|1C8864| db $0E ; を
|1C8865| db $FD, $93 ; kanji 知
|1C8867| db $4A, $1B, $3A, $24 ; ってるの
|1C886B| db $FA ; wait for key
|1C886C| db $F6 ; scroll
|1C886D| db $1C, $21, $08, $0A, $C8, $A1, $AF, $24 ; とにかく,1Fの
|1C8875| db $7C, $C9, $8A, $30, $36 ; ホールまで
|1C887A| db $F6 ; scroll
|1C887B| db $FD, $26 ; kanji 私
|1C887D| db $0E ; を
|1C887E| db $FD, $40 ; kanji 連
|1C8880| db $3B, $1B ; れて
|1C8882| db $FD, $02 ; kanji 行
|1C8884| db $4A, $1B, $CD ; って。
|1C8887| db $F6 ; scroll
|1C8888| db $10, $00, $C8 ; さあ,
|1C888B| db $FD, $7D ; kanji 急
|1C888D| db $01, $36, $CC, $CD ; いで⋯。
|1C8891| db $FB ; end of message

;===================================================================================================
; Zelda's summary of the plot in prison
;===================================================================================================
; ⋯ ⋯ ⋯
; [LINK] よくきいて
; この城の兵たちは,みんな
; 司祭アグニムの,魔術に
; あやつられているの。
; お父様は,たぶん もう ⋯
; 司祭は,人間ではないわ!
; 強い力を持った悪魔よ!
; ⋯ ⋯ ⋯
; ねえ ちゃんときこえた?
; ▶ う ん
;   ぜんぜん
;===================================================================================================
Message_0023:
|1C8892| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C8898| db $F8 ; row 2
|1C8899| db $FE, $6A ; write player name
|1C889B| db $FF, $07, $0A, $09, $01, $1B ; ␣よくきいて
|1C88A1| db $F9 ; row 3
|1C88A2| db $0C, $24 ; この
|1C88A4| db $FD, $01 ; kanji 城
|1C88A6| db $24 ; の
|1C88A7| db $FD, $3A ; kanji 兵
|1C88A9| db $18, $19, $28, $C8, $31, $0F, $20 ; たちは,みんな
|1C88B0| db $FA ; wait for key
|1C88B1| db $F6 ; scroll
|1C88B2| db $FD, $0D ; kanji 司
|1C88B4| db $FD, $17 ; kanji 祭
|1C88B6| db $50, $67, $71, $82, $24, $C8 ; アグニムの,
|1C88BC| db $FD, $2D ; kanji 魔
|1C88BE| db $FD, $CB ; kanji 術
|1C88C0| db $21 ; に
|1C88C1| db $F6 ; scroll
|1C88C2| db $00, $05, $1A, $38, $3B, $1B, $01, $3A ; あやつられている
|1C88CA| db $24, $CD ; の。
|1C88CC| db $F6 ; scroll
|1C88CD| db $04 ; お
|1C88CE| db $FD, $06 ; kanji 父
|1C88D0| db $FD, $10 ; kanji 様
|1C88D2| db $28, $C8, $18, $3F, $0F, $FF, $34, $02 ; は,たぶん␣もう
|1C88DA| db $FF, $CC ; ␣⋯
|1C88DC| db $FA ; wait for key
|1C88DD| db $F6 ; scroll
|1C88DE| db $FD, $0D ; kanji 司
|1C88E0| db $FD, $17 ; kanji 祭
|1C88E2| db $28, $C8 ; は,
|1C88E4| db $FD, $38 ; kanji 人
|1C88E6| db $FD, $39 ; kanji 間
|1C88E8| db $36, $28, $20, $01, $0D, $C7 ; ではないわ!
|1C88EE| db $F6 ; scroll
|1C88EF| db $FD, $FB ; kanji 強
|1C88F1| db $01 ; い
|1C88F2| db $FD, $99 ; kanji 力
|1C88F4| db $0E ; を
|1C88F5| db $FD, $DB ; kanji 持
|1C88F7| db $4A, $18 ; った
|1C88F9| db $FD, $85 ; kanji 悪
|1C88FB| db $FD, $2D ; kanji 魔
|1C88FD| db $07, $C7 ; よ!
|1C88FF| db $F6 ; scroll
|1C8900| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C8906| db $FA ; wait for key
|1C8907| db $F6 ; scroll
|1C8908| db $23, $03, $FF, $19, $47, $0F, $1C, $09 ; ねえ␣ちゃんとき
|1C8910| db $0C, $03, $18, $C6 ; こえた?
|1C8914| db $F6 ; scroll
|1C8915| db $FF, $FF, $E4, $FF, $02, $FF, $FF, $0F ; ␣␣▶␣う␣␣ん
|1C891D| db $F6 ; scroll
|1C891E| db $FF, $FF, $FF, $FF, $27, $0F, $27, $0F ; ␣␣␣␣ぜんぜん
|1C8926| db $FE, $68 ; choose 2 low
|1C8928| db $FB ; end of message

;===================================================================================================
; Zelda in Sanctuary: follow the map
;===================================================================================================
; 長老が,印してくれた地図の点
; を頼りに行けば良いわ。
; 迷ったらうらない屋によってネ
;===================================================================================================
Message_0024:
|1C8929| db $FD, $8D ; kanji 長
|1C892B| db $FD, $E5 ; kanji 老
|1C892D| db $15, $C8 ; が,
|1C892F| db $FD, $35 ; kanji 印
|1C8931| db $11, $1B, $0A, $3B, $18 ; してくれた
|1C8936| db $FD, $33 ; kanji 地
|1C8938| db $FD, $34 ; kanji 図
|1C893A| db $24 ; の
|1C893B| db $FD, $74 ; kanji 点
|1C893D| db $F8 ; row 2
|1C893E| db $0E ; を
|1C893F| db $FD, $08 ; kanji 頼
|1C8941| db $39, $21 ; りに
|1C8943| db $FD, $02 ; kanji 行
|1C8945| db $0B, $3D ; けば
|1C8947| db $FD, $32 ; kanji 良
|1C8949| db $01, $0D, $CD ; いわ。
|1C894C| db $F9 ; row 3
|1C894D| db $FD, $70 ; kanji 迷
|1C894F| db $4A, $18, $38, $02, $38, $20, $01 ; ったらうらない
|1C8956| db $FD, $3D ; kanji 屋
|1C8958| db $21, $07, $4A, $1B, $73 ; によってネ
|1C895D| db $FB ; end of message

;===================================================================================================
; Zelda in Sanctuary: get the Master Sword
;===================================================================================================
; すごいわ! [LINK]⋯。
; やはり,あなたは『勇者』と
; なるべき力を秘めていたのよ!
; あとは,マスターソードを手に
; 入れるだけね! だいじょうぶ
; あなたなら司祭に勝てるわ!
;===================================================================================================
Message_0025:
|1C895E| db $12, $1E, $01, $0D, $C7, $FF ; すごいわ!␣
|1C8964| db $FE, $6A ; write player name
|1C8966| db $CC, $CD ; ⋯。
|1C8968| db $F8 ; row 2
|1C8969| db $05, $28, $39, $C8, $00, $20, $18, $28 ; やはり,あなたは
|1C8971| db $C4 ; 『
|1C8972| db $FD, $A0 ; kanji 勇
|1C8974| db $FD, $1E ; kanji 者
|1C8976| db $C5, $1C ; 』と
|1C8978| db $F9 ; row 3
|1C8979| db $20, $3A, $40, $09 ; なるべき
|1C897D| db $FD, $99 ; kanji 力
|1C897F| db $0E ; を
|1C8980| db $FD, $C1 ; kanji 秘
|1C8982| db $33, $1B, $01, $18, $24, $07, $C7 ; めていたのよ!
|1C8989| db $FA ; wait for key
|1C898A| db $F6 ; scroll
|1C898B| db $00, $1C, $28, $C8, $80, $62, $68, $C9 ; あとは,マスター
|1C8993| db $64, $C9, $87, $0E ; ソードを
|1C8997| db $FD, $3E ; kanji 手
|1C8999| db $21 ; に
|1C899A| db $F6 ; scroll
|1C899B| db $FD, $49 ; kanji 入
|1C899D| db $3B, $3A, $2E, $0B, $23, $C7, $FF, $2E ; れるだけね!␣だ
|1C89A5| db $01, $25, $49, $02, $3F ; いじょうぶ
|1C89AA| db $F6 ; scroll
|1C89AB| db $00, $20, $18, $20, $38 ; あなたなら
|1C89B0| db $FD, $0D ; kanji 司
|1C89B2| db $FD, $17 ; kanji 祭
|1C89B4| db $21 ; に
|1C89B5| db $FD, $DF ; kanji 勝
|1C89B7| db $1B, $3A, $0D, $C7 ; てるわ!
|1C89BB| db $FB ; end of message

;===================================================================================================
; Zelda Lost Woods telepathy
;===================================================================================================
; [LINK]! たすけて!
; し,城の兵たちが,教会へ⋯
; キャアァァ〜 ⋯ ⋯ ⋯
;===================================================================================================
Message_0026:
|1C89BC| db $FE, $6B, $02 ; border: 2
|1C89BF| db $FC, $06 ; text speed: 6
|1C89C1| db $FE, $6A ; write player name
|1C89C3| db $C7, $FF, $18, $12, $0B, $1B, $C7 ; !␣たすけて!
|1C89CA| db $F8 ; row 2
|1C89CB| db $11, $C8 ; し,
|1C89CD| db $FD, $01 ; kanji 城
|1C89CF| db $24 ; の
|1C89D0| db $FD, $3A ; kanji 兵
|1C89D2| db $18, $19, $15, $C8 ; たちが,
|1C89D6| db $FD, $03 ; kanji 教
|1C89D8| db $FD, $04 ; kanji 会
|1C89DA| db $2B, $CC ; へ⋯
|1C89DC| db $F9 ; row 3
|1C89DD| db $59, $97, $50, $9B, $9B, $CE, $FF, $CC ; キャアァァ〜␣⋯
|1C89E5| db $FF, $CC, $FF, $CC ; ␣⋯␣⋯
|1C89E9| db $FB ; end of message

;===================================================================================================
; Zelda sewer rats message
;===================================================================================================
; この水路をぬけてしまえば,
; 教会まであとすこし⋯。
; 気を付けて行きましょう。
;===================================================================================================
Message_0027:
|1C89EA| db $0C, $24 ; この
|1C89EC| db $FD, $66 ; kanji 水
|1C89EE| db $FD, $B6 ; kanji 路
|1C89F0| db $0E, $22, $0B, $1B, $11, $30, $03, $3D ; をぬけてしまえば
|1C89F8| db $C8 ; ,
|1C89F9| db $F8 ; row 2
|1C89FA| db $FD, $03 ; kanji 教
|1C89FC| db $FD, $04 ; kanji 会
|1C89FE| db $30, $36, $00, $1C, $12, $0C, $11, $CC ; まであとすこし⋯
|1C8A06| db $CD ; 。
|1C8A07| db $F9 ; row 3
|1C8A08| db $FD, $37 ; kanji 気
|1C8A0A| db $0E ; を
|1C8A0B| db $FD, $52 ; kanji 付
|1C8A0D| db $0B, $1B ; けて
|1C8A0F| db $FD, $02 ; kanji 行
|1C8A11| db $09, $30, $11, $49, $02, $CD ; きましょう。
|1C8A17| db $FB ; end of message

;===================================================================================================
; Zelda switch hint just before Sanctuary (the skippable one)
;===================================================================================================
; この先が,教会の中なの。
; この部屋のスイッチを引っぱる
; のよ。
;===================================================================================================
Message_0028:
|1C8A18| db $0C, $24 ; この
|1C8A1A| db $FD, $9C ; kanji 先
|1C8A1C| db $15, $C8 ; が,
|1C8A1E| db $FD, $03 ; kanji 教
|1C8A20| db $FD, $04 ; kanji 会
|1C8A22| db $24 ; の
|1C8A23| db $FD, $AE ; kanji 中
|1C8A25| db $20, $24, $CD ; なの。
|1C8A28| db $F8 ; row 2
|1C8A29| db $0C, $24 ; この
|1C8A2B| db $FD, $B7 ; kanji 部
|1C8A2D| db $FD, $3D ; kanji 屋
|1C8A2F| db $24, $62, $51, $9A, $69, $0E ; のスイッチを
|1C8A35| db $FD, $48 ; kanji 引
|1C8A37| db $4A, $42, $3A ; っぱる
|1C8A3A| db $F9 ; row 3
|1C8A3B| db $24, $07, $CD ; のよ。
|1C8A3E| db $FB ; end of message

;===================================================================================================
; Mrs. Sahasrahla talks about her husband's disappearance
;===================================================================================================
; おや,[LINK]や
; ババに何かようかのう。
; 長老? ああ あの人は
; 司祭が イケニエを集め始めた
; ころから,家を出てますのじゃ
; ⋯ ⋯ ⋯
; なに マスターソードとな?
; くわしい事は忘れてしもうたが
;===================================================================================================
Message_0029:
|1C8A3F| db $04, $05, $C8 ; おや,
|1C8A42| db $FE, $6A ; write player name
|1C8A44| db $05 ; や
|1C8A45| db $F8 ; row 2
|1C8A46| db $8D, $8D, $21 ; ババに
|1C8A49| db $FD, $8B ; kanji 何
|1C8A4B| db $08, $07, $02, $08, $24, $02, $CD ; かようかのう。
|1C8A52| db $F9 ; row 3
|1C8A53| db $FA ; wait for key
|1C8A54| db $F6 ; scroll
|1C8A55| db $FD, $8D ; kanji 長
|1C8A57| db $FD, $E5 ; kanji 老
|1C8A59| db $C6, $FF, $00, $00, $FF, $00, $24 ; ?␣ああ␣あの
|1C8A60| db $FD, $38 ; kanji 人
|1C8A62| db $28 ; は
|1C8A63| db $F6 ; scroll
|1C8A64| db $FD, $0D ; kanji 司
|1C8A66| db $FD, $17 ; kanji 祭
|1C8A68| db $15, $FF, $51, $5B, $71, $53, $0E ; が␣イケニエを
|1C8A6F| db $FD, $E0 ; kanji 集
|1C8A71| db $33 ; め
|1C8A72| db $FD, $E1 ; kanji 始
|1C8A74| db $33, $18 ; めた
|1C8A76| db $F6 ; scroll
|1C8A77| db $0C, $3C, $08, $38, $C8 ; ころから,
|1C8A7C| db $FD, $56 ; kanji 家
|1C8A7E| db $0E ; を
|1C8A7F| db $FD, $23 ; kanji 出
|1C8A81| db $1B, $30, $12, $24, $25, $47 ; てますのじゃ
|1C8A87| db $FA ; wait for key
|1C8A88| db $F6 ; scroll
|1C8A89| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C8A8F| db $F6 ; scroll
|1C8A90| db $20, $21, $FF, $80, $62, $68, $C9, $64 ; なに␣マスターソ
|1C8A98| db $C9, $87, $1C, $20, $C6 ; ードとな?
|1C8A9D| db $F6 ; scroll
|1C8A9E| db $0A, $0D, $11, $01 ; くわしい
|1C8AA2| db $FD, $22 ; kanji 事
|1C8AA4| db $28 ; は
|1C8AA5| db $FD, $D8 ; kanji 忘
|1C8AA7| db $3B, $1B, $11, $34, $02, $18, $15 ; れてしもうたが
|1C8AAE| db $FB ; end of message

;===================================================================================================
; Mrs. Sahasrahla talks about the legend of Hylia
;===================================================================================================
; 今より はるか昔この地に
; ハイリア族と呼ばれる民が
; さかえておったそうじゃ⋯。
; この国には,その民の残した
; 宝がいくつか かくされておる
; と言うことでな⋯。
; マスターソードは その中でも
; 魔の力を持つ者に対して 特に
; きたえられた剣だときいておる
; そして今も 森の奥深く
; しずかにねむっているはずじゃ
; ⋯ ⋯ ⋯
; ちゃんときこえたかのう?
; ▶ う ん
;   ぜんぜん
;===================================================================================================
Message_002A:
|1C8AAF| db $FD, $6A ; kanji 今
|1C8AB1| db $07, $39, $FF, $28, $3A, $08 ; より␣はるか
|1C8AB7| db $FD, $7E ; kanji 昔
|1C8AB9| db $0C, $24 ; この
|1C8ABB| db $FD, $33 ; kanji 地
|1C8ABD| db $21 ; に
|1C8ABE| db $F8 ; row 2
|1C8ABF| db $78, $51, $89, $50 ; ハイリア
|1C8AC3| db $FD, $F2 ; kanji 族
|1C8AC5| db $1C ; と
|1C8AC6| db $FD, $50 ; kanji 呼
|1C8AC8| db $3D, $3B, $3A ; ばれる
|1C8ACB| db $FD, $F8 ; kanji 民
|1C8ACD| db $15 ; が
|1C8ACE| db $F9 ; row 3
|1C8ACF| db $10, $08, $03, $1B, $04, $4A, $18, $14 ; さかえておったそ
|1C8AD7| db $02, $25, $47, $CC, $CD ; うじゃ⋯。
|1C8ADC| db $FA ; wait for key
|1C8ADD| db $F6 ; scroll
|1C8ADE| db $0C, $24 ; この
|1C8AE0| db $FD, $2B ; kanji 国
|1C8AE2| db $21, $28, $C8, $14, $24 ; には,その
|1C8AE7| db $FD, $F8 ; kanji 民
|1C8AE9| db $24 ; の
|1C8AEA| db $FD, $C6 ; kanji 残
|1C8AEC| db $11, $18 ; した
|1C8AEE| db $F6 ; scroll
|1C8AEF| db $FD, $9A ; kanji 宝
|1C8AF1| db $15, $01, $0A, $1A, $08, $FF, $08, $0A ; がいくつか␣かく
|1C8AF9| db $10, $3B, $1B, $04, $3A ; されておる
|1C8AFE| db $F6 ; scroll
|1C8AFF| db $1C ; と
|1C8B00| db $FD, $16 ; kanji 言
|1C8B02| db $02, $0C, $1C, $36, $20, $CC, $CD ; うことでな⋯。
|1C8B09| db $FA ; wait for key
|1C8B0A| db $F6 ; scroll
|1C8B0B| db $80, $62, $68, $C9, $64, $C9, $87, $28 ; マスターソードは
|1C8B13| db $FF, $14, $24 ; ␣その
|1C8B16| db $FD, $AE ; kanji 中
|1C8B18| db $36, $34 ; でも
|1C8B1A| db $F6 ; scroll
|1C8B1B| db $FD, $2D ; kanji 魔
|1C8B1D| db $24 ; の
|1C8B1E| db $FD, $99 ; kanji 力
|1C8B20| db $0E ; を
|1C8B21| db $FD, $DB ; kanji 持
|1C8B23| db $1A ; つ
|1C8B24| db $FD, $1E ; kanji 者
|1C8B26| db $21 ; に
|1C8B27| db $FD, $EC ; kanji 対
|1C8B29| db $11, $1B, $FF ; して␣
|1C8B2C| db $FD, $ED ; kanji 特
|1C8B2E| db $21 ; に
|1C8B2F| db $F6 ; scroll
|1C8B30| db $09, $18, $03, $38, $3B, $18 ; きたえられた
|1C8B36| db $FD, $1A ; kanji 剣
|1C8B38| db $2E, $1C, $09, $01, $1B, $04, $3A ; だときいておる
|1C8B3F| db $FA ; wait for key
|1C8B40| db $F6 ; scroll
|1C8B41| db $14, $11, $1B ; そして
|1C8B44| db $FD, $6A ; kanji 今
|1C8B46| db $34, $FF ; も␣
|1C8B48| db $FD, $65 ; kanji 森
|1C8B4A| db $24 ; の
|1C8B4B| db $FD, $80 ; kanji 奥
|1C8B4D| db $FD, $64 ; kanji 深
|1C8B4F| db $0A ; く
|1C8B50| db $F6 ; scroll
|1C8B51| db $11, $26, $08, $21, $23, $32, $4A, $1B ; しずかにねむって
|1C8B59| db $01, $3A, $28, $26, $25, $47 ; いるはずじゃ
|1C8B5F| db $F6 ; scroll
|1C8B60| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C8B66| db $FA ; wait for key
|1C8B67| db $F6 ; scroll
|1C8B68| db $19, $47, $0F, $1C, $09, $0C, $03, $18 ; ちゃんときこえた
|1C8B70| db $08, $24, $02, $C6 ; かのう?
|1C8B74| db $F6 ; scroll
|1C8B75| db $FF, $FF, $E4, $FF, $02, $FF, $FF, $0F ; ␣␣▶␣う␣␣ん
|1C8B7D| db $F6 ; scroll
|1C8B7E| db $FF, $FF, $FF, $FF, $27, $0F, $27, $0F ; ␣␣␣␣ぜんぜん
|1C8B86| db $FE, $68 ; choose 2 low
|1C8B88| db $FB ; end of message

;===================================================================================================
; Mrs. Sahasrahla hints at someone else knowing where her husband is
;===================================================================================================
; ともかく,長老を探しなされ。
; 村の者の誰かが,あの人のい
; どころを知っておるはずじゃ。
; はようみつかると良いがのう。
; [LINK]や,気を付けて行かれ
; なさいよ⋯。
;===================================================================================================
Message_002B:
|1C8B89| db $1C, $34, $08, $0A, $C8 ; ともかく,
|1C8B8E| db $FD, $8D ; kanji 長
|1C8B90| db $FD, $E5 ; kanji 老
|1C8B92| db $0E ; を
|1C8B93| db $FD, $69 ; kanji 探
|1C8B95| db $11, $20, $10, $3B, $CD ; しなされ。
|1C8B9A| db $F8 ; row 2
|1C8B9B| db $FD, $8C ; kanji 村
|1C8B9D| db $24 ; の
|1C8B9E| db $FD, $1E ; kanji 者
|1C8BA0| db $24 ; の
|1C8BA1| db $FD, $95 ; kanji 誰
|1C8BA3| db $08, $15, $C8, $00, $24 ; かが,あの
|1C8BA8| db $FD, $38 ; kanji 人
|1C8BAA| db $24, $01 ; のい
|1C8BAC| db $F9 ; row 3
|1C8BAD| db $37, $0C, $3C, $0E ; どころを
|1C8BB1| db $FD, $93 ; kanji 知
|1C8BB3| db $4A, $1B, $04, $3A, $28, $26, $25, $47 ; っておるはずじゃ
|1C8BBB| db $CD ; 。
|1C8BBC| db $FA ; wait for key
|1C8BBD| db $F6 ; scroll
|1C8BBE| db $28, $07, $02, $31, $1A, $08, $3A, $1C ; はようみつかると
|1C8BC6| db $FD, $32 ; kanji 良
|1C8BC8| db $01, $15, $24, $02, $CD ; いがのう。
|1C8BCD| db $F6 ; scroll
|1C8BCE| db $FE, $6A ; write player name
|1C8BD0| db $05, $C8 ; や,
|1C8BD2| db $FD, $37 ; kanji 気
|1C8BD4| db $0E ; を
|1C8BD5| db $FD, $52 ; kanji 付
|1C8BD7| db $0B, $1B ; けて
|1C8BD9| db $FD, $02 ; kanji 行
|1C8BDB| db $08, $3B ; かれ
|1C8BDD| db $F6 ; scroll
|1C8BDE| db $20, $10, $01, $07, $CC, $CD ; なさいよ⋯。
|1C8BE4| db $FB ; end of message

;===================================================================================================
; Mrs. Sahasrahla when the Master Sword is had
;===================================================================================================
; おお,[LINK]や
; りっぱになったのう。どうか
; 村人達を救ってやって下され。
;===================================================================================================
Message_002C:
|1C8BE5| db $04, $04, $C8 ; おお,
|1C8BE8| db $FE, $6A ; write player name
|1C8BEA| db $05 ; や
|1C8BEB| db $F8 ; row 2
|1C8BEC| db $39, $4A, $42, $21, $20, $4A, $18, $24 ; りっぱになったの
|1C8BF4| db $02, $CD, $37, $02, $08 ; う。どうか
|1C8BF9| db $F9 ; row 3
|1C8BFA| db $FD, $8C ; kanji 村
|1C8BFC| db $FD, $38 ; kanji 人
|1C8BFE| db $FD, $13 ; kanji 達
|1C8C00| db $0E ; を
|1C8C01| db $FD, $28 ; kanji 救
|1C8C03| db $4A, $1B, $05, $4A, $1B ; ってやって
|1C8C08| db $FD, $61 ; kanji 下
|1C8C0A| db $10, $3B, $CD ; され。
|1C8C0D| db $FB ; end of message

;===================================================================================================
; Snitches being snitches
;===================================================================================================
; あっ! おたずね者の
; [LINK]だ!
; へいたいの みなさぁ〜ん
;===================================================================================================
Message_002D:
|1C8C0E| db $00, $4A, $C7, $FF, $04, $18, $26, $23 ; あっ!␣おたずね
|1C8C16| db $FD, $1E ; kanji 者
|1C8C18| db $24 ; の
|1C8C19| db $F8 ; row 2
|1C8C1A| db $FE, $6A ; write player name
|1C8C1C| db $2E, $C7 ; だ!
|1C8C1E| db $F9 ; row 3
|1C8C1F| db $2B, $01, $18, $01, $24, $FF, $31, $20 ; へいたいの␣みな
|1C8C27| db $10, $4B, $CE, $0F ; さぁ〜ん
|1C8C2B| db $FB ; end of message

;===================================================================================================
; Sahasrahla when every pendant is had
;===================================================================================================
; ううむ,ついに3つの紋章を
; 手に入れたか⋯
; よし まよいの森へ行くが良い
; お前が まことの勇者ならば
; 剣の方で お前を選ぶであろう
; ⋯ ⋯ ⋯ 。
;===================================================================================================
Message_002E:
|1C8C2C| db $FE, $6D, $01 ; position: low
|1C8C2F| db $02, $02, $32, $C8, $1A, $01, $21, $A3 ; ううむ,ついに3
|1C8C37| db $1A, $24 ; つの
|1C8C39| db $FD, $53 ; kanji 紋
|1C8C3B| db $FD, $54 ; kanji 章
|1C8C3D| db $0E ; を
|1C8C3E| db $F8 ; row 2
|1C8C3F| db $FD, $3E ; kanji 手
|1C8C41| db $21 ; に
|1C8C42| db $FD, $49 ; kanji 入
|1C8C44| db $3B, $18, $08, $CC ; れたか⋯
|1C8C48| db $F9 ; row 3
|1C8C49| db $07, $11, $FF, $30, $07, $01, $24 ; よし␣まよいの
|1C8C50| db $FD, $65 ; kanji 森
|1C8C52| db $2B ; へ
|1C8C53| db $FD, $02 ; kanji 行
|1C8C55| db $0A, $15 ; くが
|1C8C57| db $FD, $32 ; kanji 良
|1C8C59| db $01 ; い
|1C8C5A| db $FA ; wait for key
|1C8C5B| db $F6 ; scroll
|1C8C5C| db $04 ; お
|1C8C5D| db $FD, $78 ; kanji 前
|1C8C5F| db $15, $FF, $30, $0C, $1C, $24 ; が␣まことの
|1C8C65| db $FD, $A0 ; kanji 勇
|1C8C67| db $FD, $1E ; kanji 者
|1C8C69| db $20, $38, $3D ; ならば
|1C8C6C| db $F6 ; scroll
|1C8C6D| db $FD, $1A ; kanji 剣
|1C8C6F| db $24 ; の
|1C8C70| db $FD, $20 ; kanji 方
|1C8C72| db $36, $FF, $04 ; で␣お
|1C8C75| db $FD, $78 ; kanji 前
|1C8C77| db $0E ; を
|1C8C78| db $FD, $81 ; kanji 選
|1C8C7A| db $3F, $36, $00, $3C, $02 ; ぶであろう
|1C8C7F| db $F6 ; scroll
|1C8C80| db $FF, $FF, $FF, $CC, $FF, $CC, $FF, $CC ; ␣␣␣⋯␣⋯␣⋯
|1C8C88| db $FF, $CD ; ␣。
|1C8C8A| db $FB ; end of message

;===================================================================================================
; Sahasrahla when the Master Sword is had
;===================================================================================================
; ワシらは,おいぼれて
; たたかえぬ。
; お前だけが,頼りなのじゃ⋯
;===================================================================================================
Message_002F:
|1C8C8B| db $FE, $6D, $01 ; position: low
|1C8C8E| db $5D, $61, $38, $28, $C8, $04, $01, $41 ; ワシらは,おいぼ
|1C8C96| db $3B, $1B ; れて
|1C8C98| db $F8 ; row 2
|1C8C99| db $18, $18, $08, $03, $22, $CD ; たたかえぬ。
|1C8C9F| db $F9 ; row 3
|1C8CA0| db $04 ; お
|1C8CA1| db $FD, $78 ; kanji 前
|1C8CA3| db $2E, $0B, $15, $C8 ; だけが,
|1C8CA7| db $FD, $08 ; kanji 頼
|1C8CA9| db $39, $20, $24, $25, $47, $CC ; りなのじゃ⋯
|1C8CAF| db $FB ; end of message

;===================================================================================================
; Sahasrahla when no green pendant
;===================================================================================================
; いかにもワシが長老であり
; 7賢者のしそんの1人
; サハスラーラじゃ。
; ⋯ ⋯ ⋯ なんと
; [LINK]よ,おさないお前が
; 退魔の剣を 求めておるのか!
; じゃが あの剣は誰でも使える
; わけではのうてな。
; 3匹の魔物を倒し3つの紋章を
; 手にした『勇者』だけが使い手
; になれるとハイリアの民は
; 伝えとる ⋯ ⋯ ⋯
; いどんでみるか?
; ▶ う ん
;   もちろん
;===================================================================================================
Message_0030:
|1C8CB0| db $FE, $6D, $01 ; position: low
|1C8CB3| db $01, $08, $21, $34, $5D, $61, $15 ; いかにもワシが
|1C8CBA| db $FD, $8D ; kanji 長
|1C8CBC| db $FD, $E5 ; kanji 老
|1C8CBE| db $36, $00, $39 ; であり
|1C8CC1| db $F8 ; row 2
|1C8CC2| db $A7 ; 7
|1C8CC3| db $FD, $C4 ; kanji 賢
|1C8CC5| db $FD, $1E ; kanji 者
|1C8CC7| db $24, $11, $14, $0F, $24, $A1 ; のしそんの1
|1C8CCD| db $FD, $38 ; kanji 人
|1C8CCF| db $F9 ; row 3
|1C8CD0| db $60, $78, $62, $88, $C9, $88, $25, $47 ; サハスラーラじゃ
|1C8CD8| db $CD ; 。
|1C8CD9| db $FA ; wait for key
|1C8CDA| db $F6 ; scroll
|1C8CDB| db $FF, $CC, $FF, $CC, $FF, $CC, $FF, $FF ; ␣⋯␣⋯␣⋯␣␣
|1C8CE3| db $20, $0F, $1C ; なんと
|1C8CE6| db $F6 ; scroll
|1C8CE7| db $FE, $6A ; write player name
|1C8CE9| db $07, $C8, $04, $10, $20, $01, $04 ; よ,おさないお
|1C8CF0| db $FD, $78 ; kanji 前
|1C8CF2| db $15 ; が
|1C8CF3| db $F6 ; scroll
|1C8CF4| db $FD, $2C ; kanji 退
|1C8CF6| db $FD, $2D ; kanji 魔
|1C8CF8| db $24 ; の
|1C8CF9| db $FD, $1A ; kanji 剣
|1C8CFB| db $0E, $FF ; を␣
|1C8CFD| db $FD, $9B ; kanji 求
|1C8CFF| db $33, $1B, $04, $3A, $24, $08, $C7 ; めておるのか!
|1C8D06| db $FA ; wait for key
|1C8D07| db $F6 ; scroll
|1C8D08| db $25, $47, $15, $FF, $00, $24 ; じゃが␣あの
|1C8D0E| db $FD, $1A ; kanji 剣
|1C8D10| db $28 ; は
|1C8D11| db $FD, $95 ; kanji 誰
|1C8D13| db $36, $34 ; でも
|1C8D15| db $FD, $89 ; kanji 使
|1C8D17| db $03, $3A ; える
|1C8D19| db $F6 ; scroll
|1C8D1A| db $0D, $0B, $36, $28, $24, $02, $1B, $20 ; わけではのうてな
|1C8D22| db $CD ; 。
|1C8D23| db $F6 ; scroll
|1C8D24| db $A3 ; 3
|1C8D25| db $FD, $8F ; kanji 匹
|1C8D27| db $24 ; の
|1C8D28| db $FD, $2D ; kanji 魔
|1C8D2A| db $FD, $51 ; kanji 物
|1C8D2C| db $0E ; を
|1C8D2D| db $FD, $29 ; kanji 倒
|1C8D2F| db $11, $A3, $1A, $24 ; し3つの
|1C8D33| db $FD, $53 ; kanji 紋
|1C8D35| db $FD, $54 ; kanji 章
|1C8D37| db $0E ; を
|1C8D38| db $FA ; wait for key
|1C8D39| db $F6 ; scroll
|1C8D3A| db $FD, $3E ; kanji 手
|1C8D3C| db $21, $11, $18, $C4 ; にした『
|1C8D40| db $FD, $A0 ; kanji 勇
|1C8D42| db $FD, $1E ; kanji 者
|1C8D44| db $C5, $2E, $0B, $15 ; 』だけが
|1C8D48| db $FD, $89 ; kanji 使
|1C8D4A| db $01 ; い
|1C8D4B| db $FD, $3E ; kanji 手
|1C8D4D| db $F6 ; scroll
|1C8D4E| db $21, $20, $3B, $3A, $1C, $78, $51, $89 ; になれるとハイリ
|1C8D56| db $50, $24 ; アの
|1C8D58| db $FD, $F8 ; kanji 民
|1C8D5A| db $28 ; は
|1C8D5B| db $F6 ; scroll
|1C8D5C| db $FD, $2E ; kanji 伝
|1C8D5E| db $03, $1C, $3A, $FF, $CC, $FF, $CC, $FF ; えとる␣⋯␣⋯␣
|1C8D66| db $CC ; ⋯
|1C8D67| db $FA ; wait for key
|1C8D68| db $F6 ; scroll
|1C8D69| db $01, $37, $0F, $36, $31, $3A, $08, $C6 ; いどんでみるか?
|1C8D71| db $F6 ; scroll
|1C8D72| db $FF, $FF, $E4, $FF, $02, $FF, $FF, $0F ; ␣␣▶␣う␣␣ん
|1C8D7A| db $F6 ; scroll
|1C8D7B| db $FF, $FF, $FF, $FF, $34, $19, $3C, $0F ; ␣␣␣␣もちろん
|1C8D83| db $FE, $68 ; choose 2 low
|1C8D85| db $FB ; end of message

;===================================================================================================
; Sahasrahla asking Link to get the pendant
;===================================================================================================
; よし,ならば,この神殿にある
; 『勇気の紋章』を 手に入れる
; ことができるか?
; みごと持ち帰ったならば,ワシ
; の知っている話を教えてやろう
; さあ,神殿へ行くが良い。
;===================================================================================================
Message_0031:
|1C8D86| db $FE, $6D, $01 ; position: low
|1C8D89| db $07, $11, $C8, $20, $38, $3D, $C8, $0C ; よし,ならば,こ
|1C8D91| db $24 ; の
|1C8D92| db $FD, $05 ; kanji 神
|1C8D94| db $FD, $90 ; kanji 殿
|1C8D96| db $21, $00, $3A ; にある
|1C8D99| db $F8 ; row 2
|1C8D9A| db $C4 ; 『
|1C8D9B| db $FD, $A0 ; kanji 勇
|1C8D9D| db $FD, $37 ; kanji 気
|1C8D9F| db $24 ; の
|1C8DA0| db $FD, $53 ; kanji 紋
|1C8DA2| db $FD, $54 ; kanji 章
|1C8DA4| db $C5, $0E, $FF ; 』を␣
|1C8DA7| db $FD, $3E ; kanji 手
|1C8DA9| db $21 ; に
|1C8DAA| db $FD, $49 ; kanji 入
|1C8DAC| db $3B, $3A ; れる
|1C8DAE| db $F9 ; row 3
|1C8DAF| db $0C, $1C, $15, $36, $09, $3A, $08, $C6 ; ことができるか?
|1C8DB7| db $FA ; wait for key
|1C8DB8| db $F6 ; scroll
|1C8DB9| db $31, $1E, $1C ; みごと
|1C8DBC| db $FD, $DB ; kanji 持
|1C8DBE| db $19 ; ち
|1C8DBF| db $FD, $D7 ; kanji 帰
|1C8DC1| db $4A, $18, $20, $38, $3D, $C8, $5D, $61 ; ったならば,ワシ
|1C8DC9| db $F6 ; scroll
|1C8DCA| db $24 ; の
|1C8DCB| db $FD, $93 ; kanji 知
|1C8DCD| db $4A, $1B, $01, $3A ; っている
|1C8DD1| db $FD, $A3 ; kanji 話
|1C8DD3| db $0E ; を
|1C8DD4| db $FD, $03 ; kanji 教
|1C8DD6| db $03, $1B, $05, $3C, $02 ; えてやろう
|1C8DDB| db $FE, $79, $2D ; SFX3.2D
|1C8DDE| db $F6 ; scroll
|1C8DDF| db $10, $00, $C8 ; さあ,
|1C8DE2| db $FD, $05 ; kanji 神
|1C8DE4| db $FD, $90 ; kanji 殿
|1C8DE6| db $2B ; へ
|1C8DE7| db $FD, $02 ; kanji 行
|1C8DE9| db $0A, $15 ; くが
|1C8DEB| db $FD, $32 ; kanji 良
|1C8DED| db $01, $CD ; い。
|1C8DEF| db $FB ; end of message

;===================================================================================================
; Sahasrahla when missing pendants
;===================================================================================================
; ワシの他にも7賢者のしそんが
; 城の者の目をのがれて姿をかく
; しておるはず。探しなされ。
;===================================================================================================
Message_0032:
|1C8DF0| db $FE, $6D, $01 ; position: low
|1C8DF3| db $5D, $61, $24 ; ワシの
|1C8DF6| db $FD, $27 ; kanji 他
|1C8DF8| db $21, $34, $A7 ; にも7
|1C8DFB| db $FD, $C4 ; kanji 賢
|1C8DFD| db $FD, $1E ; kanji 者
|1C8DFF| db $24, $11, $14, $0F, $15 ; のしそんが
|1C8E04| db $F8 ; row 2
|1C8E05| db $FD, $01 ; kanji 城
|1C8E07| db $24 ; の
|1C8E08| db $FD, $1E ; kanji 者
|1C8E0A| db $24 ; の
|1C8E0B| db $FD, $75 ; kanji 目
|1C8E0D| db $0E, $24, $15, $3B, $1B ; をのがれて
|1C8E12| db $FD, $A2 ; kanji 姿
|1C8E14| db $0E, $08, $0A ; をかく
|1C8E17| db $F9 ; row 3
|1C8E18| db $11, $1B, $04, $3A, $28, $26, $CD ; しておるはず。
|1C8E1F| db $FD, $69 ; kanji 探
|1C8E21| db $11, $20, $10, $3B, $CD ; しなされ。
|1C8E26| db $FB ; end of message

;===================================================================================================
; Sahasrahla pyramid telepathy
;===================================================================================================
; [LINK]よ,このサハスラーラ
; の声がきこえるか? お前が
; 今,立っているのは,もとは
; 聖地とよばれていた世界⋯
; しかし,今では魔族のはびこる
; 言わば,闇の世界じゃ。
; 司祭は,封印をとき城の入口に
; 闇世界とこちら側を結ぶ通り道
; を開いてしまったようじゃ。
; 再び,こちらの世界を救うには
; 『黄金の力』をとり戻すしか
; 道は残されておらぬ!
; 7人の娘達を助けてやってくれ
; 7賢者の血をひく彼女らの力
; 必ず,やくにたつであろう!
; 娘達は,それぞれ魔物のかくれ
; 家に封じこめられておる。まず
; ヤミの神殿へ向かうのじゃ!
; 頼りは,お前だけ⋯
; このサハスラーラの願いをかな
; えてくれ! 頼むぞ[LINK]よ
;===================================================================================================
Message_0033:
|1C8E27| db $FE, $6B, $02 ; border: 2
|1C8E2A| db $FC, $06 ; text speed: 6
|1C8E2C| db $FE, $6A ; write player name
|1C8E2E| db $07, $C8, $0C, $24, $60, $78, $62, $88 ; よ,このサハスラ
|1C8E36| db $C9, $88 ; ーラ
|1C8E38| db $F8 ; row 2
|1C8E39| db $24 ; の
|1C8E3A| db $FD, $60 ; kanji 声
|1C8E3C| db $15, $09, $0C, $03, $3A, $08, $C6, $FF ; がきこえるか?␣
|1C8E44| db $04 ; お
|1C8E45| db $FD, $78 ; kanji 前
|1C8E47| db $15 ; が
|1C8E48| db $F9 ; row 3
|1C8E49| db $FD, $6A ; kanji 今
|1C8E4B| db $C8 ; ,
|1C8E4C| db $FD, $71 ; kanji 立
|1C8E4E| db $4A, $1B, $01, $3A, $24, $28, $C8, $34 ; っているのは,も
|1C8E56| db $1C, $28 ; とは
|1C8E58| db $FA ; wait for key
|1C8E59| db $F6 ; scroll
|1C8E5A| db $FD, $F6 ; kanji 聖
|1C8E5C| db $FD, $33 ; kanji 地
|1C8E5E| db $1C, $07, $3D, $3B, $1B, $01, $18 ; とよばれていた
|1C8E65| db $FD, $E8 ; kanji 世
|1C8E67| db $FD, $E9 ; kanji 界
|1C8E69| db $CC ; ⋯
|1C8E6A| db $F6 ; scroll
|1C8E6B| db $11, $08, $11, $C8 ; しかし,
|1C8E6F| db $FD, $6A ; kanji 今
|1C8E71| db $36, $28 ; では
|1C8E73| db $FD, $2D ; kanji 魔
|1C8E75| db $FD, $F2 ; kanji 族
|1C8E77| db $24, $28, $3E, $0C, $3A ; のはびこる
|1C8E7C| db $F6 ; scroll
|1C8E7D| db $FD, $16 ; kanji 言
|1C8E7F| db $0D, $3D, $C8 ; わば,
|1C8E82| db $FD, $57 ; kanji 闇
|1C8E84| db $24 ; の
|1C8E85| db $FD, $E8 ; kanji 世
|1C8E87| db $FD, $E9 ; kanji 界
|1C8E89| db $25, $47, $CD ; じゃ。
|1C8E8C| db $FA ; wait for key
|1C8E8D| db $F6 ; scroll
|1C8E8E| db $FD, $0D ; kanji 司
|1C8E90| db $FD, $17 ; kanji 祭
|1C8E92| db $28, $C8 ; は,
|1C8E94| db $FD, $9E ; kanji 封
|1C8E96| db $FD, $35 ; kanji 印
|1C8E98| db $0E, $1C, $09 ; をとき
|1C8E9B| db $FD, $01 ; kanji 城
|1C8E9D| db $24 ; の
|1C8E9E| db $FD, $49 ; kanji 入
|1C8EA0| db $FD, $4A ; kanji 口
|1C8EA2| db $21 ; に
|1C8EA3| db $F6 ; scroll
|1C8EA4| db $FD, $57 ; kanji 闇
|1C8EA6| db $FD, $E8 ; kanji 世
|1C8EA8| db $FD, $E9 ; kanji 界
|1C8EAA| db $1C, $0C, $19, $38 ; とこちら
|1C8EAE| db $FD, $5A ; kanji 側
|1C8EB0| db $0E ; を
|1C8EB1| db $FD, $83 ; kanji 結
|1C8EB3| db $3F ; ぶ
|1C8EB4| db $FD, $09 ; kanji 通
|1C8EB6| db $39 ; り
|1C8EB7| db $FD, $5D ; kanji 道
|1C8EB9| db $F6 ; scroll
|1C8EBA| db $0E ; を
|1C8EBB| db $FD, $4B ; kanji 開
|1C8EBD| db $01, $1B, $11, $30, $4A, $18, $07, $02 ; いてしまったよう
|1C8EC5| db $25, $47, $CD ; じゃ。
|1C8EC8| db $FA ; wait for key
|1C8EC9| db $F6 ; scroll
|1C8ECA| db $FD, $B3 ; kanji 再
|1C8ECC| db $3E, $C8, $0C, $19, $38, $24 ; び,こちらの
|1C8ED2| db $FD, $E8 ; kanji 世
|1C8ED4| db $FD, $E9 ; kanji 界
|1C8ED6| db $0E ; を
|1C8ED7| db $FD, $28 ; kanji 救
|1C8ED9| db $02, $21, $28 ; うには
|1C8EDC| db $F6 ; scroll
|1C8EDD| db $C4 ; 『
|1C8EDE| db $FD, $98 ; kanji 黄
|1C8EE0| db $FD, $43 ; kanji 金
|1C8EE2| db $24 ; の
|1C8EE3| db $FD, $99 ; kanji 力
|1C8EE5| db $C5, $0E, $1C, $39 ; 』をとり
|1C8EE9| db $FD, $0F ; kanji 戻
|1C8EEB| db $12, $11, $08 ; すしか
|1C8EEE| db $F6 ; scroll
|1C8EEF| db $FD, $5D ; kanji 道
|1C8EF1| db $28 ; は
|1C8EF2| db $FD, $C6 ; kanji 残
|1C8EF4| db $10, $3B, $1B, $04, $38, $22, $C7 ; されておらぬ!
|1C8EFB| db $FA ; wait for key
|1C8EFC| db $F6 ; scroll
|1C8EFD| db $A7 ; 7
|1C8EFE| db $FD, $38 ; kanji 人
|1C8F00| db $24 ; の
|1C8F01| db $FD, $00 ; kanji 娘
|1C8F03| db $FD, $13 ; kanji 達
|1C8F05| db $0E ; を
|1C8F06| db $FD, $CA ; kanji 助
|1C8F08| db $0B, $1B, $05, $4A, $1B, $0A, $3B ; けてやってくれ
|1C8F0F| db $F6 ; scroll
|1C8F10| db $A7 ; 7
|1C8F11| db $FD, $C4 ; kanji 賢
|1C8F13| db $FD, $1E ; kanji 者
|1C8F15| db $24 ; の
|1C8F16| db $FD, $B9 ; kanji 血
|1C8F18| db $0E, $29, $0A ; をひく
|1C8F1B| db $FD, $14 ; kanji 彼
|1C8F1D| db $FD, $15 ; kanji 女
|1C8F1F| db $38, $24 ; らの
|1C8F21| db $FD, $99 ; kanji 力
|1C8F23| db $F6 ; scroll
|1C8F24| db $FD, $30 ; kanji 必
|1C8F26| db $26, $C8, $05, $0A, $21, $18, $1A, $36 ; ず,やくにたつで
|1C8F2E| db $00, $3C, $02, $C7 ; あろう!
|1C8F32| db $FA ; wait for key
|1C8F33| db $F6 ; scroll
|1C8F34| db $FD, $00 ; kanji 娘
|1C8F36| db $FD, $13 ; kanji 達
|1C8F38| db $28, $C8, $14, $3B, $2D, $3B ; は,それぞれ
|1C8F3E| db $FD, $2D ; kanji 魔
|1C8F40| db $FD, $51 ; kanji 物
|1C8F42| db $24, $08, $0A, $3B ; のかくれ
|1C8F46| db $F6 ; scroll
|1C8F47| db $FD, $56 ; kanji 家
|1C8F49| db $21 ; に
|1C8F4A| db $FD, $9E ; kanji 封
|1C8F4C| db $25, $0C, $33, $38, $3B, $1B, $04, $3A ; じこめられておる
|1C8F54| db $CD, $30, $26 ; 。まず
|1C8F57| db $F6 ; scroll
|1C8F58| db $55, $81, $24 ; ヤミの
|1C8F5B| db $FD, $05 ; kanji 神
|1C8F5D| db $FD, $90 ; kanji 殿
|1C8F5F| db $2B ; へ
|1C8F60| db $FD, $86 ; kanji 向
|1C8F62| db $08, $02, $24, $25, $47, $C7 ; かうのじゃ!
|1C8F68| db $FE, $79, $2D ; SFX3.2D
|1C8F6B| db $FA ; wait for key
|1C8F6C| db $F6 ; scroll
|1C8F6D| db $FD, $08 ; kanji 頼
|1C8F6F| db $39, $28, $C8, $04 ; りは,お
|1C8F73| db $FD, $78 ; kanji 前
|1C8F75| db $2E, $0B, $CC ; だけ⋯
|1C8F78| db $F6 ; scroll
|1C8F79| db $0C, $24, $60, $78, $62, $88, $C9, $88 ; このサハスラーラ
|1C8F81| db $24 ; の
|1C8F82| db $FD, $0A ; kanji 願
|1C8F84| db $01, $0E, $08, $20 ; いをかな
|1C8F88| db $F6 ; scroll
|1C8F89| db $03, $1B, $0A, $3B, $C7, $FF ; えてくれ!␣
|1C8F8F| db $FD, $08 ; kanji 頼
|1C8F91| db $32, $2D ; むぞ
|1C8F93| db $FE, $6A ; write player name
|1C8F95| db $07 ; よ
|1C8F96| db $FB ; end of message

;===================================================================================================
; Sahasrahla pyramid telepathy addendum when missing pearl
;===================================================================================================
; しかし,その姿ではどうしよう
; もあるまい⋯。ヘブラ山の塔で
; ムーンパールを見つけるのじゃ
; ムーンパールは,闇世界の魔力
; から,お前を守り,勇者の姿を
; たもってくれるであろう。
;===================================================================================================
Message_0034:
|1C8F97| db $FE, $6B, $02 ; border: 2
|1C8F9A| db $FC, $06 ; text speed: 6
|1C8F9C| db $11, $08, $11, $C8, $14, $24 ; しかし,その
|1C8FA2| db $FD, $A2 ; kanji 姿
|1C8FA4| db $36, $28, $37, $02, $11, $07, $02 ; ではどうしよう
|1C8FAB| db $F8 ; row 2
|1C8FAC| db $34, $00, $3A, $30, $01, $CC, $CD, $7B ; もあるまい⋯。ヘ
|1C8FB4| db $8F, $88 ; ブラ
|1C8FB6| db $FD, $94 ; kanji 山
|1C8FB8| db $24 ; の
|1C8FB9| db $FD, $D5 ; kanji 塔
|1C8FBB| db $36 ; で
|1C8FBC| db $F9 ; row 3
|1C8FBD| db $82, $C9, $5F, $92, $C9, $8A, $0E ; ムーンパールを
|1C8FC4| db $FD, $4C ; kanji 見
|1C8FC6| db $1A, $0B, $3A, $24, $25, $47 ; つけるのじゃ
|1C8FCC| db $FA ; wait for key
|1C8FCD| db $F6 ; scroll
|1C8FCE| db $82, $C9, $5F, $92, $C9, $8A, $28, $C8 ; ムーンパールは,
|1C8FD6| db $FD, $57 ; kanji 闇
|1C8FD8| db $FD, $E8 ; kanji 世
|1C8FDA| db $FD, $E9 ; kanji 界
|1C8FDC| db $24 ; の
|1C8FDD| db $FD, $2D ; kanji 魔
|1C8FDF| db $FD, $99 ; kanji 力
|1C8FE1| db $F6 ; scroll
|1C8FE2| db $08, $38, $C8, $04 ; から,お
|1C8FE6| db $FD, $78 ; kanji 前
|1C8FE8| db $0E ; を
|1C8FE9| db $FD, $91 ; kanji 守
|1C8FEB| db $39, $C8 ; り,
|1C8FED| db $FD, $A0 ; kanji 勇
|1C8FEF| db $FD, $1E ; kanji 者
|1C8FF1| db $24 ; の
|1C8FF2| db $FD, $A2 ; kanji 姿
|1C8FF4| db $0E ; を
|1C8FF5| db $F6 ; scroll
|1C8FF6| db $18, $34, $4A, $1B, $0A, $3B, $3A, $36 ; たもってくれるで
|1C8FFE| db $00, $3C, $02, $CD ; あろう。
|1C9002| db $FB ; end of message

;===================================================================================================
; Sahasrahla when no ice rod
;===================================================================================================
; ハイリア湖の東の洞くつに,
; お前の助けとなる物がかくされ
; ておる。手に入れなされよ。
;===================================================================================================
Message_0035:
|1C9003| db $FE, $6D, $01 ; position: low
|1C9006| db $78, $51, $89, $50 ; ハイリア
|1C900A| db $FD, $12 ; kanji 湖
|1C900C| db $24 ; の
|1C900D| db $FD, $D9 ; kanji 東
|1C900F| db $24 ; の
|1C9010| db $FD, $EF ; kanji 洞
|1C9012| db $0A, $1A, $21, $C8 ; くつに,
|1C9016| db $F8 ; row 2
|1C9017| db $04 ; お
|1C9018| db $FD, $78 ; kanji 前
|1C901A| db $24 ; の
|1C901B| db $FD, $CA ; kanji 助
|1C901D| db $0B, $1C, $20, $3A ; けとなる
|1C9021| db $FD, $51 ; kanji 物
|1C9023| db $15, $08, $0A, $10, $3B ; がかくされ
|1C9028| db $F9 ; row 3
|1C9029| db $1B, $04, $3A, $CD ; ておる。
|1C902D| db $FD, $3E ; kanji 手
|1C902F| db $21 ; に
|1C9030| db $FD, $49 ; kanji 入
|1C9032| db $3B, $20, $10, $3B, $07, $CD ; れなされよ。
|1C9038| db $FB ; end of message

;===================================================================================================
; Sahasrahla when no boots and previously spoken to
;===================================================================================================
; おお,なんと『勇気の紋章』を
; 手に入れたか⋯。では,ワシの
; 知っている話をしよう。
; その昔,ハイリアの王家を守る
; 者たちのー族がおった。
; 彼らは勇気の紋章を司どる,
; ナイトのー族と呼ばれておった
; のじゃが,7賢者の封印が行な
; われた時,魔族とのたたかいで
; ほとんどの者がほろんでしまっ
; たのじゃ。そのナイトのー族か
; ら勇者が現れるはずなのじゃが
; ⋯ よし,[LINK]よ,お前
; を信じよう。残りの紋章を
; 手に入れるが良い。
; それから,これを持って行け。
; ワシら賢者のー族に伝わる宝,
; お前にやろう。
;===================================================================================================
Message_0036:
|1C9039| db $FE, $6D, $01 ; position: low
|1C903C| db $04, $04, $C8, $20, $0F, $1C, $C4 ; おお,なんと『
|1C9043| db $FD, $A0 ; kanji 勇
|1C9045| db $FD, $37 ; kanji 気
|1C9047| db $24 ; の
|1C9048| db $FD, $53 ; kanji 紋
|1C904A| db $FD, $54 ; kanji 章
|1C904C| db $C5, $0E ; 』を
|1C904E| db $F8 ; row 2
|1C904F| db $FD, $3E ; kanji 手
|1C9051| db $21 ; に
|1C9052| db $FD, $49 ; kanji 入
|1C9054| db $3B, $18, $08, $CC, $CD, $36, $28, $C8 ; れたか⋯。では,
|1C905C| db $5D, $61, $24 ; ワシの
|1C905F| db $F9 ; row 3
|1C9060| db $FD, $93 ; kanji 知
|1C9062| db $4A, $1B, $01, $3A ; っている
|1C9066| db $FD, $A3 ; kanji 話
|1C9068| db $0E, $11, $07, $02, $CD ; をしよう。
|1C906D| db $FA ; wait for key
|1C906E| db $F6 ; scroll
|1C906F| db $14, $24 ; その
|1C9071| db $FD, $7E ; kanji 昔
|1C9073| db $C8, $78, $51, $89, $50, $24 ; ,ハイリアの
|1C9079| db $FD, $44 ; kanji 王
|1C907B| db $FD, $56 ; kanji 家
|1C907D| db $0E ; を
|1C907E| db $FD, $91 ; kanji 守
|1C9080| db $3A ; る
|1C9081| db $F6 ; scroll
|1C9082| db $FD, $1E ; kanji 者
|1C9084| db $18, $19, $24, $C9 ; たちのー
|1C9088| db $FD, $F2 ; kanji 族
|1C908A| db $15, $04, $4A, $18, $CD ; がおった。
|1C908F| db $F6 ; scroll
|1C9090| db $FD, $14 ; kanji 彼
|1C9092| db $38, $28 ; らは
|1C9094| db $FD, $A0 ; kanji 勇
|1C9096| db $FD, $37 ; kanji 気
|1C9098| db $24 ; の
|1C9099| db $FD, $53 ; kanji 紋
|1C909B| db $FD, $54 ; kanji 章
|1C909D| db $0E ; を
|1C909E| db $FD, $0D ; kanji 司
|1C90A0| db $37, $3A, $C8 ; どる,
|1C90A3| db $FA ; wait for key
|1C90A4| db $F6 ; scroll
|1C90A5| db $70, $51, $6C, $24, $C9 ; ナイトのー
|1C90AA| db $FD, $F2 ; kanji 族
|1C90AC| db $1C ; と
|1C90AD| db $FD, $50 ; kanji 呼
|1C90AF| db $3D, $3B, $1B, $04, $4A, $18 ; ばれておった
|1C90B5| db $F6 ; scroll
|1C90B6| db $24, $25, $47, $15, $C8, $A7 ; のじゃが,7
|1C90BC| db $FD, $C4 ; kanji 賢
|1C90BE| db $FD, $1E ; kanji 者
|1C90C0| db $24 ; の
|1C90C1| db $FD, $9E ; kanji 封
|1C90C3| db $FD, $35 ; kanji 印
|1C90C5| db $15 ; が
|1C90C6| db $FD, $02 ; kanji 行
|1C90C8| db $20 ; な
|1C90C9| db $F6 ; scroll
|1C90CA| db $0D, $3B, $18 ; われた
|1C90CD| db $FD, $88 ; kanji 時
|1C90CF| db $C8 ; ,
|1C90D0| db $FD, $2D ; kanji 魔
|1C90D2| db $FD, $F2 ; kanji 族
|1C90D4| db $1C, $24, $18, $18, $08, $01, $36 ; とのたたかいで
|1C90DB| db $FA ; wait for key
|1C90DC| db $F6 ; scroll
|1C90DD| db $2C, $1C, $0F, $37, $24 ; ほとんどの
|1C90E2| db $FD, $1E ; kanji 者
|1C90E4| db $15, $2C, $3C, $0F, $36, $11, $30, $4A ; がほろんでしまっ
|1C90EC| db $F6 ; scroll
|1C90ED| db $18, $24, $25, $47, $CD, $14, $24, $70 ; たのじゃ。そのナ
|1C90F5| db $51, $6C, $24, $C9 ; イトのー
|1C90F9| db $FD, $F2 ; kanji 族
|1C90FB| db $08 ; か
|1C90FC| db $F6 ; scroll
|1C90FD| db $38 ; ら
|1C90FE| db $FD, $A0 ; kanji 勇
|1C9100| db $FD, $1E ; kanji 者
|1C9102| db $15 ; が
|1C9103| db $FD, $BC ; kanji 現
|1C9105| db $3B, $3A, $28, $26, $20, $24, $25, $47 ; れるはずなのじゃ
|1C910D| db $15 ; が
|1C910E| db $FA ; wait for key
|1C910F| db $F6 ; scroll
|1C9110| db $FF, $CC, $FF, $07, $11, $C8 ; ␣⋯␣よし,
|1C9116| db $FE, $6A ; write player name
|1C9118| db $07, $C8, $04 ; よ,お
|1C911B| db $FD, $78 ; kanji 前
|1C911D| db $F6 ; scroll
|1C911E| db $0E ; を
|1C911F| db $FD, $45 ; kanji 信
|1C9121| db $25, $07, $02, $CD ; じよう。
|1C9125| db $FD, $C6 ; kanji 残
|1C9127| db $39, $24 ; りの
|1C9129| db $FD, $53 ; kanji 紋
|1C912B| db $FD, $54 ; kanji 章
|1C912D| db $0E ; を
|1C912E| db $F6 ; scroll
|1C912F| db $FD, $3E ; kanji 手
|1C9131| db $21 ; に
|1C9132| db $FD, $49 ; kanji 入
|1C9134| db $3B, $3A, $15 ; れるが
|1C9137| db $FD, $32 ; kanji 良
|1C9139| db $01, $CD ; い。
|1C913B| db $FA ; wait for key
|1C913C| db $F6 ; scroll
|1C913D| db $14, $3B, $08, $38, $C8, $0C, $3B, $0E ; それから,これを
|1C9145| db $FD, $DB ; kanji 持
|1C9147| db $4A, $1B ; って
|1C9149| db $FD, $02 ; kanji 行
|1C914B| db $0B, $CD ; け。
|1C914D| db $F6 ; scroll
|1C914E| db $5D, $61, $38 ; ワシら
|1C9151| db $FD, $C4 ; kanji 賢
|1C9153| db $FD, $1E ; kanji 者
|1C9155| db $24, $C9 ; のー
|1C9157| db $FD, $F2 ; kanji 族
|1C9159| db $21 ; に
|1C915A| db $FD, $2E ; kanji 伝
|1C915C| db $0D, $3A ; わる
|1C915E| db $FD, $9A ; kanji 宝
|1C9160| db $C8 ; ,
|1C9161| db $F6 ; scroll
|1C9162| db $04 ; お
|1C9163| db $FD, $78 ; kanji 前
|1C9165| db $21, $05, $3C, $02, $CD ; にやろう。
|1C916A| db $FB ; end of message

;===================================================================================================
; Sahasrahla when no boots and never spoken to
;===================================================================================================
; いかにもワシが長老であり
; 7賢者のしそんの1人
; サハスラーラじゃ。
; ⋯ ⋯ ⋯ なんと
; [LINK]よ,おさないお前が
; 退魔の剣を 求めておるのか!
; じゃが あの剣は誰でも使える
; わけではのうてな。
; 3匹の魔物を倒し3つの紋章を
; 手にした『勇者』だけが使い手
; になれるとハイリアの民は
; 伝えとる ⋯ ⋯ ⋯
; お前は,すでに『勇気の紋章』
; を手に入れておる様じゃのう。
; では,もうすこし話をしよう⋯
; その昔,ハイリアの王家を守る
; 者たちのー族がおった。
; 彼らは勇気の紋章を司どる,
; ナイトのー族と呼ばれておった
; のじゃが,7賢者の封印が行な
; われた時,魔族とのたたかいで
; ほとんどの者がほろんでしまっ
; たのじゃ。そのナイトのー族か
; ら勇者が現れるはずなのじゃが
; ⋯ よし,[LINK]よ,お前
; を信じよう。残りの紋章を
; 手に入れるが良い。
; それから,これを持って行け。
; ワシら賢者のー族に伝わる宝,
; お前にやろう。
;===================================================================================================
Message_0037:
|1C916B| db $FE, $6D, $01 ; position: low
|1C916E| db $01, $08, $21, $34, $5D, $61, $15 ; いかにもワシが
|1C9175| db $FD, $8D ; kanji 長
|1C9177| db $FD, $E5 ; kanji 老
|1C9179| db $36, $00, $39 ; であり
|1C917C| db $F8 ; row 2
|1C917D| db $A7 ; 7
|1C917E| db $FD, $C4 ; kanji 賢
|1C9180| db $FD, $1E ; kanji 者
|1C9182| db $24, $11, $14, $0F, $24, $A1 ; のしそんの1
|1C9188| db $FD, $38 ; kanji 人
|1C918A| db $F9 ; row 3
|1C918B| db $60, $78, $62, $88, $C9, $88, $25, $47 ; サハスラーラじゃ
|1C9193| db $CD ; 。
|1C9194| db $FA ; wait for key
|1C9195| db $F6 ; scroll
|1C9196| db $FF, $CC, $FF, $CC, $FF, $CC, $FF, $FF ; ␣⋯␣⋯␣⋯␣␣
|1C919E| db $20, $0F, $1C ; なんと
|1C91A1| db $F6 ; scroll
|1C91A2| db $FE, $6A ; write player name
|1C91A4| db $07, $C8, $04, $10, $20, $01, $04 ; よ,おさないお
|1C91AB| db $FD, $78 ; kanji 前
|1C91AD| db $15 ; が
|1C91AE| db $F6 ; scroll
|1C91AF| db $FD, $2C ; kanji 退
|1C91B1| db $FD, $2D ; kanji 魔
|1C91B3| db $24 ; の
|1C91B4| db $FD, $1A ; kanji 剣
|1C91B6| db $0E, $FF ; を␣
|1C91B8| db $FD, $9B ; kanji 求
|1C91BA| db $33, $1B, $04, $3A, $24, $08, $C7 ; めておるのか!
|1C91C1| db $FA ; wait for key
|1C91C2| db $F6 ; scroll
|1C91C3| db $25, $47, $15, $FF, $00, $24 ; じゃが␣あの
|1C91C9| db $FD, $1A ; kanji 剣
|1C91CB| db $28 ; は
|1C91CC| db $FD, $95 ; kanji 誰
|1C91CE| db $36, $34 ; でも
|1C91D0| db $FD, $89 ; kanji 使
|1C91D2| db $03, $3A ; える
|1C91D4| db $F6 ; scroll
|1C91D5| db $0D, $0B, $36, $28, $24, $02, $1B, $20 ; わけではのうてな
|1C91DD| db $CD ; 。
|1C91DE| db $F6 ; scroll
|1C91DF| db $A3 ; 3
|1C91E0| db $FD, $8F ; kanji 匹
|1C91E2| db $24 ; の
|1C91E3| db $FD, $2D ; kanji 魔
|1C91E5| db $FD, $51 ; kanji 物
|1C91E7| db $0E ; を
|1C91E8| db $FD, $29 ; kanji 倒
|1C91EA| db $11, $A3, $1A, $24 ; し3つの
|1C91EE| db $FD, $53 ; kanji 紋
|1C91F0| db $FD, $54 ; kanji 章
|1C91F2| db $0E ; を
|1C91F3| db $FA ; wait for key
|1C91F4| db $F6 ; scroll
|1C91F5| db $FD, $3E ; kanji 手
|1C91F7| db $21, $11, $18, $C4 ; にした『
|1C91FB| db $FD, $A0 ; kanji 勇
|1C91FD| db $FD, $1E ; kanji 者
|1C91FF| db $C5, $2E, $0B, $15 ; 』だけが
|1C9203| db $FD, $89 ; kanji 使
|1C9205| db $01 ; い
|1C9206| db $FD, $3E ; kanji 手
|1C9208| db $F6 ; scroll
|1C9209| db $21, $20, $3B, $3A, $1C, $78, $51, $89 ; になれるとハイリ
|1C9211| db $50, $24 ; アの
|1C9213| db $FD, $F8 ; kanji 民
|1C9215| db $28 ; は
|1C9216| db $F6 ; scroll
|1C9217| db $FD, $2E ; kanji 伝
|1C9219| db $03, $1C, $3A, $FF, $CC, $FF, $CC, $FF ; えとる␣⋯␣⋯␣
|1C9221| db $CC ; ⋯
|1C9222| db $FA ; wait for key
|1C9223| db $F6 ; scroll
|1C9224| db $04 ; お
|1C9225| db $FD, $78 ; kanji 前
|1C9227| db $28, $C8, $12, $36, $21, $C4 ; は,すでに『
|1C922D| db $FD, $A0 ; kanji 勇
|1C922F| db $FD, $37 ; kanji 気
|1C9231| db $24 ; の
|1C9232| db $FD, $53 ; kanji 紋
|1C9234| db $FD, $54 ; kanji 章
|1C9236| db $C5 ; 』
|1C9237| db $F6 ; scroll
|1C9238| db $0E ; を
|1C9239| db $FD, $3E ; kanji 手
|1C923B| db $21 ; に
|1C923C| db $FD, $49 ; kanji 入
|1C923E| db $3B, $1B, $04, $3A ; れておる
|1C9242| db $FD, $10 ; kanji 様
|1C9244| db $25, $47, $24, $02, $CD ; じゃのう。
|1C9249| db $F6 ; scroll
|1C924A| db $36, $28, $C8, $34, $02, $12, $0C, $11 ; では,もうすこし
|1C9252| db $FD, $A3 ; kanji 話
|1C9254| db $0E, $11, $07, $02, $CC ; をしよう⋯
|1C9259| db $FA ; wait for key
|1C925A| db $F6 ; scroll
|1C925B| db $14, $24 ; その
|1C925D| db $FD, $7E ; kanji 昔
|1C925F| db $C8, $78, $51, $89, $50, $24 ; ,ハイリアの
|1C9265| db $FD, $44 ; kanji 王
|1C9267| db $FD, $56 ; kanji 家
|1C9269| db $0E ; を
|1C926A| db $FD, $91 ; kanji 守
|1C926C| db $3A ; る
|1C926D| db $F6 ; scroll
|1C926E| db $FD, $1E ; kanji 者
|1C9270| db $18, $19, $24, $C9 ; たちのー
|1C9274| db $FD, $F2 ; kanji 族
|1C9276| db $15, $04, $4A, $18, $CD ; がおった。
|1C927B| db $F6 ; scroll
|1C927C| db $FD, $14 ; kanji 彼
|1C927E| db $38, $28 ; らは
|1C9280| db $FD, $A0 ; kanji 勇
|1C9282| db $FD, $37 ; kanji 気
|1C9284| db $24 ; の
|1C9285| db $FD, $53 ; kanji 紋
|1C9287| db $FD, $54 ; kanji 章
|1C9289| db $0E ; を
|1C928A| db $FD, $0D ; kanji 司
|1C928C| db $37, $3A, $C8 ; どる,
|1C928F| db $FA ; wait for key
|1C9290| db $F6 ; scroll
|1C9291| db $70, $51, $6C, $24, $C9 ; ナイトのー
|1C9296| db $FD, $F2 ; kanji 族
|1C9298| db $1C ; と
|1C9299| db $FD, $50 ; kanji 呼
|1C929B| db $3D, $3B, $1B, $04, $4A, $18 ; ばれておった
|1C92A1| db $F6 ; scroll
|1C92A2| db $24, $25, $47, $15, $C8, $A7 ; のじゃが,7
|1C92A8| db $FD, $C4 ; kanji 賢
|1C92AA| db $FD, $1E ; kanji 者
|1C92AC| db $24 ; の
|1C92AD| db $FD, $9E ; kanji 封
|1C92AF| db $FD, $35 ; kanji 印
|1C92B1| db $15 ; が
|1C92B2| db $FD, $02 ; kanji 行
|1C92B4| db $20 ; な
|1C92B5| db $F6 ; scroll
|1C92B6| db $0D, $3B, $18 ; われた
|1C92B9| db $FD, $88 ; kanji 時
|1C92BB| db $C8 ; ,
|1C92BC| db $FD, $2D ; kanji 魔
|1C92BE| db $FD, $F2 ; kanji 族
|1C92C0| db $1C, $24, $18, $18, $08, $01, $36 ; とのたたかいで
|1C92C7| db $FA ; wait for key
|1C92C8| db $F6 ; scroll
|1C92C9| db $2C, $1C, $0F, $37, $24 ; ほとんどの
|1C92CE| db $FD, $1E ; kanji 者
|1C92D0| db $15, $2C, $3C, $0F, $36, $11, $30, $4A ; がほろんでしまっ
|1C92D8| db $F6 ; scroll
|1C92D9| db $18, $24, $25, $47, $CD, $14, $24, $70 ; たのじゃ。そのナ
|1C92E1| db $51, $6C, $24, $C9 ; イトのー
|1C92E5| db $FD, $F2 ; kanji 族
|1C92E7| db $08 ; か
|1C92E8| db $F6 ; scroll
|1C92E9| db $38 ; ら
|1C92EA| db $FD, $A0 ; kanji 勇
|1C92EC| db $FD, $1E ; kanji 者
|1C92EE| db $15 ; が
|1C92EF| db $FD, $BC ; kanji 現
|1C92F1| db $3B, $3A, $28, $26, $20, $24, $25, $47 ; れるはずなのじゃ
|1C92F9| db $15 ; が
|1C92FA| db $FA ; wait for key
|1C92FB| db $F6 ; scroll
|1C92FC| db $FF, $CC, $FF, $07, $11, $C8 ; ␣⋯␣よし,
|1C9302| db $FE, $6A ; write player name
|1C9304| db $07, $C8, $04 ; よ,お
|1C9307| db $FD, $78 ; kanji 前
|1C9309| db $F6 ; scroll
|1C930A| db $0E ; を
|1C930B| db $FD, $45 ; kanji 信
|1C930D| db $25, $07, $02, $CD ; じよう。
|1C9311| db $FD, $C6 ; kanji 残
|1C9313| db $39, $24 ; りの
|1C9315| db $FD, $53 ; kanji 紋
|1C9317| db $FD, $54 ; kanji 章
|1C9319| db $0E ; を
|1C931A| db $FE, $79, $2D ; SFX3.2D
|1C931D| db $F6 ; scroll
|1C931E| db $FD, $3E ; kanji 手
|1C9320| db $21 ; に
|1C9321| db $FD, $49 ; kanji 入
|1C9323| db $3B, $3A, $15 ; れるが
|1C9326| db $FD, $32 ; kanji 良
|1C9328| db $01, $CD ; い。
|1C932A| db $FA ; wait for key
|1C932B| db $F6 ; scroll
|1C932C| db $14, $3B, $08, $38, $C8, $0C, $3B, $0E ; それから,これを
|1C9334| db $FD, $DB ; kanji 持
|1C9336| db $4A, $1B ; って
|1C9338| db $FD, $02 ; kanji 行
|1C933A| db $0B, $CD ; け。
|1C933C| db $F6 ; scroll
|1C933D| db $5D, $61, $38 ; ワシら
|1C9340| db $FD, $C4 ; kanji 賢
|1C9342| db $FD, $1E ; kanji 者
|1C9344| db $24, $C9 ; のー
|1C9346| db $FD, $F2 ; kanji 族
|1C9348| db $21 ; に
|1C9349| db $FD, $2E ; kanji 伝
|1C934B| db $0D, $3A ; わる
|1C934D| db $FD, $9A ; kanji 宝
|1C934F| db $C8 ; ,
|1C9350| db $F6 ; scroll
|1C9351| db $04 ; お
|1C9352| db $FD, $78 ; kanji 前
|1C9354| db $21, $05, $3C, $02, $CD ; にやろう。
|1C9359| db $FB ; end of message

;===================================================================================================
; Signpost: 100 rupee wise man bounty
;===================================================================================================
; 7賢者の血をひく娘をみつけた
; 者には,ほうびとして
; 100ルピーとらせる 国王
;===================================================================================================
Message_0038:
|1C935A| db $A7 ; 7
|1C935B| db $FD, $C4 ; kanji 賢
|1C935D| db $FD, $1E ; kanji 者
|1C935F| db $24 ; の
|1C9360| db $FD, $B9 ; kanji 血
|1C9362| db $0E, $29, $0A ; をひく
|1C9365| db $FD, $00 ; kanji 娘
|1C9367| db $0E, $31, $1A, $0B, $18 ; をみつけた
|1C936C| db $F8 ; row 2
|1C936D| db $FD, $1E ; kanji 者
|1C936F| db $21, $28, $C8, $2C, $02, $3E, $1C, $11 ; には,ほうびとし
|1C9377| db $1B ; て
|1C9378| db $F9 ; row 3
|1C9379| db $A1, $A0, $A0, $8A, $93, $C9, $1C, $38 ; 100ルピーとら
|1C9381| db $13, $3A, $FF ; せる␣
|1C9384| db $FD, $2B ; kanji 国
|1C9386| db $FD, $44 ; kanji 王
|1C9388| db $FB ; end of message

;===================================================================================================
; Signpost: Link wanted posting
;===================================================================================================
; おたずね者 😬 [LINK]
; ゼルダ姫を城よりさらった犯人
; みつけたら大声でしらせよ!
;===================================================================================================
Message_0039:
|1C9389| db $04, $18, $26, $23 ; おたずね
|1C938D| db $FD, $1E ; kanji 者
|1C938F| db $FF, $D2, $D3, $FF ; ␣😬␣
|1C9393| db $FE, $6A ; write player name
|1C9395| db $F8 ; row 2
|1C9396| db $77, $8A, $7E ; ゼルダ
|1C9399| db $FD, $FF ; kanji 姫
|1C939B| db $0E ; を
|1C939C| db $FD, $01 ; kanji 城
|1C939E| db $07, $39, $10, $38, $4A, $18 ; よりさらった
|1C93A4| db $FD, $62 ; kanji 犯
|1C93A6| db $FD, $38 ; kanji 人
|1C93A8| db $F9 ; row 3
|1C93A9| db $31, $1A, $0B, $18, $38 ; みつけたら
|1C93AE| db $FD, $5F ; kanji 大
|1C93B0| db $FD, $60 ; kanji 声
|1C93B2| db $36, $11, $38, $13, $07, $C7 ; でしらせよ!
|1C93B8| db $FB ; end of message

;===================================================================================================
; Signpost: Death Mountain access restricted
;===================================================================================================
; きけん!
; 勝手にヘブラ山に入る事を
; きんしします。
;===================================================================================================
Message_003A:
|1C93B9| db $09, $0B, $0F, $C7 ; きけん!
|1C93BD| db $F8 ; row 2
|1C93BE| db $FD, $DF ; kanji 勝
|1C93C0| db $FD, $3E ; kanji 手
|1C93C2| db $21, $7B, $8F, $88 ; にヘブラ
|1C93C6| db $FD, $94 ; kanji 山
|1C93C8| db $21 ; に
|1C93C9| db $FD, $49 ; kanji 入
|1C93CB| db $3A ; る
|1C93CC| db $FD, $22 ; kanji 事
|1C93CE| db $0E ; を
|1C93CF| db $F9 ; row 3
|1C93D0| db $09, $0F, $11, $11, $30, $12, $CD ; きんしします。
|1C93D7| db $FB ; end of message

;===================================================================================================
; Signpost: Lost Woods directions
;===================================================================================================
; この先 🡅 まよいの森
;===================================================================================================
Message_003B:
|1C93D8| db $F8 ; row 2
|1C93D9| db $0C, $24 ; この
|1C93DB| db $FD, $9C ; kanji 先
|1C93DD| db $FF, $E0, $FF, $30, $07, $01, $24 ; ␣🡅␣まよいの
|1C93E4| db $FD, $65 ; kanji 森
|1C93E6| db $FB ; end of message

;===================================================================================================
; Signpost: Deep water / Zora warning
;===================================================================================================
; あぶない!
; 深みとゾーラに注意
;===================================================================================================
Message_003C:
|1C93E7| db $00, $3F, $20, $01, $C7 ; あぶない!
|1C93EC| db $F8 ; row 2
|1C93ED| db $FD, $64 ; kanji 深
|1C93EF| db $31, $1C, $7D, $C9, $88, $21 ; みとゾーラに
|1C93F5| db $FD, $CE ; kanji 注
|1C93F7| db $FD, $CF ; kanji 意
|1C93F9| db $FB ; end of message

;===================================================================================================
; Signpost: Magic Shop
;===================================================================================================
; ようこそ 魔法屋へ
; 願いのタキまであとすこし
;===================================================================================================
Message_003D:
|1C93FA| db $07, $02, $0C, $14, $FF ; ようこそ␣
|1C93FF| db $FD, $2D ; kanji 魔
|1C9401| db $FD, $3C ; kanji 法
|1C9403| db $FD, $3D ; kanji 屋
|1C9405| db $2B ; へ
|1C9406| db $F9 ; row 3
|1C9407| db $FD, $0A ; kanji 願
|1C9409| db $01, $24, $68, $59, $30, $36, $00, $1C ; いのタキまであと
|1C9411| db $12, $0C, $11 ; すこし
|1C9414| db $FB ; end of message

;===================================================================================================
; Signpost: Through this cave to Kakariko
;===================================================================================================
; この洞くつの先
; 村への道へ通じる。
;===================================================================================================
Message_003E:
|1C9415| db $FF, $0C, $24 ; ␣この
|1C9418| db $FD, $EF ; kanji 洞
|1C941A| db $0A, $1A, $24 ; くつの
|1C941D| db $FD, $9C ; kanji 先
|1C941F| db $F8 ; row 2
|1C9420| db $FF ; ␣
|1C9421| db $FD, $8C ; kanji 村
|1C9423| db $2B, $24 ; への
|1C9425| db $FD, $5D ; kanji 道
|1C9427| db $2B ; へ
|1C9428| db $FD, $09 ; kanji 通
|1C942A| db $25, $3A, $CD ; じる。
|1C942D| db $FB ; end of message

;===================================================================================================
; Signpost: Lake Hylia shop directions
;===================================================================================================
; この先 🡇 ハイリア湖
; お店もあります
;===================================================================================================
Message_003F:
|1C942E| db $0C, $24 ; この
|1C9430| db $FD, $9C ; kanji 先
|1C9432| db $FF, $E1, $FF, $78, $51, $89, $50 ; ␣🡇␣ハイリア
|1C9439| db $FD, $12 ; kanji 湖
|1C943B| db $F8 ; row 2
|1C943C| db $FF, $FF, $FF, $FF, $FF, $FF, $04 ; ␣␣␣␣␣␣お
|1C9443| db $FD, $6C ; kanji 店
|1C9445| db $34, $00, $39, $30, $12 ; もあります
|1C944A| db $FB ; end of message

;===================================================================================================
; Signpost: Kakariko Village directions (west)
;===================================================================================================
; この先 🡄
; カカリコ村
;===================================================================================================
Message_0040:
|1C944B| db $0C, $24 ; この
|1C944D| db $FD, $9C ; kanji 先
|1C944F| db $FF, $E3 ; ␣🡄
|1C9451| db $F8 ; row 2
|1C9452| db $FF, $FF, $FF, $58, $58, $89, $5C ; ␣␣␣カカリコ
|1C9459| db $FD, $8C ; kanji 村
|1C945B| db $FB ; end of message

;===================================================================================================
; Signpost: Desert directions
;===================================================================================================
; この先 🡄 あやしのサバク
; ジライに注意
;===================================================================================================
Message_0041:
|1C945C| db $0C, $24 ; この
|1C945E| db $FD, $9C ; kanji 先
|1C9460| db $FF, $E3, $FF, $00, $05, $11, $24, $60 ; ␣🡄␣あやしのサ
|1C9468| db $8D, $5A ; バク
|1C946A| db $F9 ; row 3
|1C946B| db $FF, $FF, $FF, $FF, $FF, $FF, $75, $88 ; ␣␣␣␣␣␣ジラ
|1C9473| db $51, $21 ; イに
|1C9475| db $FD, $CE ; kanji 注
|1C9477| db $FD, $CF ; kanji 意
|1C9479| db $FB ; end of message

;===================================================================================================
; Signpost: Magic Shop / Waterfall of Wishing directions
;===================================================================================================
; この先 🡅🡆 魔法屋
; その奥 願いのタキ
;===================================================================================================
Message_0042:
|1C947A| db $0C, $24 ; この
|1C947C| db $FD, $9C ; kanji 先
|1C947E| db $FF, $E0, $E2, $FF ; ␣🡅🡆␣
|1C9482| db $FD, $2D ; kanji 魔
|1C9484| db $FD, $3C ; kanji 法
|1C9486| db $FD, $3D ; kanji 屋
|1C9488| db $F9 ; row 3
|1C9489| db $14, $24 ; その
|1C948B| db $FD, $80 ; kanji 奥
|1C948D| db $FF ; ␣
|1C948E| db $FD, $0A ; kanji 願
|1C9490| db $01, $24, $68, $59 ; いのタキ
|1C9494| db $FB ; end of message

;===================================================================================================
; Signpost: Eastern Palace directions and Hyrule Castle directions
;===================================================================================================
; この先 🡆 東の神殿
; この先 🡄 ハイラルのお城
;===================================================================================================
Message_0043:
|1C9495| db $0C, $24 ; この
|1C9497| db $FD, $9C ; kanji 先
|1C9499| db $FF, $E2, $FF ; ␣🡆␣
|1C949C| db $FD, $D9 ; kanji 東
|1C949E| db $24 ; の
|1C949F| db $FD, $05 ; kanji 神
|1C94A1| db $FD, $90 ; kanji 殿
|1C94A3| db $F9 ; row 3
|1C94A4| db $0C, $24 ; この
|1C94A6| db $FD, $9C ; kanji 先
|1C94A8| db $FF, $E3, $FF, $78, $51, $88, $8A, $24 ; ␣🡄␣ハイラルの
|1C94B0| db $04 ; お
|1C94B1| db $FD, $01 ; kanji 城
|1C94B3| db $FB ; end of message

;===================================================================================================
; Signpost: Lake Hylia marker
;===================================================================================================
; ハイリア湖
;===================================================================================================
Message_0044:
|1C94B4| db $F8 ; row 2
|1C94B5| db $FF, $FF, $FF, $78, $51, $89, $50 ; ␣␣␣ハイリア
|1C94BC| db $FD, $12 ; kanji 湖
|1C94BE| db $FB ; end of message

;===================================================================================================
; Signpost: Locksmith's sign
;===================================================================================================
; 私に,話しかけないで。
; 私は,へんなおじさんです。
; 立札をぬいたりしないで下さい
;===================================================================================================
Message_0045:
|1C94BF| db $FD, $26 ; kanji 私
|1C94C1| db $21, $C8 ; に,
|1C94C3| db $FD, $A3 ; kanji 話
|1C94C5| db $11, $08, $0B, $20, $01, $36, $CD ; しかけないで。
|1C94CC| db $F8 ; row 2
|1C94CD| db $FD, $26 ; kanji 私
|1C94CF| db $28, $C8, $2B, $0F, $20, $04, $25, $10 ; は,へんなおじさ
|1C94D7| db $0F, $36, $12, $CD ; んです。
|1C94DB| db $F9 ; row 3
|1C94DC| db $FD, $71 ; kanji 立
|1C94DE| db $FD, $5B ; kanji 札
|1C94E0| db $0E, $22, $01, $18, $39, $11, $20, $01 ; をぬいたりしない
|1C94E8| db $36 ; で
|1C94E9| db $FD, $61 ; kanji 下
|1C94EB| db $10, $01 ; さい
|1C94ED| db $FB ; end of message

;===================================================================================================
; Signpost: Bumpkin brothers' house
;===================================================================================================
; キコリ Aさく Bさくの家
;===================================================================================================
Message_0046:
|1C94EE| db $F8 ; row 2
|1C94EF| db $59, $5C, $89, $FF, $AA, $10, $0A, $FF ; キコリ␣Aさく␣
|1C94F7| db $AB, $10, $0A, $24 ; Bさくの
|1C94FB| db $FD, $56 ; kanji 家
|1C94FD| db $FB ; end of message

;===================================================================================================
; Signpost: Kakariko Village directions (south)
;===================================================================================================
; この先 🡇
; カカリコ村
;===================================================================================================
Message_0047:
|1C94FE| db $0C, $24 ; この
|1C9500| db $FD, $9C ; kanji 先
|1C9502| db $FF, $E1 ; ␣🡇
|1C9504| db $F8 ; row 2
|1C9505| db $FF, $FF, $FF, $58, $58, $89, $5C ; ␣␣␣カカリコ
|1C950C| db $FD, $8C ; kanji 村
|1C950E| db $FB ; end of message

;===================================================================================================
; Witch when powder is had
;===================================================================================================
; トロ〜リ トロリ
; キノコでつくる魔法のクスリ
; トロ〜リ トロリ
;===================================================================================================
Message_0048:
|1C950F| db $FF, $6C, $8C, $CE, $89, $FF, $6C, $8C ; ␣トロ〜リ␣トロ
|1C9517| db $89 ; リ
|1C9518| db $F8 ; row 2
|1C9519| db $59, $74, $5C, $36, $1A, $0A, $3A ; キノコでつくる
|1C9520| db $FD, $2D ; kanji 魔
|1C9522| db $FD, $3C ; kanji 法
|1C9524| db $24, $5A, $62, $89 ; のクスリ
|1C9528| db $F9 ; row 3
|1C9529| db $FF, $6C, $8C, $CE, $89, $FF, $6C, $8C ; ␣トロ〜リ␣トロ
|1C9531| db $89 ; リ
|1C9532| db $FB ; end of message

;===================================================================================================
; Witch when turning in mushroom and before collecting powder
;===================================================================================================
; ヒッヒッ,ありがとうよ。
; あとで上のお店へおいで。
; いいものをあげるよ⋯ヒッヒ。
;===================================================================================================
Message_0049:
|1C9533| db $79, $9A, $79, $9A, $C8, $00, $39, $15 ; ヒッヒッ,ありが
|1C953B| db $1C, $02, $07, $CD ; とうよ。
|1C953F| db $F8 ; row 2
|1C9540| db $00, $1C, $36 ; あとで
|1C9543| db $FD, $72 ; kanji 上
|1C9545| db $24, $04 ; のお
|1C9547| db $FD, $6C ; kanji 店
|1C9549| db $2B, $04, $01, $36, $CD ; へおいで。
|1C954E| db $F9 ; row 3
|1C954F| db $01, $01, $34, $24, $0E, $00, $1D, $3A ; いいものをあげる
|1C9557| db $07, $CC, $79, $9A, $79, $CD ; よ⋯ヒッヒ。
|1C955D| db $FB ; end of message

;===================================================================================================
; Witch when mushroom is had
;===================================================================================================
; おお,あまい果物がくさった
; かおり⋯そのキノコをくれたら
; あれがつくれるぞえ ひっひっ
;===================================================================================================
Message_004A:
|1C955E| db $04, $04, $C8, $00, $30, $01 ; おお,あまい
|1C9564| db $FD, $7F ; kanji 果
|1C9566| db $FD, $51 ; kanji 物
|1C9568| db $15, $0A, $10, $4A, $18 ; がくさった
|1C956D| db $F8 ; row 2
|1C956E| db $08, $04, $39, $CC, $14, $24, $59, $74 ; かおり⋯そのキノ
|1C9576| db $5C, $0E, $0A, $3B, $18, $38 ; コをくれたら
|1C957C| db $F9 ; row 3
|1C957D| db $00, $3B, $15, $1A, $0A, $3B, $3A, $2D ; あれがつくれるぞ
|1C9585| db $03, $FF, $29, $4A, $29, $4A ; え␣ひっひっ
|1C958B| db $FB ; end of message

;===================================================================================================
; Magic Shop assistant when no empty bottles
;===================================================================================================
; クスリがほしいのなら まず
; 魔法のビンを 探してくる事
; じゃ⋯ イッヒッヒッ
;===================================================================================================
Message_004B:
|1C958C| db $5A, $62, $89, $15, $2C, $11, $01, $24 ; クスリがほしいの
|1C9594| db $20, $38, $FF, $30, $26 ; なら␣まず
|1C9599| db $F8 ; row 2
|1C959A| db $FD, $2D ; kanji 魔
|1C959C| db $FD, $3C ; kanji 法
|1C959E| db $24, $8E, $5F, $0E, $FF ; のビンを␣
|1C95A3| db $FD, $69 ; kanji 探
|1C95A5| db $11, $1B, $0A, $3A ; してくる
|1C95A9| db $FD, $22 ; kanji 事
|1C95AB| db $F9 ; row 3
|1C95AC| db $25, $47, $CC, $FF, $51, $9A, $79, $9A ; じゃ⋯␣イッヒッ
|1C95B4| db $79, $9A ; ヒッ
|1C95B6| db $FB ; end of message

;===================================================================================================
; Magic Shop assistant when at least one empty bottle
;===================================================================================================
; アカのクスリは いのちグスリ
; ミドリのクスリは 魔法グスリ
; アオのクスリは いのちと魔法
; アカのクスリは,この場でのむ
; なら,ルピーはいらぬぞえ。
; さあ,これをおのみ⋯ヒッヒッ
;===================================================================================================
Message_004C:
|1C95B7| db $50, $58, $24, $5A, $62, $89, $28, $FF ; アカのクスリは␣
|1C95BF| db $01, $24, $19, $67, $62, $89 ; いのちグスリ
|1C95C5| db $F8 ; row 2
|1C95C6| db $81, $87, $89, $24, $5A, $62, $89, $28 ; ミドリのクスリは
|1C95CE| db $FF ; ␣
|1C95CF| db $FD, $2D ; kanji 魔
|1C95D1| db $FD, $3C ; kanji 法
|1C95D3| db $67, $62, $89 ; グスリ
|1C95D6| db $F9 ; row 3
|1C95D7| db $50, $54, $24, $5A, $62, $89, $28, $FF ; アオのクスリは␣
|1C95DF| db $01, $24, $19, $1C ; いのちと
|1C95E3| db $FD, $2D ; kanji 魔
|1C95E5| db $FD, $3C ; kanji 法
|1C95E7| db $FA ; wait for key
|1C95E8| db $F6 ; scroll
|1C95E9| db $50, $58, $24, $5A, $62, $89, $28, $C8 ; アカのクスリは,
|1C95F1| db $0C, $24 ; この
|1C95F3| db $FD, $A8 ; kanji 場
|1C95F5| db $36, $24, $32 ; でのむ
|1C95F8| db $F6 ; scroll
|1C95F9| db $20, $38, $C8, $8A, $93, $C9, $28, $01 ; なら,ルピーはい
|1C9601| db $38, $22, $2D, $03, $CD ; らぬぞえ。
|1C9606| db $F6 ; scroll
|1C9607| db $10, $00, $C8, $0C, $3B, $0E, $04, $24 ; さあ,これをおの
|1C960F| db $31, $CC, $79, $9A, $79, $9A ; み⋯ヒッヒッ
|1C9615| db $FB ; end of message

;===================================================================================================
; Magic Shop cauldrons when no bottles
;===================================================================================================
; ビンがなければ,クスリは
; かえないぞえ。ヒッヒッヒッ
;===================================================================================================
Message_004D:
|1C9616| db $8E, $5F, $15, $20, $0B, $3B, $3D, $C8 ; ビンがなければ,
|1C961E| db $5A, $62, $89, $28 ; クスリは
|1C9622| db $F8 ; row 2
|1C9623| db $08, $03, $20, $01, $2D, $03, $CD, $79 ; かえないぞえ。ヒ
|1C962B| db $9A, $79, $9A, $79, $9A ; ッヒッヒッ
|1C9630| db $FB ; end of message

;===================================================================================================
; Magic Shop cauldrons when bottles are had, but none are empty
;===================================================================================================
; ほれほれ,ビンがいっぱいでは
; 何もはいらんぞえ。 ヒッヒッ
;===================================================================================================
Message_004E:
|1C9631| db $2C, $3B, $2C, $3B, $C8, $8E, $5F, $15 ; ほれほれ,ビンが
|1C9639| db $01, $4A, $42, $01, $36, $28 ; いっぱいでは
|1C963F| db $F8 ; row 2
|1C9640| db $FD, $8B ; kanji 何
|1C9642| db $34, $28, $01, $38, $0F, $2D, $03, $CD ; もはいらんぞえ。
|1C964A| db $FF, $79, $9A, $79, $9A ; ␣ヒッヒッ
|1C964F| db $FB ; end of message

;===================================================================================================
; Lamp get
;===================================================================================================
; カンテラを 手に入れた
; Yボタンでとうろうに火をつけ
; れるぞ!
;===================================================================================================
Message_004F:
|1C9650| db $58, $5F, $6B, $88, $0E, $FF ; カンテラを␣
|1C9656| db $FD, $3E ; kanji 手
|1C9658| db $21 ; に
|1C9659| db $FD, $49 ; kanji 入
|1C965B| db $3B, $18 ; れた
|1C965D| db $F8 ; row 2
|1C965E| db $C2, $91, $68, $5F, $36, $1C, $02, $3C ; Yボタンでとうろ
|1C9666| db $02, $21 ; うに
|1C9668| db $FD, $CD ; kanji 火
|1C966A| db $0E, $1A, $0B ; をつけ
|1C966D| db $F9 ; row 3
|1C966E| db $3B, $3A, $2D, $C7 ; れるぞ!
|1C9672| db $FB ; end of message

;===================================================================================================
; Blue boomerang get
;===================================================================================================
; ブーメランだ!
; STARTボタンで,選んで
; 使ってみよう!
;===================================================================================================
Message_0050:
|1C9673| db $8F, $C9, $83, $88, $5F, $2E, $C7 ; ブーメランだ!
|1C967A| db $F8 ; row 2
|1C967B| db $BC, $BD, $AA, $BB, $BD, $91, $68, $5F ; STARTボタン
|1C9683| db $36, $C8 ; で,
|1C9685| db $FD, $81 ; kanji 選
|1C9687| db $0F, $36 ; んで
|1C9689| db $F9 ; row 3
|1C968A| db $FD, $89 ; kanji 使
|1C968C| db $4A, $1B, $31, $07, $02, $C7 ; ってみよう!
|1C9692| db $FB ; end of message

;===================================================================================================
; Bow get
;===================================================================================================
; ユミを みつけた
; 矢 がうてるぞ!
; 矢 がなくなるまでだぞっ!
;===================================================================================================
Message_0051:
|1C9693| db $FF, $56, $81, $0E, $FF, $31, $1A, $0B ; ␣ユミを␣みつけ
|1C969B| db $18 ; た
|1C969C| db $F8 ; row 2
|1C969D| db $FF ; ␣
|1C969E| db $FD, $BB ; kanji 矢
|1C96A0| db $FF, $15, $02, $1B, $3A, $2D, $C7 ; ␣がうてるぞ!
|1C96A7| db $F9 ; row 3
|1C96A8| db $FF ; ␣
|1C96A9| db $FD, $BB ; kanji 矢
|1C96AB| db $FF, $15, $20, $0A, $20, $3A, $30, $36 ; ␣がなくなるまで
|1C96B3| db $2E, $2D, $4A, $C7 ; だぞっ!
|1C96B7| db $FB ; end of message

;===================================================================================================
; Shovel get
;===================================================================================================
; シャベルを,おかりした。
; ほれる所なら,穴がほれるぞ。
; ほってみよう。
;===================================================================================================
Message_0052:
|1C96B8| db $61, $97, $90, $8A, $0E, $C8, $04, $08 ; シャベルを,おか
|1C96C0| db $39, $11, $18, $CD ; りした。
|1C96C4| db $F8 ; row 2
|1C96C5| db $2C, $3B, $3A ; ほれる
|1C96C8| db $FD, $55 ; kanji 所
|1C96CA| db $20, $38, $C8 ; なら,
|1C96CD| db $FD, $5C ; kanji 穴
|1C96CF| db $15, $2C, $3B, $3A, $2D, $CD ; がほれるぞ。
|1C96D5| db $F9 ; row 3
|1C96D6| db $2C, $4A, $1B, $31, $07, $02, $CD ; ほってみよう。
|1C96DD| db $FB ; end of message

;===================================================================================================
; Magic cape get
;===================================================================================================
; マジックマントだ!
; 姿を消す事ができるが,
; 魔法メーターに気を付けろ!
;===================================================================================================
Message_0053:
|1C96DE| db $FF, $80, $75, $9A, $5A, $80, $5F, $6C ; ␣マジックマント
|1C96E6| db $2E, $C7 ; だ!
|1C96E8| db $F8 ; row 2
|1C96E9| db $FF ; ␣
|1C96EA| db $FD, $A2 ; kanji 姿
|1C96EC| db $0E ; を
|1C96ED| db $FD, $9D ; kanji 消
|1C96EF| db $12 ; す
|1C96F0| db $FD, $22 ; kanji 事
|1C96F2| db $15, $36, $09, $3A, $15, $C8 ; ができるが,
|1C96F8| db $F9 ; row 3
|1C96F9| db $FF ; ␣
|1C96FA| db $FD, $2D ; kanji 魔
|1C96FC| db $FD, $3C ; kanji 法
|1C96FE| db $83, $C9, $68, $C9, $21 ; メーターに
|1C9703| db $FD, $37 ; kanji 気
|1C9705| db $0E ; を
|1C9706| db $FD, $52 ; kanji 付
|1C9708| db $0B, $3C, $C7 ; けろ!
|1C970B| db $FB ; end of message

;===================================================================================================
; Magic powder get
;===================================================================================================
; これが 魔法の粉だ!
; 敵や 色々な物に
; ふりかけてみよう!
;===================================================================================================
Message_0054:
|1C970C| db $0C, $3B, $15, $FF ; これが␣
|1C9710| db $FD, $2D ; kanji 魔
|1C9712| db $FD, $3C ; kanji 法
|1C9714| db $24 ; の
|1C9715| db $FD, $CC ; kanji 粉
|1C9717| db $2E, $C7 ; だ!
|1C9719| db $F8 ; row 2
|1C971A| db $FD, $D1 ; kanji 敵
|1C971C| db $05, $FF ; や␣
|1C971E| db $FD, $A4 ; kanji 色
|1C9720| db $FD, $A5 ; kanji 々
|1C9722| db $20 ; な
|1C9723| db $FD, $51 ; kanji 物
|1C9725| db $21 ; に
|1C9726| db $F9 ; row 3
|1C9727| db $2A, $39, $08, $0B, $1B, $31, $07, $02 ; ふりかけてみよう
|1C972F| db $C7 ; !
|1C9730| db $FB ; end of message

;===================================================================================================
; Zora's flippers get
;===================================================================================================
; ゾーラの水かきを かった!
; これで水の深い所も,
; スイスイおよげるはずだ!
;===================================================================================================
Message_0055:
|1C9731| db $7D, $C9, $88, $24 ; ゾーラの
|1C9735| db $FD, $66 ; kanji 水
|1C9737| db $08, $09, $0E, $FF, $08, $4A, $18, $C7 ; かきを␣かった!
|1C973F| db $F8 ; row 2
|1C9740| db $0C, $3B, $36 ; これで
|1C9743| db $FD, $66 ; kanji 水
|1C9745| db $24 ; の
|1C9746| db $FD, $64 ; kanji 深
|1C9748| db $01 ; い
|1C9749| db $FD, $55 ; kanji 所
|1C974B| db $34, $C8 ; も,
|1C974D| db $F9 ; row 3
|1C974E| db $62, $51, $62, $51, $04, $07, $1D, $3A ; スイスイおよげる
|1C9756| db $28, $26, $2E, $C7 ; はずだ!
|1C975A| db $FB ; end of message

;===================================================================================================
; Power glove get
;===================================================================================================
; パワーグラブを 手に入れた!
; 両うでに力がみなぎるぞ。
; イシだってかつげるぞ!
;===================================================================================================
Message_0056:
|1C975B| db $92, $5D, $C9, $67, $88, $8F, $0E, $FF ; パワーグラブを␣
|1C9763| db $FD, $3E ; kanji 手
|1C9765| db $21 ; に
|1C9766| db $FD, $49 ; kanji 入
|1C9768| db $3B, $18, $C7 ; れた!
|1C976B| db $F8 ; row 2
|1C976C| db $FD, $F7 ; kanji 両
|1C976E| db $02, $36, $21 ; うでに
|1C9771| db $FD, $99 ; kanji 力
|1C9773| db $15, $31, $20, $16, $3A, $2D, $CD ; がみなぎるぞ。
|1C977A| db $F9 ; row 3
|1C977B| db $51, $61, $2E, $4A, $1B, $08, $1A, $1D ; イシだってかつげ
|1C9783| db $3A, $2D, $C7 ; るぞ!
|1C9786| db $FB ; end of message

;===================================================================================================
; Green pendant get
;===================================================================================================
; 『勇気の紋章』を手に入れた!
; 長老サハスラーラに見せるのだ
; 残りの紋章は,あと2つだ!
;===================================================================================================
Message_0057:
|1C9787| db $C4 ; 『
|1C9788| db $FD, $A0 ; kanji 勇
|1C978A| db $FD, $37 ; kanji 気
|1C978C| db $24 ; の
|1C978D| db $FD, $53 ; kanji 紋
|1C978F| db $FD, $54 ; kanji 章
|1C9791| db $C5, $0E ; 』を
|1C9793| db $FD, $3E ; kanji 手
|1C9795| db $21 ; に
|1C9796| db $FD, $49 ; kanji 入
|1C9798| db $3B, $18, $C7 ; れた!
|1C979B| db $F8 ; row 2
|1C979C| db $FD, $8D ; kanji 長
|1C979E| db $FD, $E5 ; kanji 老
|1C97A0| db $60, $78, $62, $88, $C9, $88, $21 ; サハスラーラに
|1C97A7| db $FD, $4C ; kanji 見
|1C97A9| db $13, $3A, $24, $2E ; せるのだ
|1C97AD| db $F9 ; row 3
|1C97AE| db $FD, $C6 ; kanji 残
|1C97B0| db $39, $24 ; りの
|1C97B2| db $FD, $53 ; kanji 紋
|1C97B4| db $FD, $54 ; kanji 章
|1C97B6| db $28, $C8, $00, $1C, $A2, $1A, $2E, $C7 ; は,あと2つだ!
|1C97BE| db $FB ; end of message

;===================================================================================================
; Blue pendant get when blue is second
;===================================================================================================
; 『力の紋章』を手に入れた!
; またひとつ,強くなったぞ!
; さあ,さいごの紋章へ向おう!
;===================================================================================================
Message_0058:
|1C97BF| db $C4 ; 『
|1C97C0| db $FD, $99 ; kanji 力
|1C97C2| db $24 ; の
|1C97C3| db $FD, $53 ; kanji 紋
|1C97C5| db $FD, $54 ; kanji 章
|1C97C7| db $C5, $0E ; 』を
|1C97C9| db $FD, $3E ; kanji 手
|1C97CB| db $21 ; に
|1C97CC| db $FD, $49 ; kanji 入
|1C97CE| db $3B, $18, $C7 ; れた!
|1C97D1| db $F8 ; row 2
|1C97D2| db $30, $18, $29, $1C, $1A, $C8 ; またひとつ,
|1C97D8| db $FD, $FB ; kanji 強
|1C97DA| db $0A, $20, $4A, $18, $2D, $C7 ; くなったぞ!
|1C97E0| db $F9 ; row 3
|1C97E1| db $10, $00, $C8, $10, $01, $1E, $24 ; さあ,さいごの
|1C97E8| db $FD, $53 ; kanji 紋
|1C97EA| db $FD, $54 ; kanji 章
|1C97EC| db $2B ; へ
|1C97ED| db $FD, $86 ; kanji 向
|1C97EF| db $04, $02, $C7 ; おう!
|1C97F2| db $FB ; end of message

;===================================================================================================
; Red pendant get when red is third
;===================================================================================================
; 『知恵の紋章』を手に入れた!
; やった!3つの紋章がそろった
; マスターソードの森へ向おう!
;===================================================================================================
Message_0059:
|1C97F3| db $C4 ; 『
|1C97F4| db $FD, $93 ; kanji 知
|1C97F6| db $FD, $41 ; kanji 恵
|1C97F8| db $24 ; の
|1C97F9| db $FD, $53 ; kanji 紋
|1C97FB| db $FD, $54 ; kanji 章
|1C97FD| db $C5, $0E ; 』を
|1C97FF| db $FD, $3E ; kanji 手
|1C9801| db $21 ; に
|1C9802| db $FD, $49 ; kanji 入
|1C9804| db $3B, $18, $C7 ; れた!
|1C9807| db $F8 ; row 2
|1C9808| db $05, $4A, $18, $C7, $A3, $1A, $24 ; やった!3つの
|1C980F| db $FD, $53 ; kanji 紋
|1C9811| db $FD, $54 ; kanji 章
|1C9813| db $15, $14, $3C, $4A, $18 ; がそろった
|1C9818| db $F9 ; row 3
|1C9819| db $80, $62, $68, $C9, $64, $C9, $87, $24 ; マスターソードの
|1C9821| db $FD, $65 ; kanji 森
|1C9823| db $2B ; へ
|1C9824| db $FD, $86 ; kanji 向
|1C9826| db $04, $02, $C7 ; おう!
|1C9829| db $FB ; end of message

;===================================================================================================
; Mushroom get
;===================================================================================================
; あまい 果物のくさったような
; かおりがするキノコだ⋯
; Yボタンで人にわたせたりする
;===================================================================================================
Message_005A:
|1C982A| db $00, $30, $01, $FF ; あまい␣
|1C982E| db $FD, $7F ; kanji 果
|1C9830| db $FD, $51 ; kanji 物
|1C9832| db $24, $0A, $10, $4A, $18, $07, $02, $20 ; のくさったような
|1C983A| db $F8 ; row 2
|1C983B| db $08, $04, $39, $15, $12, $3A, $59, $74 ; かおりがするキノ
|1C9843| db $5C, $2E, $CC ; コだ⋯
|1C9846| db $F9 ; row 3
|1C9847| db $C2, $91, $68, $5F, $36 ; Yボタンで
|1C984C| db $FD, $38 ; kanji 人
|1C984E| db $21, $0D, $18, $13, $18, $39, $12, $3A ; にわたせたりする
|1C9856| db $FB ; end of message

;===================================================================================================
; Book of Mudora get
;===================================================================================================
; ムドラの書を みつけた!
; ハイリアの民が使った古代文字
; が,これで読めるぞ!
;===================================================================================================
Message_005B:
|1C9857| db $82, $87, $88, $24 ; ムドラの
|1C985B| db $FD, $0E ; kanji 書
|1C985D| db $0E, $FF, $31, $1A, $0B, $18, $C7 ; を␣みつけた!
|1C9864| db $F8 ; row 2
|1C9865| db $78, $51, $89, $50, $24 ; ハイリアの
|1C986A| db $FD, $F8 ; kanji 民
|1C986C| db $15 ; が
|1C986D| db $FD, $89 ; kanji 使
|1C986F| db $4A, $18 ; った
|1C9871| db $FD, $8A ; kanji 古
|1C9873| db $FD, $6E ; kanji 代
|1C9875| db $FD, $C0 ; kanji 文
|1C9877| db $FD, $7B ; kanji 字
|1C9879| db $F9 ; row 3
|1C987A| db $15, $C8, $0C, $3B, $36 ; が,これで
|1C987F| db $FD, $58 ; kanji 読
|1C9881| db $33, $3A, $2D, $C7 ; めるぞ!
|1C9885| db $FB ; end of message

;===================================================================================================
; Moon pearl get
;===================================================================================================
; ムーンパールを みつけた!
; 悪しき者が使う黄金の力から
; 勇者を守り姿をかえさせない。
;===================================================================================================
Message_005C:
|1C9886| db $82, $C9, $5F, $92, $C9, $8A, $0E, $FF ; ムーンパールを␣
|1C988E| db $31, $1A, $0B, $18, $C7 ; みつけた!
|1C9893| db $F8 ; row 2
|1C9894| db $FD, $85 ; kanji 悪
|1C9896| db $11, $09 ; しき
|1C9898| db $FD, $1E ; kanji 者
|1C989A| db $15 ; が
|1C989B| db $FD, $89 ; kanji 使
|1C989D| db $02 ; う
|1C989E| db $FD, $98 ; kanji 黄
|1C98A0| db $FD, $43 ; kanji 金
|1C98A2| db $24 ; の
|1C98A3| db $FD, $99 ; kanji 力
|1C98A5| db $08, $38 ; から
|1C98A7| db $F9 ; row 3
|1C98A8| db $FD, $A0 ; kanji 勇
|1C98AA| db $FD, $1E ; kanji 者
|1C98AC| db $0E ; を
|1C98AD| db $FD, $91 ; kanji 守
|1C98AF| db $39 ; り
|1C98B0| db $FD, $A2 ; kanji 姿
|1C98B2| db $0E, $08, $03, $10, $13, $20, $01, $CD ; をかえさせない。
|1C98BA| db $FB ; end of message

;===================================================================================================
; Compass get
;===================================================================================================
; コンパスを みつけた
; ボスの場所は
; これでばっちりだぜ!
;===================================================================================================
Message_005D:
|1C98BB| db $FF, $5C, $5F, $92, $62, $0E, $FF, $31 ; ␣コンパスを␣み
|1C98C3| db $1A, $0B, $18 ; つけた
|1C98C6| db $F8 ; row 2
|1C98C7| db $FF, $91, $62, $24 ; ␣ボスの
|1C98CB| db $FD, $A8 ; kanji 場
|1C98CD| db $FD, $55 ; kanji 所
|1C98CF| db $28 ; は
|1C98D0| db $F9 ; row 3
|1C98D1| db $FF, $0C, $3B, $36, $3D, $4A, $19, $39 ; ␣これでばっちり
|1C98D9| db $2E, $27, $C7 ; だぜ!
|1C98DC| db $FB ; end of message

;===================================================================================================
; Map get
;===================================================================================================
; MAPを 手に入れた!
; XボタンをPUSHすると
; 現在地と全体がわかるはずだ!
;===================================================================================================
Message_005E:
|1C98DD| db $B6, $AA, $B9, $0E, $FF ; MAPを␣
|1C98E2| db $FD, $3E ; kanji 手
|1C98E4| db $21 ; に
|1C98E5| db $FD, $49 ; kanji 入
|1C98E7| db $3B, $18, $C7 ; れた!
|1C98EA| db $F8 ; row 2
|1C98EB| db $C1, $91, $68, $5F, $0E, $B9, $BE, $BC ; XボタンをPUS
|1C98F3| db $B1, $12, $3A, $1C ; Hすると
|1C98F7| db $F9 ; row 3
|1C98F8| db $FD, $BC ; kanji 現
|1C98FA| db $FD, $BD ; kanji 在
|1C98FC| db $FD, $33 ; kanji 地
|1C98FE| db $1C ; と
|1C98FF| db $FD, $BE ; kanji 全
|1C9901| db $FD, $BF ; kanji 体
|1C9903| db $15, $0D, $08, $3A, $28, $26, $2E, $C7 ; がわかるはずだ!
|1C990B| db $FB ; end of message

;===================================================================================================
; Ice rod get
;===================================================================================================
; アイスロッドを みつけた!
; するどい冷気が,空気をさく。
; 魔法メーターには気を付けろ!
;===================================================================================================
Message_005F:
|1C990C| db $50, $51, $62, $8C, $9A, $87, $0E, $FF ; アイスロッドを␣
|1C9914| db $31, $1A, $0B, $18, $C7 ; みつけた!
|1C9919| db $F8 ; row 2
|1C991A| db $12, $3A, $37, $01 ; するどい
|1C991E| db $FD, $97 ; kanji 冷
|1C9920| db $FD, $37 ; kanji 気
|1C9922| db $15, $C8 ; が,
|1C9924| db $FD, $AA ; kanji 空
|1C9926| db $FD, $37 ; kanji 気
|1C9928| db $0E, $10, $0A, $CD ; をさく。
|1C992C| db $F9 ; row 3
|1C992D| db $FD, $2D ; kanji 魔
|1C992F| db $FD, $3C ; kanji 法
|1C9931| db $83, $C9, $68, $C9, $21, $28 ; メーターには
|1C9937| db $FD, $37 ; kanji 気
|1C9939| db $0E ; を
|1C993A| db $FD, $52 ; kanji 付
|1C993C| db $0B, $3C, $C7 ; けろ!
|1C993F| db $FB ; end of message

;===================================================================================================
; Fire rod get
;===================================================================================================
; ファイアロッドを みつけた!
; 真紅の炎が ほとばしる。
; 魔法メーターには気を付けろ!
;===================================================================================================
Message_0060:
|1C9940| db $7A, $9B, $51, $50, $8C, $9A, $87, $0E ; ファイアロッドを
|1C9948| db $FF, $31, $1A, $0B, $18, $C7 ; ␣みつけた!
|1C994E| db $F8 ; row 2
|1C994F| db $FD, $A6 ; kanji 真
|1C9951| db $FD, $A7 ; kanji 紅
|1C9953| db $24 ; の
|1C9954| db $FD, $A9 ; kanji 炎
|1C9956| db $15, $FF, $2C, $1C, $3D, $11, $3A, $CD ; が␣ほとばしる。
|1C995E| db $F9 ; row 3
|1C995F| db $FD, $2D ; kanji 魔
|1C9961| db $FD, $3C ; kanji 法
|1C9963| db $83, $C9, $68, $C9, $21, $28 ; メーターには
|1C9969| db $FD, $37 ; kanji 気
|1C996B| db $0E ; を
|1C996C| db $FD, $52 ; kanji 付
|1C996E| db $0B, $3C, $C7 ; けろ!
|1C9971| db $FB ; end of message

;===================================================================================================
; Ether medallion get
;===================================================================================================
; 魔法のメダル『エーテル』だ!
; 大気や冷気をあやつる,魔法だ
; 魔法メーターに 注意しよう!
;===================================================================================================
Message_0061:
|1C9972| db $FD, $2D ; kanji 魔
|1C9974| db $FD, $3C ; kanji 法
|1C9976| db $24, $83, $7E, $8A, $C4, $53, $C9, $6B ; のメダル『エーテ
|1C997E| db $8A, $C5, $2E, $C7 ; ル』だ!
|1C9982| db $F8 ; row 2
|1C9983| db $FD, $5F ; kanji 大
|1C9985| db $FD, $37 ; kanji 気
|1C9987| db $05 ; や
|1C9988| db $FD, $97 ; kanji 冷
|1C998A| db $FD, $37 ; kanji 気
|1C998C| db $0E, $00, $05, $1A, $3A, $C8 ; をあやつる,
|1C9992| db $FD, $2D ; kanji 魔
|1C9994| db $FD, $3C ; kanji 法
|1C9996| db $2E ; だ
|1C9997| db $F9 ; row 3
|1C9998| db $FD, $2D ; kanji 魔
|1C999A| db $FD, $3C ; kanji 法
|1C999C| db $83, $C9, $68, $C9, $21, $FF ; メーターに␣
|1C99A2| db $FD, $CE ; kanji 注
|1C99A4| db $FD, $CF ; kanji 意
|1C99A6| db $11, $07, $02, $C7 ; しよう!
|1C99AA| db $FB ; end of message

;===================================================================================================
; Bombos medallion get
;===================================================================================================
; 魔法のメダル『ボンバー』だ!
; バクレツが地面を走る魔法だぞ
; でも,魔法メーターに注意!
;===================================================================================================
Message_0062:
|1C99AB| db $FD, $2D ; kanji 魔
|1C99AD| db $FD, $3C ; kanji 法
|1C99AF| db $24, $83, $7E, $8A, $C4, $91, $5F, $8D ; のメダル『ボンバ
|1C99B7| db $C9, $C5, $2E, $C7 ; ー』だ!
|1C99BB| db $F8 ; row 2
|1C99BC| db $8D, $5A, $8B, $6A, $15 ; バクレツが
|1C99C1| db $FD, $33 ; kanji 地
|1C99C3| db $FD, $AB ; kanji 面
|1C99C5| db $0E ; を
|1C99C6| db $FD, $D0 ; kanji 走
|1C99C8| db $3A ; る
|1C99C9| db $FD, $2D ; kanji 魔
|1C99CB| db $FD, $3C ; kanji 法
|1C99CD| db $2E, $2D ; だぞ
|1C99CF| db $F9 ; row 3
|1C99D0| db $36, $34, $C8 ; でも,
|1C99D3| db $FD, $2D ; kanji 魔
|1C99D5| db $FD, $3C ; kanji 法
|1C99D7| db $83, $C9, $68, $C9, $21 ; メーターに
|1C99DC| db $FD, $CE ; kanji 注
|1C99DE| db $FD, $CF ; kanji 意
|1C99E0| db $C7 ; !
|1C99E1| db $FB ; end of message

;===================================================================================================
; Quake medallion get
;===================================================================================================
; 魔法のメダル『シェイク』だ!
; 地面をゆるがし 敵を封じる。
; でも,魔法メーターに注意!
;===================================================================================================
Message_0063:
|1C99E2| db $FD, $2D ; kanji 魔
|1C99E4| db $FD, $3C ; kanji 法
|1C99E6| db $24, $83, $7E, $8A, $C4, $61, $9E, $51 ; のメダル『シェイ
|1C99EE| db $5A, $C5, $2E, $C7 ; ク』だ!
|1C99F2| db $F8 ; row 2
|1C99F3| db $FD, $33 ; kanji 地
|1C99F5| db $FD, $AB ; kanji 面
|1C99F7| db $0E, $06, $3A, $15, $11, $FF ; をゆるがし␣
|1C99FD| db $FD, $D1 ; kanji 敵
|1C99FF| db $0E ; を
|1C9A00| db $FD, $9E ; kanji 封
|1C9A02| db $25, $3A, $CD ; じる。
|1C9A05| db $F9 ; row 3
|1C9A06| db $36, $34, $C8 ; でも,
|1C9A09| db $FD, $2D ; kanji 魔
|1C9A0B| db $FD, $3C ; kanji 法
|1C9A0D| db $83, $C9, $68, $C9, $21 ; メーターに
|1C9A12| db $FD, $CE ; kanji 注
|1C9A14| db $FD, $CF ; kanji 意
|1C9A16| db $C7 ; !
|1C9A17| db $FB ; end of message

;===================================================================================================
; M.C. Hammer get
;===================================================================================================
; M,Cハンマーを手に入れた!
; くい なんかバンバンたたけ!
; 他にもバンバンたたけたたけ!
;===================================================================================================
Message_0064:
|1C9A18| db $B6, $C8, $AC, $78, $5F, $80, $C9, $0E ; M,Cハンマーを
|1C9A20| db $FD, $3E ; kanji 手
|1C9A22| db $21 ; に
|1C9A23| db $FD, $49 ; kanji 入
|1C9A25| db $3B, $18, $C7 ; れた!
|1C9A28| db $F8 ; row 2
|1C9A29| db $0A, $01, $FF, $20, $0F, $08, $8D, $5F ; くい␣なんかバン
|1C9A31| db $8D, $5F, $18, $18, $0B, $C7 ; バンたたけ!
|1C9A37| db $F9 ; row 3
|1C9A38| db $FD, $27 ; kanji 他
|1C9A3A| db $21, $34, $8D, $5F, $8D, $5F, $18, $18 ; にもバンバンたた
|1C9A42| db $0B, $18, $18, $0B, $C7 ; けたたけ!
|1C9A47| db $FB ; end of message

;===================================================================================================
; Flute get
;===================================================================================================
; おお,オカリナが あったぞ!
; その音色は,ふしぎな力を
; 持っているはずだ!
;===================================================================================================
Message_0065:
|1C9A48| db $04, $04, $C8, $54, $58, $89, $70, $15 ; おお,オカリナが
|1C9A50| db $FF, $00, $4A, $18, $2D, $C7 ; ␣あったぞ!
|1C9A56| db $F8 ; row 2
|1C9A57| db $14, $24 ; その
|1C9A59| db $FD, $AC ; kanji 音
|1C9A5B| db $FD, $A4 ; kanji 色
|1C9A5D| db $28, $C8, $2A, $11, $16, $20 ; は,ふしぎな
|1C9A63| db $FD, $99 ; kanji 力
|1C9A65| db $0E ; を
|1C9A66| db $F9 ; row 3
|1C9A67| db $FD, $DB ; kanji 持
|1C9A69| db $4A, $1B, $01, $3A, $28, $26, $2E, $C7 ; っているはずだ!
|1C9A71| db $FB ; end of message

;===================================================================================================
; Cane of Somaria get
;===================================================================================================
; ソマリアのつえを手に入れた!
; うまく使えば,とてもやくに
; たつ,ふしぎなつえだ!
;===================================================================================================
Message_0066:
|1C9A72| db $64, $80, $89, $50, $24, $1A, $03, $0E ; ソマリアのつえを
|1C9A7A| db $FD, $3E ; kanji 手
|1C9A7C| db $21 ; に
|1C9A7D| db $FD, $49 ; kanji 入
|1C9A7F| db $3B, $18, $C7 ; れた!
|1C9A82| db $F8 ; row 2
|1C9A83| db $02, $30, $0A ; うまく
|1C9A86| db $FD, $89 ; kanji 使
|1C9A88| db $03, $3D, $C8, $1C, $1B, $34, $05, $0A ; えば,とてもやく
|1C9A90| db $21 ; に
|1C9A91| db $F9 ; row 3
|1C9A92| db $18, $1A, $C8, $2A, $11, $16, $20, $1A ; たつ,ふしぎなつ
|1C9A9A| db $03, $2E, $C7 ; えだ!
|1C9A9D| db $FB ; end of message

;===================================================================================================
; Hookshot get
;===================================================================================================
; ボヨヨ〜ン フックショットだ
; のびて ちぢんでボヨヨ〜ン!
; 色々な物に さしてみよう!
;===================================================================================================
Message_0067:
|1C9A9E| db $91, $57, $57, $CE, $5F, $FF, $7A, $9A ; ボヨヨ〜ン␣フッ
|1C9AA6| db $5A, $61, $99, $9A, $6C, $2E ; クショットだ
|1C9AAC| db $F8 ; row 2
|1C9AAD| db $24, $3E, $1B, $FF, $19, $2F, $0F, $36 ; のびて␣ちぢんで
|1C9AB5| db $91, $57, $57, $CE, $5F, $C7 ; ボヨヨ〜ン!
|1C9ABB| db $F9 ; row 3
|1C9ABC| db $FD, $A4 ; kanji 色
|1C9ABE| db $FD, $A5 ; kanji 々
|1C9AC0| db $20 ; な
|1C9AC1| db $FD, $51 ; kanji 物
|1C9AC3| db $21, $FF, $10, $11, $1B, $31, $07, $02 ; に␣さしてみよう
|1C9ACB| db $C7 ; !
|1C9ACC| db $FB ; end of message

;===================================================================================================
; Bombs get (3 or 10)
;===================================================================================================
; バクダンを 手に入れた。
; おいたバクダンを Aボタンで
; かついで,投げられるぞっ!
;===================================================================================================
Message_0068:
|1C9ACD| db $8D, $5A, $7E, $5F, $0E, $FF ; バクダンを␣
|1C9AD3| db $FD, $3E ; kanji 手
|1C9AD5| db $21 ; に
|1C9AD6| db $FD, $49 ; kanji 入
|1C9AD8| db $3B, $18, $CD ; れた。
|1C9ADB| db $F8 ; row 2
|1C9ADC| db $04, $01, $18, $8D, $5A, $7E, $5F, $0E ; おいたバクダンを
|1C9AE4| db $FF, $AA, $91, $68, $5F, $36 ; ␣Aボタンで
|1C9AEA| db $F9 ; row 3
|1C9AEB| db $08, $1A, $01, $36, $C8 ; かついで,
|1C9AF0| db $FD, $FC ; kanji 投
|1C9AF2| db $1D, $38, $3B, $3A, $2D, $4A, $C7 ; げられるぞっ!
|1C9AF9| db $FB ; end of message

;===================================================================================================
; Bottle get
;===================================================================================================
; これは ビンだ。中に色々
; 入れることができる。
; 入れた物はあとで使えるぞ!
;===================================================================================================
Message_0069:
|1C9AFA| db $0C, $3B, $28, $FF, $8E, $5F, $2E, $CD ; これは␣ビンだ。
|1C9B02| db $FD, $AE ; kanji 中
|1C9B04| db $21 ; に
|1C9B05| db $FD, $A4 ; kanji 色
|1C9B07| db $FD, $A5 ; kanji 々
|1C9B09| db $F8 ; row 2
|1C9B0A| db $FD, $49 ; kanji 入
|1C9B0C| db $3B, $3A, $0C, $1C, $15, $36, $09, $3A ; れることができる
|1C9B14| db $CD ; 。
|1C9B15| db $F9 ; row 3
|1C9B16| db $FD, $49 ; kanji 入
|1C9B18| db $3B, $18 ; れた
|1C9B1A| db $FD, $51 ; kanji 物
|1C9B1C| db $28, $00, $1C, $36 ; はあとで
|1C9B20| db $FD, $89 ; kanji 使
|1C9B22| db $03, $3A, $2D, $C7 ; えるぞ!
|1C9B26| db $FB ; end of message

;===================================================================================================
; Big key get
;===================================================================================================
; 大きなカギを 手に入れた。
; 小さなカギでは 開かない
; ジョウ前を開く事ができるぞ!
;===================================================================================================
Message_006A:
|1C9B27| db $FD, $5F ; kanji 大
|1C9B29| db $09, $20, $58, $66, $0E, $FF ; きなカギを␣
|1C9B2F| db $FD, $3E ; kanji 手
|1C9B31| db $21 ; に
|1C9B32| db $FD, $49 ; kanji 入
|1C9B34| db $3B, $18, $CD ; れた。
|1C9B37| db $F8 ; row 2
|1C9B38| db $FD, $FA ; kanji 小
|1C9B3A| db $10, $20, $58, $66, $36, $28, $FF ; さなカギでは␣
|1C9B41| db $FD, $4B ; kanji 開
|1C9B43| db $08, $20, $01 ; かない
|1C9B46| db $F9 ; row 3
|1C9B47| db $75, $99, $52 ; ジョウ
|1C9B4A| db $FD, $78 ; kanji 前
|1C9B4C| db $0E ; を
|1C9B4D| db $FD, $4B ; kanji 開
|1C9B4F| db $0A ; く
|1C9B50| db $FD, $22 ; kanji 事
|1C9B52| db $15, $36, $09, $3A, $2D, $C7 ; ができるぞ!
|1C9B58| db $FB ; end of message

;===================================================================================================
; Titan's mitt get
;===================================================================================================
; パワフルグラブを手に入れた。
; おもくて,かつげなかった
; くろいイシも かつげるぞ!
;===================================================================================================
Message_006B:
|1C9B59| db $92, $5D, $7A, $8A, $67, $88, $8F, $0E ; パワフルグラブを
|1C9B61| db $FD, $3E ; kanji 手
|1C9B63| db $21 ; に
|1C9B64| db $FD, $49 ; kanji 入
|1C9B66| db $3B, $18, $CD ; れた。
|1C9B69| db $F8 ; row 2
|1C9B6A| db $04, $34, $0A, $1B, $C8, $08, $1A, $1D ; おもくて,かつげ
|1C9B72| db $20, $08, $4A, $18 ; なかった
|1C9B76| db $F9 ; row 3
|1C9B77| db $0A, $3C, $01, $51, $61, $34, $FF, $08 ; くろいイシも␣か
|1C9B7F| db $1A, $1D, $3A, $2D, $C7 ; つげるぞ!
|1C9B84| db $FB ; end of message

;===================================================================================================
; Magic mirror get
;===================================================================================================
; マジカルミラーを もらった!
; 青く すんだ 美しいカガミ⋯
; すい込まれそうな気がしてくる
;===================================================================================================
Message_006C:
|1C9B85| db $80, $75, $58, $8A, $81, $88, $C9, $0E ; マジカルミラーを
|1C9B8D| db $FF, $34, $38, $4A, $18, $C7 ; ␣もらった!
|1C9B93| db $F8 ; row 2
|1C9B94| db $FD, $DA ; kanji 青
|1C9B96| db $0A, $FF, $12, $0F, $2E, $FF ; く␣すんだ␣
|1C9B9C| db $FD, $68 ; kanji 美
|1C9B9E| db $11, $01, $58, $65, $81, $CC ; しいカガミ⋯
|1C9BA4| db $F9 ; row 3
|1C9BA5| db $12, $01 ; すい
|1C9BA7| db $FD, $DC ; kanji 込
|1C9BA9| db $30, $3B, $14, $02, $20 ; まれそうな
|1C9BAE| db $FD, $37 ; kanji 気
|1C9BB0| db $15, $11, $1B, $0A, $3A ; がしてくる
|1C9BB5| db $FB ; end of message

;===================================================================================================
; Fake Master Sword grabbed
;===================================================================================================
; やった! マスターソード⋯
; ⋯ ⋯ ⋯
; では,ない様だ。 ザンネン
;===================================================================================================
Message_006D:
|1C9BB6| db $05, $4A, $18, $C7, $FF, $80, $62, $68 ; やった!␣マスタ
|1C9BBE| db $C9, $64, $C9, $87, $CC ; ーソード⋯
|1C9BC3| db $F8 ; row 2
|1C9BC4| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C9BCA| db $F9 ; row 3
|1C9BCB| db $36, $28, $C8, $20, $01 ; では,ない
|1C9BD0| db $FD, $10 ; kanji 様
|1C9BD2| db $2E, $CD, $FF, $6F, $5F, $73, $5F ; だ。␣ザンネン
|1C9BD9| db $FB ; end of message

;===================================================================================================
; Master Sword get
;===================================================================================================
; 長老サハスラーラ の声が
; どこからとなく ひびいてくる
; ⋯ ⋯ ⋯
; [LINK]よ よくぞ退魔の剣
; マスターソードを手に入れた⋯
; そのかがやき全てがお前の力だ
; その剣ならば,司祭の魔力をも
; うちやぶるはずじゃっ!
; この国の運命は,お前に
; かかっておる。
; 頼んだぞ [LINK]よ ⋯
;===================================================================================================
Message_006E:
|1C9BDA| db $FE, $6B, $02 ; border: 2
|1C9BDD| db $FC, $06 ; text speed: 6
|1C9BDF| db $FD, $8D ; kanji 長
|1C9BE1| db $FD, $E5 ; kanji 老
|1C9BE3| db $60, $78, $62, $88, $C9, $88, $FF, $24 ; サハスラーラ␣の
|1C9BEB| db $FD, $60 ; kanji 声
|1C9BED| db $15 ; が
|1C9BEE| db $F8 ; row 2
|1C9BEF| db $37, $0C, $08, $38, $1C, $20, $0A, $FF ; どこからとなく␣
|1C9BF7| db $29, $3E, $01, $1B, $0A, $3A ; ひびいてくる
|1C9BFD| db $F9 ; row 3
|1C9BFE| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1C9C04| db $FA ; wait for key
|1C9C05| db $F6 ; scroll
|1C9C06| db $FE, $6A ; write player name
|1C9C08| db $07, $FF, $07, $0A, $2D ; よ␣よくぞ
|1C9C0D| db $FD, $2C ; kanji 退
|1C9C0F| db $FD, $2D ; kanji 魔
|1C9C11| db $24 ; の
|1C9C12| db $FD, $1A ; kanji 剣
|1C9C14| db $F6 ; scroll
|1C9C15| db $80, $62, $68, $C9, $64, $C9, $87, $0E ; マスターソードを
|1C9C1D| db $FD, $3E ; kanji 手
|1C9C1F| db $21 ; に
|1C9C20| db $FD, $49 ; kanji 入
|1C9C22| db $3B, $18, $CC ; れた⋯
|1C9C25| db $F6 ; scroll
|1C9C26| db $14, $24, $08, $15, $05, $09 ; そのかがやき
|1C9C2C| db $FD, $BE ; kanji 全
|1C9C2E| db $1B, $15, $04 ; てがお
|1C9C31| db $FD, $78 ; kanji 前
|1C9C33| db $24 ; の
|1C9C34| db $FD, $99 ; kanji 力
|1C9C36| db $2E ; だ
|1C9C37| db $FA ; wait for key
|1C9C38| db $F6 ; scroll
|1C9C39| db $14, $24 ; その
|1C9C3B| db $FD, $1A ; kanji 剣
|1C9C3D| db $20, $38, $3D, $C8 ; ならば,
|1C9C41| db $FD, $0D ; kanji 司
|1C9C43| db $FD, $17 ; kanji 祭
|1C9C45| db $24 ; の
|1C9C46| db $FD, $2D ; kanji 魔
|1C9C48| db $FD, $99 ; kanji 力
|1C9C4A| db $0E, $34 ; をも
|1C9C4C| db $F6 ; scroll
|1C9C4D| db $02, $19, $05, $3F, $3A, $28, $26, $25 ; うちやぶるはずじ
|1C9C55| db $47, $4A, $C7 ; ゃっ!
|1C9C58| db $F6 ; scroll
|1C9C59| db $FA ; wait for key
|1C9C5A| db $F6 ; scroll
|1C9C5B| db $0C, $24 ; この
|1C9C5D| db $FD, $2B ; kanji 国
|1C9C5F| db $24 ; の
|1C9C60| db $FD, $4F ; kanji 運
|1C9C62| db $FD, $E4 ; kanji 命
|1C9C64| db $28, $C8, $04 ; は,お
|1C9C67| db $FD, $78 ; kanji 前
|1C9C69| db $21 ; に
|1C9C6A| db $F6 ; scroll
|1C9C6B| db $08, $08, $4A, $1B, $04, $3A, $CD ; かかっておる。
|1C9C72| db $F6 ; scroll
|1C9C73| db $FD, $08 ; kanji 頼
|1C9C75| db $0F, $2E, $2D, $FF ; んだぞ␣
|1C9C79| db $FE, $67 ; next image
|1C9C7B| db $FE, $6A ; write player name
|1C9C7D| db $07, $FF, $CC ; よ␣⋯
|1C9C80| db $FB ; end of message

;===================================================================================================
; Red potion get
;===================================================================================================
; ヒッヒ まいど おおきに!
; いのちのクスリじゃよ。
; 体力が,かいふくするよ。
;===================================================================================================
Message_006F:
|1C9C81| db $79, $9A, $79, $FF, $30, $01, $37, $FF ; ヒッヒ␣まいど␣
|1C9C89| db $04, $04, $09, $21, $C7 ; おおきに!
|1C9C8E| db $F8 ; row 2
|1C9C8F| db $01, $24, $19, $24, $5A, $62, $89, $25 ; いのちのクスリじ
|1C9C97| db $47, $07, $CD ; ゃよ。
|1C9C9A| db $F9 ; row 3
|1C9C9B| db $FD, $BF ; kanji 体
|1C9C9D| db $FD, $99 ; kanji 力
|1C9C9F| db $15, $C8, $08, $01, $2A, $0A, $12, $3A ; が,かいふくする
|1C9CA7| db $07, $CD ; よ。
|1C9CA9| db $FB ; end of message

;===================================================================================================
; Green potion get
;===================================================================================================
; ヒッヒ まいど おおきに!
; 魔法のクスリじゃよ。
; 魔法の力が,かいふくするよ。
;===================================================================================================
Message_0070:
|1C9CAA| db $79, $9A, $79, $FF, $30, $01, $37, $FF ; ヒッヒ␣まいど␣
|1C9CB2| db $04, $04, $09, $21, $C7 ; おおきに!
|1C9CB7| db $F8 ; row 2
|1C9CB8| db $FD, $2D ; kanji 魔
|1C9CBA| db $FD, $3C ; kanji 法
|1C9CBC| db $24, $5A, $62, $89, $25, $47, $07, $CD ; のクスリじゃよ。
|1C9CC4| db $F9 ; row 3
|1C9CC5| db $FD, $2D ; kanji 魔
|1C9CC7| db $FD, $3C ; kanji 法
|1C9CC9| db $24 ; の
|1C9CCA| db $FD, $99 ; kanji 力
|1C9CCC| db $15, $C8, $08, $01, $2A, $0A, $12, $3A ; が,かいふくする
|1C9CD4| db $07, $CD ; よ。
|1C9CD6| db $FB ; end of message

;===================================================================================================
; Blue potion get
;===================================================================================================
; ヒッヒ まいど おおきに!
; いのちと魔法のクスリじゃよ。
; 両方が,かいふくするよ。
;===================================================================================================
Message_0071:
|1C9CD7| db $79, $9A, $79, $FF, $30, $01, $37, $FF ; ヒッヒ␣まいど␣
|1C9CDF| db $04, $04, $09, $21, $C7 ; おおきに!
|1C9CE4| db $F8 ; row 2
|1C9CE5| db $01, $24, $19, $1C ; いのちと
|1C9CE9| db $FD, $2D ; kanji 魔
|1C9CEB| db $FD, $3C ; kanji 法
|1C9CED| db $24, $5A, $62, $89, $25, $47, $07, $CD ; のクスリじゃよ。
|1C9CF5| db $F9 ; row 3
|1C9CF6| db $FD, $F7 ; kanji 両
|1C9CF8| db $FD, $20 ; kanji 方
|1C9CFA| db $15, $C8, $08, $01, $2A, $0A, $12, $3A ; が,かいふくする
|1C9D02| db $07, $CD ; よ。
|1C9D04| db $FB ; end of message

;===================================================================================================
; Bug-catching net get
;===================================================================================================
; ムシ取りあみを おかりした!
; ムシの他にも 取れる物が
; あるかもしれない。秘密だ⋯。
;===================================================================================================
Message_0072:
|1C9D05| db $FE, $6D, $01 ; position: low
|1C9D08| db $82, $61 ; ムシ
|1C9D0A| db $FD, $47 ; kanji 取
|1C9D0C| db $39, $00, $31, $0E, $FF, $04, $08, $39 ; りあみを␣おかり
|1C9D14| db $11, $18, $C7 ; した!
|1C9D17| db $F8 ; row 2
|1C9D18| db $82, $61, $24 ; ムシの
|1C9D1B| db $FD, $27 ; kanji 他
|1C9D1D| db $21, $34, $FF ; にも␣
|1C9D20| db $FD, $47 ; kanji 取
|1C9D22| db $3B, $3A ; れる
|1C9D24| db $FD, $51 ; kanji 物
|1C9D26| db $15 ; が
|1C9D27| db $F9 ; row 3
|1C9D28| db $00, $3A, $08, $34, $11, $3B, $20, $01 ; あるかもしれない
|1C9D30| db $CD ; 。
|1C9D31| db $FD, $C1 ; kanji 秘
|1C9D33| db $FD, $C2 ; kanji 密
|1C9D35| db $2E, $CC, $CD ; だ⋯。
|1C9D38| db $FB ; end of message

;===================================================================================================
; Blue mail get
;===================================================================================================
; 青い服を みつけた!
; 敵からうけるダメージを
; へらしてくれる。うれしい!
;===================================================================================================
Message_0073:
|1C9D39| db $FD, $DA ; kanji 青
|1C9D3B| db $01 ; い
|1C9D3C| db $FD, $FD ; kanji 服
|1C9D3E| db $0E, $FF, $31, $1A, $0B, $18, $C7 ; を␣みつけた!
|1C9D45| db $F8 ; row 2
|1C9D46| db $FD, $D1 ; kanji 敵
|1C9D48| db $08, $38, $02, $0B, $3A, $7E, $83, $C9 ; からうけるダメー
|1C9D50| db $75, $0E ; ジを
|1C9D52| db $F9 ; row 3
|1C9D53| db $2B, $38, $11, $1B, $0A, $3B, $3A, $CD ; へらしてくれる。
|1C9D5B| db $02, $3B, $11, $01, $C7 ; うれしい!
|1C9D60| db $FB ; end of message

;===================================================================================================
; Red mail get
;===================================================================================================
; あかい服を みつけた!
; 敵からうける ダメージを
; 青い服より へらしてくれる!
;===================================================================================================
Message_0074:
|1C9D61| db $00, $08, $01 ; あかい
|1C9D64| db $FD, $FD ; kanji 服
|1C9D66| db $0E, $FF, $31, $1A, $0B, $18, $C7 ; を␣みつけた!
|1C9D6D| db $F8 ; row 2
|1C9D6E| db $FD, $D1 ; kanji 敵
|1C9D70| db $08, $38, $02, $0B, $3A, $FF, $7E, $83 ; からうける␣ダメ
|1C9D78| db $C9, $75, $0E ; ージを
|1C9D7B| db $F9 ; row 3
|1C9D7C| db $FD, $DA ; kanji 青
|1C9D7E| db $01 ; い
|1C9D7F| db $FD, $FD ; kanji 服
|1C9D81| db $07, $39, $FF, $2B, $38, $11, $1B, $0A ; より␣へらしてく
|1C9D89| db $3B, $3A, $C7 ; れる!
|1C9D8C| db $FB ; end of message

;===================================================================================================
; Tempered sword get
;===================================================================================================
; やった! 剣がより強くなった
; 体の中から 力が
; わいてくる様だっ!
;===================================================================================================
Message_0075:
|1C9D8D| db $05, $4A, $18, $C7, $FF ; やった!␣
|1C9D92| db $FD, $1A ; kanji 剣
|1C9D94| db $15, $07, $39 ; がより
|1C9D97| db $FD, $FB ; kanji 強
|1C9D99| db $0A, $20, $4A, $18 ; くなった
|1C9D9D| db $F8 ; row 2
|1C9D9E| db $FD, $BF ; kanji 体
|1C9DA0| db $24 ; の
|1C9DA1| db $FD, $AE ; kanji 中
|1C9DA3| db $08, $38, $FF ; から␣
|1C9DA6| db $FD, $99 ; kanji 力
|1C9DA8| db $15 ; が
|1C9DA9| db $F9 ; row 3
|1C9DAA| db $0D, $01, $1B, $0A, $3A ; わいてくる
|1C9DAF| db $FD, $10 ; kanji 様
|1C9DB1| db $2E, $4A, $C7 ; だっ!
|1C9DB4| db $FB ; end of message

;===================================================================================================
; Mirror shield get (also mistakenly on fire shield)
;===================================================================================================
; カガミの盾を みつけたぞっ!
; 今までの盾では,はねかえせな
; かったビームもはねかえすぞ!
;===================================================================================================
Message_0076:
|1C9DB5| db $58, $65, $81, $24 ; カガミの
|1C9DB9| db $FD, $1B ; kanji 盾
|1C9DBB| db $0E, $FF, $31, $1A, $0B, $18, $2D, $4A ; を␣みつけたぞっ
|1C9DC3| db $C7 ; !
|1C9DC4| db $F8 ; row 2
|1C9DC5| db $FD, $6A ; kanji 今
|1C9DC7| db $30, $36, $24 ; までの
|1C9DCA| db $FD, $1B ; kanji 盾
|1C9DCC| db $36, $28, $C8, $28, $23, $08, $03, $13 ; では,はねかえせ
|1C9DD4| db $20 ; な
|1C9DD5| db $F9 ; row 3
|1C9DD6| db $08, $4A, $18, $8E, $C9, $82, $34, $28 ; かったビームもは
|1C9DDE| db $23, $08, $03, $12, $2D, $C7 ; ねかえすぞ!
|1C9DE4| db $FB ; end of message

;===================================================================================================
; Cane of Byrna get
;===================================================================================================
; バイラのつえを 手に入れた!
; ひとふりすれば,ヒカリのオビ
; が,みを守ってくれるぞ。
;===================================================================================================
Message_0077:
|1C9DE5| db $8D, $51, $88, $24, $1A, $03, $0E, $FF ; バイラのつえを␣
|1C9DED| db $FD, $3E ; kanji 手
|1C9DEF| db $21 ; に
|1C9DF0| db $FD, $49 ; kanji 入
|1C9DF2| db $3B, $18, $C7 ; れた!
|1C9DF5| db $F8 ; row 2
|1C9DF6| db $29, $1C, $2A, $39, $12, $3B, $3D, $C8 ; ひとふりすれば,
|1C9DFE| db $79, $58, $89, $24, $54, $8E ; ヒカリのオビ
|1C9E04| db $F9 ; row 3
|1C9E05| db $15, $C8, $31, $0E ; が,みを
|1C9E09| db $FD, $91 ; kanji 守
|1C9E0B| db $4A, $1B, $0A, $3B, $3A, $2D, $CD ; ってくれるぞ。
|1C9E12| db $FB ; end of message

;===================================================================================================
; Missing big key
;===================================================================================================
; ムムッ,カギがかかっている。
; 大きなカギがあれば,開けられ
; そうだ!
;===================================================================================================
Message_0078:
|1C9E13| db $82, $82, $9A, $C8, $58, $66, $15, $08 ; ムムッ,カギがか
|1C9E1B| db $08, $4A, $1B, $01, $3A, $CD ; かっている。
|1C9E21| db $F8 ; row 2
|1C9E22| db $FD, $5F ; kanji 大
|1C9E24| db $09, $20, $58, $66, $15, $00, $3B, $3D ; きなカギがあれば
|1C9E2C| db $C8 ; ,
|1C9E2D| db $FD, $4B ; kanji 開
|1C9E2F| db $0B, $38, $3B ; けられ
|1C9E32| db $F9 ; row 3
|1C9E33| db $14, $02, $2E, $C7 ; そうだ!
|1C9E37| db $FB ; end of message

;===================================================================================================
; Not enough magic warning
;===================================================================================================
; あっ魔法の力が足りない!
; このままでは,このアイテムは
; 使えないぞ!
;===================================================================================================
Message_0079:
|1C9E38| db $00, $4A ; あっ
|1C9E3A| db $FD, $2D ; kanji 魔
|1C9E3C| db $FD, $3C ; kanji 法
|1C9E3E| db $24 ; の
|1C9E3F| db $FD, $99 ; kanji 力
|1C9E41| db $15 ; が
|1C9E42| db $FD, $96 ; kanji 足
|1C9E44| db $39, $20, $01, $C7 ; りない!
|1C9E48| db $F8 ; row 2
|1C9E49| db $0C, $24, $30, $30, $36, $28, $C8, $0C ; このままでは,こ
|1C9E51| db $24, $50, $51, $6B, $82, $28 ; のアイテムは
|1C9E57| db $F9 ; row 3
|1C9E58| db $FD, $89 ; kanji 使
|1C9E5A| db $03, $20, $01, $2D, $C7 ; えないぞ!
|1C9E5F| db $FB ; end of message

;===================================================================================================
; Pegasus boots get
;===================================================================================================
; ペガサスのくつを もらった。
; Aボタンをー定時間押し続ける
; と,ダッシュで体当たりできる
;===================================================================================================
Message_007A:
|1C9E60| db $FE, $6D, $01 ; position: low
|1C9E63| db $95, $65, $60, $62, $24, $0A, $1A, $0E ; ペガサスのくつを
|1C9E6B| db $FF, $34, $38, $4A, $18, $CD ; ␣もらった。
|1C9E71| db $F8 ; row 2
|1C9E72| db $AA, $91, $68, $5F, $0E, $C9 ; Aボタンをー
|1C9E78| db $FD, $84 ; kanji 定
|1C9E7A| db $FD, $88 ; kanji 時
|1C9E7C| db $FD, $39 ; kanji 間
|1C9E7E| db $FD, $77 ; kanji 押
|1C9E80| db $11 ; し
|1C9E81| db $FD, $82 ; kanji 続
|1C9E83| db $0B, $3A ; ける
|1C9E85| db $F9 ; row 3
|1C9E86| db $1C, $C8, $7E, $9A, $61, $98, $36 ; と,ダッシュで
|1C9E8D| db $FD, $BF ; kanji 体
|1C9E8F| db $FD, $25 ; kanji 当
|1C9E91| db $18, $39, $36, $09, $3A ; たりできる
|1C9E96| db $FB ; end of message

;===================================================================================================
; Talking tree generic message A
;===================================================================================================
; いやぁ,びっくりしたなもう〜
; へえー,まともな人に会うのは
; 何百年ぶりかねえ。
; まあまあ,ちょっとおしゃべり
; させてくれよ。 あんた,こん
; な話を知ってるかい⋯。
;===================================================================================================
Message_007B:
|1C9E97| db $01, $05, $4B, $C8, $3E, $4A, $0A, $39 ; いやぁ,びっくり
|1C9E9F| db $11, $18, $20, $34, $02, $CE ; したなもう〜
|1C9EA5| db $F8 ; row 2
|1C9EA6| db $2B, $03, $C9, $C8, $30, $1C, $34, $20 ; へえー,まともな
|1C9EAE| db $FD, $38 ; kanji 人
|1C9EB0| db $21 ; に
|1C9EB1| db $FD, $04 ; kanji 会
|1C9EB3| db $02, $24, $28 ; うのは
|1C9EB6| db $F9 ; row 3
|1C9EB7| db $FD, $8B ; kanji 何
|1C9EB9| db $FD, $C7 ; kanji 百
|1C9EBB| db $FD, $A1 ; kanji 年
|1C9EBD| db $3F, $39, $08, $23, $03, $CD ; ぶりかねえ。
|1C9EC3| db $FA ; wait for key
|1C9EC4| db $F6 ; scroll
|1C9EC5| db $30, $00, $30, $00, $C8, $19, $49, $4A ; まあまあ,ちょっ
|1C9ECD| db $1C, $04, $11, $47, $40, $39 ; とおしゃべり
|1C9ED3| db $F6 ; scroll
|1C9ED4| db $10, $13, $1B, $0A, $3B, $07, $CD, $FF ; させてくれよ。␣
|1C9EDC| db $00, $0F, $18, $C8, $0C, $0F ; あんた,こん
|1C9EE2| db $F6 ; scroll
|1C9EE3| db $20 ; な
|1C9EE4| db $FD, $A3 ; kanji 話
|1C9EE6| db $0E ; を
|1C9EE7| db $FD, $93 ; kanji 知
|1C9EE9| db $4A, $1B, $3A, $08, $01, $CC, $CD ; ってるかい⋯。
|1C9EF0| db $FB ; end of message

;===================================================================================================
; Talking tree Village of Outcasts hint
;===================================================================================================
; この村にあるガーゴイルの
; せきぞう。あの下から,女の子
; の助けを求める声が,
; きこえてくるってうわさだよ。
; なんだか,あやしげな話だと
; 思わないか⋯。
;===================================================================================================
Message_007C:
|1C9EF1| db $0C, $24 ; この
|1C9EF3| db $FD, $8C ; kanji 村
|1C9EF5| db $21, $00, $3A, $65, $C9, $6E, $51, $8A ; にあるガーゴイル
|1C9EFD| db $24 ; の
|1C9EFE| db $F8 ; row 2
|1C9EFF| db $13, $09, $2D, $02, $CD, $00, $24 ; せきぞう。あの
|1C9F06| db $FD, $61 ; kanji 下
|1C9F08| db $08, $38, $C8 ; から,
|1C9F0B| db $FD, $15 ; kanji 女
|1C9F0D| db $24 ; の
|1C9F0E| db $FD, $11 ; kanji 子
|1C9F10| db $F9 ; row 3
|1C9F11| db $24 ; の
|1C9F12| db $FD, $CA ; kanji 助
|1C9F14| db $0B, $0E ; けを
|1C9F16| db $FD, $9B ; kanji 求
|1C9F18| db $33, $3A ; める
|1C9F1A| db $FD, $60 ; kanji 声
|1C9F1C| db $15, $C8 ; が,
|1C9F1E| db $FA ; wait for key
|1C9F1F| db $F6 ; scroll
|1C9F20| db $09, $0C, $03, $1B, $0A, $3A, $4A, $1B ; きこえてくるって
|1C9F28| db $02, $0D, $10, $2E, $07, $CD ; うわさだよ。
|1C9F2E| db $F6 ; scroll
|1C9F2F| db $20, $0F, $2E, $08, $C8, $00, $05, $11 ; なんだか,あやし
|1C9F37| db $1D, $20 ; げな
|1C9F39| db $FD, $A3 ; kanji 話
|1C9F3B| db $2E, $1C ; だと
|1C9F3D| db $F6 ; scroll
|1C9F3E| db $FD, $36 ; kanji 思
|1C9F40| db $0D, $20, $01, $08, $CC, $CD ; わないか⋯。
|1C9F46| db $FB ; end of message

;===================================================================================================
; Talking tree river peninsula hint
;===================================================================================================
; なんでも,ガノンの願いをかな
; えるために,トライフォースが
; あたえたのがこの世界らしいぞ
; ガノンの願い?それは全世界の
; 王になることさ。闇世界の魔力
; があればできるんじゃないか?
;===================================================================================================
Message_007D:
|1C9F47| db $20, $0F, $36, $34, $C8, $65, $74, $5F ; なんでも,ガノン
|1C9F4F| db $24 ; の
|1C9F50| db $FD, $0A ; kanji 願
|1C9F52| db $01, $0E, $08, $20 ; いをかな
|1C9F56| db $F8 ; row 2
|1C9F57| db $03, $3A, $18, $33, $21, $C8, $6C, $88 ; えるために,トラ
|1C9F5F| db $51, $7A, $9F, $C9, $62, $15 ; イフォースが
|1C9F65| db $F9 ; row 3
|1C9F66| db $00, $18, $03, $18, $24, $15, $0C, $24 ; あたえたのがこの
|1C9F6E| db $FD, $E8 ; kanji 世
|1C9F70| db $FD, $E9 ; kanji 界
|1C9F72| db $38, $11, $01, $2D ; らしいぞ
|1C9F76| db $FA ; wait for key
|1C9F77| db $F6 ; scroll
|1C9F78| db $65, $74, $5F, $24 ; ガノンの
|1C9F7C| db $FD, $0A ; kanji 願
|1C9F7E| db $01, $C6, $14, $3B, $28 ; い?それは
|1C9F83| db $FD, $BE ; kanji 全
|1C9F85| db $FD, $E8 ; kanji 世
|1C9F87| db $FD, $E9 ; kanji 界
|1C9F89| db $24 ; の
|1C9F8A| db $F6 ; scroll
|1C9F8B| db $FD, $44 ; kanji 王
|1C9F8D| db $21, $20, $3A, $0C, $1C, $10, $CD ; になることさ。
|1C9F94| db $FD, $57 ; kanji 闇
|1C9F96| db $FD, $E8 ; kanji 世
|1C9F98| db $FD, $E9 ; kanji 界
|1C9F9A| db $24 ; の
|1C9F9B| db $FD, $2D ; kanji 魔
|1C9F9D| db $FD, $99 ; kanji 力
|1C9F9F| db $F6 ; scroll
|1C9FA0| db $15, $00, $3B, $3D, $36, $09, $3A, $0F ; があればできるん
|1C9FA8| db $25, $47, $20, $01, $08, $C6 ; じゃないか?
|1C9FAE| db $FB ; end of message

;===================================================================================================
; Talking tree grove entrance hint
;===================================================================================================
; オレは,もともと光世界のまよ
; いの森にいたんだがな。それが
; 魔法陣に迷いこんでしまって⋯
; 気がついたら闇世界のドクロの
; 森に来ていたんだ。2つの森は
; つながっているんだろうな。
;===================================================================================================
Message_007E:
|1C9FAF| db $54, $8B, $28, $C8, $34, $1C, $34, $1C ; オレは,もともと
|1C9FB7| db $FD, $73 ; kanji 光
|1C9FB9| db $FD, $E8 ; kanji 世
|1C9FBB| db $FD, $E9 ; kanji 界
|1C9FBD| db $24, $30, $07 ; のまよ
|1C9FC0| db $F8 ; row 2
|1C9FC1| db $01, $24 ; いの
|1C9FC3| db $FD, $65 ; kanji 森
|1C9FC5| db $21, $01, $18, $0F, $2E, $15, $20, $CD ; にいたんだがな。
|1C9FCD| db $14, $3B, $15 ; それが
|1C9FD0| db $F9 ; row 3
|1C9FD1| db $FD, $2D ; kanji 魔
|1C9FD3| db $FD, $3C ; kanji 法
|1C9FD5| db $FD, $C5 ; kanji 陣
|1C9FD7| db $21 ; に
|1C9FD8| db $FD, $70 ; kanji 迷
|1C9FDA| db $01, $0C, $0F, $36, $11, $30, $4A, $1B ; いこんでしまって
|1C9FE2| db $CC ; ⋯
|1C9FE3| db $FA ; wait for key
|1C9FE4| db $F6 ; scroll
|1C9FE5| db $FD, $37 ; kanji 気
|1C9FE7| db $15, $1A, $01, $18, $38 ; がついたら
|1C9FEC| db $FD, $57 ; kanji 闇
|1C9FEE| db $FD, $E8 ; kanji 世
|1C9FF0| db $FD, $E9 ; kanji 界
|1C9FF2| db $24, $87, $5A, $8C, $24 ; のドクロの
|1C9FF7| db $F6 ; scroll
|1C9FF8| db $FD, $65 ; kanji 森
|1C9FFA| db $21 ; に
|1C9FFB| db $FD, $D6 ; kanji 来
|1C9FFD| db $1B, $01, $18, $0F, $2E, $CD, $A2, $1A ; ていたんだ。2つ
|1CA005| db $24 ; の
|1CA006| db $FD, $65 ; kanji 森
|1CA008| db $28 ; は
|1CA009| db $F6 ; scroll
|1CA00A| db $1A, $20, $15, $4A, $1B, $01, $3A, $0F ; つながっているん
|1CA012| db $2E, $3C, $02, $20, $CD ; だろうな。
|1CA017| db $FB ; end of message

;===================================================================================================
; Talking tree west of Bomb Shop hint
;===================================================================================================
; なんでも,1つ目のきょじん
; ヒノックスは,バクダンで,
; やっつけると良いらしいよ。
; まあ,それだけの話だ。
;===================================================================================================
Message_007F:
|1CA018| db $20, $0F, $36, $34, $C8, $A1, $1A ; なんでも,1つ
|1CA01F| db $FD, $75 ; kanji 目
|1CA021| db $24, $09, $49, $25, $0F ; のきょじん
|1CA026| db $F8 ; row 2
|1CA027| db $79, $74, $9A, $5A, $62, $28, $C8, $8D ; ヒノックスは,バ
|1CA02F| db $5A, $7E, $5F, $36, $C8 ; クダンで,
|1CA034| db $F9 ; row 3
|1CA035| db $05, $4A, $1A, $0B, $3A, $1C ; やっつけると
|1CA03B| db $FD, $32 ; kanji 良
|1CA03D| db $01, $38, $11, $01, $07, $CD ; いらしいよ。
|1CA043| db $FA ; wait for key
|1CA044| db $F6 ; scroll
|1CA045| db $30, $00, $C8, $14, $3B, $2E, $0B, $24 ; まあ,それだけの
|1CA04D| db $FD, $A3 ; kanji 話
|1CA04F| db $2E, $CD ; だ。
|1CA051| db $F6 ; scroll
|1CA052| db $F6 ; scroll
|1CA053| db $FB ; end of message

;===================================================================================================
; Talking tree generic message B
;===================================================================================================
; きにさわる事を
; するんじゃねえ!
;===================================================================================================
Message_0080:
|1CA054| db $09, $21, $10, $0D, $3A ; きにさわる
|1CA059| db $FD, $22 ; kanji 事
|1CA05B| db $0E ; を
|1CA05C| db $F8 ; row 2
|1CA05D| db $12, $3A, $0F, $25, $47, $23, $03, $C7 ; するんじゃねえ!
|1CA065| db $FB ; end of message

;===================================================================================================
; Blue pendant get when blue is third
;===================================================================================================
; 『力の紋章』を手に入れた!
; やった!3つの紋章がそろった
; マスターソードの森へ向おう!
;===================================================================================================
Message_0081:
|1CA066| db $C4 ; 『
|1CA067| db $FD, $99 ; kanji 力
|1CA069| db $24 ; の
|1CA06A| db $FD, $53 ; kanji 紋
|1CA06C| db $FD, $54 ; kanji 章
|1CA06E| db $C5, $0E ; 』を
|1CA070| db $FD, $3E ; kanji 手
|1CA072| db $21 ; に
|1CA073| db $FD, $49 ; kanji 入
|1CA075| db $3B, $18, $C7 ; れた!
|1CA078| db $F8 ; row 2
|1CA079| db $05, $4A, $18, $C7, $A3, $1A, $24 ; やった!3つの
|1CA080| db $FD, $53 ; kanji 紋
|1CA082| db $FD, $54 ; kanji 章
|1CA084| db $15, $14, $3C, $4A, $18 ; がそろった
|1CA089| db $F9 ; row 3
|1CA08A| db $80, $62, $68, $C9, $64, $C9, $87, $24 ; マスターソードの
|1CA092| db $FD, $65 ; kanji 森
|1CA094| db $2B ; へ
|1CA095| db $FD, $86 ; kanji 向
|1CA097| db $04, $02, $C7 ; おう!
|1CA09A| db $FB ; end of message

;===================================================================================================
; Red pendant get when red is second
;===================================================================================================
; 『知恵の紋章』を手に入れた!
; またひとつ,強くなったぞ!
; さあ,さいごの紋章へ向おう!
;===================================================================================================
Message_0082:
|1CA09B| db $C4 ; 『
|1CA09C| db $FD, $93 ; kanji 知
|1CA09E| db $FD, $41 ; kanji 恵
|1CA0A0| db $24 ; の
|1CA0A1| db $FD, $53 ; kanji 紋
|1CA0A3| db $FD, $54 ; kanji 章
|1CA0A5| db $C5, $0E ; 』を
|1CA0A7| db $FD, $3E ; kanji 手
|1CA0A9| db $21 ; に
|1CA0AA| db $FD, $49 ; kanji 入
|1CA0AC| db $3B, $18, $C7 ; れた!
|1CA0AF| db $F8 ; row 2
|1CA0B0| db $30, $18, $29, $1C, $1A, $C8 ; またひとつ,
|1CA0B6| db $FD, $FB ; kanji 強
|1CA0B8| db $0A, $20, $4A, $18, $2D, $C7 ; くなったぞ!
|1CA0BE| db $F9 ; row 3
|1CA0BF| db $10, $00, $C8, $10, $01, $1E, $24 ; さあ,さいごの
|1CA0C6| db $FD, $53 ; kanji 紋
|1CA0C8| db $FD, $54 ; kanji 章
|1CA0CA| db $2B ; へ
|1CA0CB| db $FD, $86 ; kanji 向
|1CA0CD| db $04, $02, $C7 ; おう!
|1CA0D0| db $FB ; end of message

;===================================================================================================
; Archery game host introduction
;===================================================================================================
; はーい,マトアテ屋でござ〜い
; 20ルピーで,矢が5本⋯
; 続けて当てれば大もうけ!
; ちょっとニイさんどないです?
; ▶ あそぶ
;   帰 る
;===================================================================================================
Message_0083:
|1CA0D1| db $28, $C9, $01, $C8, $80, $6C, $50, $6B ; はーい,マトアテ
|1CA0D9| db $FD, $3D ; kanji 屋
|1CA0DB| db $36, $1E, $1F, $CE, $01 ; でござ〜い
|1CA0E0| db $F8 ; row 2
|1CA0E1| db $A2, $A0, $8A, $93, $C9, $36, $C8 ; 20ルピーで,
|1CA0E8| db $FD, $BB ; kanji 矢
|1CA0EA| db $15, $A5 ; が5
|1CA0EC| db $FD, $24 ; kanji 本
|1CA0EE| db $CC ; ⋯
|1CA0EF| db $F9 ; row 3
|1CA0F0| db $FD, $82 ; kanji 続
|1CA0F2| db $0B, $1B ; けて
|1CA0F4| db $FD, $25 ; kanji 当
|1CA0F6| db $1B, $3B, $3D ; てれば
|1CA0F9| db $FD, $5F ; kanji 大
|1CA0FB| db $34, $02, $0B, $C7 ; もうけ!
|1CA0FF| db $FA ; wait for key
|1CA100| db $F6 ; scroll
|1CA101| db $19, $49, $4A, $1C, $71, $51, $10, $0F ; ちょっとニイさん
|1CA109| db $37, $20, $01, $36, $12, $C6 ; どないです?
|1CA10F| db $F6 ; scroll
|1CA110| db $FF, $FF, $E4, $FF, $00, $14, $3F ; ␣␣▶␣あそぶ
|1CA117| db $F6 ; scroll
|1CA118| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CA11C| db $FD, $D7 ; kanji 帰
|1CA11E| db $FF, $3A ; ␣る
|1CA120| db $FE, $68 ; choose 2 low
|1CA122| db $FB ; end of message

;===================================================================================================
; Archery game host game start
;===================================================================================================
; では,よ〜くねらって
; はい! どうぞ〜!
;===================================================================================================
Message_0084:
|1CA123| db $36, $28, $C8, $07, $CE, $0A, $23, $38 ; では,よ〜くねら
|1CA12B| db $4A, $1B ; って
|1CA12D| db $F8 ; row 2
|1CA12E| db $28, $01, $C7, $FF, $37, $02, $2D, $CE ; はい!␣どうぞ〜
|1CA136| db $C7 ; !
|1CA137| db $FB ; end of message

;===================================================================================================
; Archery game host go away
;===================================================================================================
; では,お帰りは,もと来た方へ
; まっすぐに〜!
; ごきげんよう さようなら〜!
;===================================================================================================
Message_0085:
|1CA138| db $36, $28, $C8, $04 ; では,お
|1CA13C| db $FD, $D7 ; kanji 帰
|1CA13E| db $39, $28, $C8, $34, $1C ; りは,もと
|1CA143| db $FD, $D6 ; kanji 来
|1CA145| db $18 ; た
|1CA146| db $FD, $20 ; kanji 方
|1CA148| db $2B ; へ
|1CA149| db $F8 ; row 2
|1CA14A| db $30, $4A, $12, $17, $21, $CE, $C7 ; まっすぐに〜!
|1CA151| db $F9 ; row 3
|1CA152| db $1E, $09, $1D, $0F, $07, $02, $FF, $10 ; ごきげんよう␣さ
|1CA15A| db $07, $02, $20, $38, $CE, $C7 ; ようなら〜!
|1CA160| db $FB ; end of message

;===================================================================================================
; Archery game host try again?
;===================================================================================================
; さて,ニイさん続けまっか?
; ▶ 続ける
;   もうやめる
;===================================================================================================
Message_0086:
|1CA161| db $10, $1B, $C8, $71, $51, $10, $0F ; さて,ニイさん
|1CA168| db $FD, $82 ; kanji 続
|1CA16A| db $0B, $30, $4A, $08, $C6 ; けまっか?
|1CA16F| db $F8 ; row 2
|1CA170| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CA174| db $FD, $82 ; kanji 続
|1CA176| db $0B, $3A ; ける
|1CA178| db $F9 ; row 3
|1CA179| db $FF, $FF, $FF, $FF, $34, $02, $05, $33 ; ␣␣␣␣もうやめ
|1CA181| db $3A ; る
|1CA182| db $FE, $68 ; choose 2 low
|1CA184| db $FB ; end of message

;===================================================================================================
; Pond of Happiness throw rupees?
;===================================================================================================
; ーしあわせのいずみー
; ルピーを投げると,のぞみが
; かないます。
; ルピーを投げますか?
; ▶ 投げる
;   やめておく
;===================================================================================================
Message_0087:
|1CA185| db $FF, $FF, $C9, $11, $00, $0D, $13, $24 ; ␣␣ーしあわせの
|1CA18D| db $01, $26, $31, $C9 ; いずみー
|1CA191| db $F8 ; row 2
|1CA192| db $8A, $93, $C9, $0E ; ルピーを
|1CA196| db $FD, $FC ; kanji 投
|1CA198| db $1D, $3A, $1C, $C8, $24, $2D, $31, $15 ; げると,のぞみが
|1CA1A0| db $F9 ; row 3
|1CA1A1| db $08, $20, $01, $30, $12, $CD ; かないます。
|1CA1A7| db $FA ; wait for key
|1CA1A8| db $F6 ; scroll
|1CA1A9| db $8A, $93, $C9, $0E ; ルピーを
|1CA1AD| db $FD, $FC ; kanji 投
|1CA1AF| db $1D, $30, $12, $08, $C6 ; げますか?
|1CA1B4| db $F6 ; scroll
|1CA1B5| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CA1B9| db $FD, $FC ; kanji 投
|1CA1BB| db $1D, $3A ; げる
|1CA1BD| db $F6 ; scroll
|1CA1BE| db $FF, $FF, $FF, $FF, $05, $33, $1B, $04 ; ␣␣␣␣やめてお
|1CA1C6| db $0A ; く
|1CA1C7| db $FE, $68 ; choose 2 low
|1CA1C9| db $FB ; end of message

;===================================================================================================
; Item pond choose item
;===================================================================================================
; 十字キーで,選んで
; Yボタンで投げます。
;===================================================================================================
Message_0088:
|1CA1CA| db $FD, $7A ; kanji 十
|1CA1CC| db $FD, $7B ; kanji 字
|1CA1CE| db $59, $C9, $36, $C8 ; キーで,
|1CA1D2| db $FD, $81 ; kanji 選
|1CA1D4| db $0F, $36 ; んで
|1CA1D6| db $F8 ; row 2
|1CA1D7| db $C2, $91, $68, $5F, $36 ; Yボタンで
|1CA1DC| db $FD, $FC ; kanji 投
|1CA1DE| db $1D, $30, $12, $CD ; げます。
|1CA1E2| db $FE, $69 ; choose item
|1CA1E4| db $FB ; end of message

;===================================================================================================
; Pond fairy "is this yours?"
;===================================================================================================
; ねえ,今これをおとしたでしょ
; ▶ う ん
;   ちがう
;===================================================================================================
Message_0089:
|1CA1E5| db $23, $03, $C8 ; ねえ,
|1CA1E8| db $FD, $6A ; kanji 今
|1CA1EA| db $0C, $3B, $0E, $04, $1C, $11, $18, $36 ; これをおとしたで
|1CA1F2| db $11, $49 ; しょ
|1CA1F4| db $F8 ; row 2
|1CA1F5| db $FF, $FF, $E4, $FF, $02, $FF, $0F ; ␣␣▶␣う␣ん
|1CA1FC| db $F9 ; row 3
|1CA1FD| db $FF, $FF, $FF, $FF, $19, $15, $02 ; ␣␣␣␣ちがう
|1CA204| db $FE, $68 ; choose 2 low
|1CA206| db $FB ; end of message

;===================================================================================================
; Pond fairy likes honesty
;===================================================================================================
; 私は,しょうじきな人が好きよ
; だから,あなたには,もっと
; 良い物をプレゼントするね!
;===================================================================================================
Message_008A:
|1CA207| db $FD, $26 ; kanji 私
|1CA209| db $28, $C8, $11, $49, $02, $25, $09, $20 ; は,しょうじきな
|1CA211| db $FD, $38 ; kanji 人
|1CA213| db $15 ; が
|1CA214| db $FD, $6D ; kanji 好
|1CA216| db $09, $07 ; きよ
|1CA218| db $F8 ; row 2
|1CA219| db $2E, $08, $38, $C8, $00, $20, $18, $21 ; だから,あなたに
|1CA221| db $28, $C8, $34, $4A, $1C ; は,もっと
|1CA226| db $F9 ; row 3
|1CA227| db $FD, $32 ; kanji 良
|1CA229| db $01 ; い
|1CA22A| db $FD, $51 ; kanji 物
|1CA22C| db $0E, $94, $8B, $77, $5F, $6C, $12, $3A ; をプレゼントする
|1CA234| db $23, $C7 ; ね!
|1CA236| db $FB ; end of message

;===================================================================================================
; Pond fairy "you sure it's not?"
;===================================================================================================
; 本当に,これじゃないの?
; ▶ 本当にちがう
;   本当はそれ
;===================================================================================================
Message_008B:
|1CA237| db $FD, $24 ; kanji 本
|1CA239| db $FD, $25 ; kanji 当
|1CA23B| db $21, $C8, $0C, $3B, $25, $47, $20, $01 ; に,これじゃない
|1CA243| db $24, $C6 ; の?
|1CA245| db $F8 ; row 2
|1CA246| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CA24A| db $FD, $24 ; kanji 本
|1CA24C| db $FD, $25 ; kanji 当
|1CA24E| db $21, $19, $15, $02 ; にちがう
|1CA252| db $F9 ; row 3
|1CA253| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CA257| db $FD, $24 ; kanji 本
|1CA259| db $FD, $25 ; kanji 当
|1CA25B| db $28, $14, $3B ; はそれ
|1CA25E| db $FE, $68 ; choose 2 low
|1CA260| db $FB ; end of message

;===================================================================================================
; Pond fairy hates liars
;===================================================================================================
; うそついちゃ ダメ ダメ!
; 持って帰りなさい!
;===================================================================================================
Message_008C:
|1CA261| db $02, $14, $1A, $01, $19, $47, $FF, $7E ; うそついちゃ␣ダ
|1CA269| db $83, $FF, $7E, $83, $C7 ; メ␣ダメ!
|1CA26E| db $F8 ; row 2
|1CA26F| db $FD, $DB ; kanji 持
|1CA271| db $4A, $1B ; って
|1CA273| db $FD, $D7 ; kanji 帰
|1CA275| db $39, $20, $10, $01, $C7 ; りなさい!
|1CA27A| db $FB ; end of message

;===================================================================================================
; Red boomerang get
;===================================================================================================
; 魔法のブーメランを手に入れた
; すばやく とおくまでとばせる
; ようになった。
;===================================================================================================
Message_008D:
|1CA27B| db $FD, $2D ; kanji 魔
|1CA27D| db $FD, $3C ; kanji 法
|1CA27F| db $24, $8F, $C9, $83, $88, $5F, $0E ; のブーメランを
|1CA286| db $FD, $3E ; kanji 手
|1CA288| db $21 ; に
|1CA289| db $FD, $49 ; kanji 入
|1CA28B| db $3B, $18 ; れた
|1CA28D| db $F8 ; row 2
|1CA28E| db $12, $3D, $05, $0A, $FF, $1C, $04, $0A ; すばやく␣とおく
|1CA296| db $30, $36, $1C, $3D, $13, $3A ; までとばせる
|1CA29C| db $F9 ; row 3
|1CA29D| db $07, $02, $21, $20, $4A, $18, $CD ; ようになった。
|1CA2A4| db $FB ; end of message

;===================================================================================================
; Fire shield upgrade
;===================================================================================================
; 盾が大きくなった。
; 火の玉くらいなら,へっちゃら
; だぞ!
;===================================================================================================
Message_008E:
|1CA2A5| db $FD, $1B ; kanji 盾
|1CA2A7| db $15 ; が
|1CA2A8| db $FD, $5F ; kanji 大
|1CA2AA| db $09, $0A, $20, $4A, $18, $CD ; きくなった。
|1CA2B0| db $F8 ; row 2
|1CA2B1| db $FD, $CD ; kanji 火
|1CA2B3| db $24 ; の
|1CA2B4| db $FD, $D2 ; kanji 玉
|1CA2B6| db $0A, $38, $01, $20, $38, $C8, $2B, $4A ; くらいなら,へっ
|1CA2BE| db $19, $47, $38 ; ちゃら
|1CA2C1| db $F9 ; row 3
|1CA2C2| db $2E, $2D, $C7 ; だぞ!
|1CA2C5| db $FB ; end of message

;===================================================================================================
; Silver arrows upgrade
;===================================================================================================
; おお,これがガノンにとどめを
; さす『銀の矢』だ!
;===================================================================================================
Message_008F:
|1CA2C6| db $04, $04, $C8, $0C, $3B, $15, $65, $74 ; おお,これがガノ
|1CA2CE| db $5F, $21, $1C, $37, $33, $0E ; ンにとどめを
|1CA2D4| db $F8 ; row 2
|1CA2D5| db $10, $12, $C4 ; さす『
|1CA2D8| db $FD, $DE ; kanji 銀
|1CA2DA| db $24 ; の
|1CA2DB| db $FD, $BB ; kanji 矢
|1CA2DD| db $C5, $2E, $C7 ; 』だ!
|1CA2E0| db $FB ; end of message

;===================================================================================================
; Pond bottle refill
;===================================================================================================
; ビンの中に,魔法のクスリが
; 入った。ちょっと とくをした
;===================================================================================================
Message_0090:
|1CA2E1| db $8E, $5F, $24 ; ビンの
|1CA2E4| db $FD, $AE ; kanji 中
|1CA2E6| db $21, $C8 ; に,
|1CA2E8| db $FD, $2D ; kanji 魔
|1CA2EA| db $FD, $3C ; kanji 法
|1CA2EC| db $24, $5A, $62, $89, $15 ; のクスリが
|1CA2F1| db $F8 ; row 2
|1CA2F2| db $FD, $49 ; kanji 入
|1CA2F4| db $4A, $18, $CD, $19, $49, $4A, $1C, $FF ; った。ちょっと␣
|1CA2FC| db $1C, $0A, $0E, $11, $18 ; とくをした
|1CA301| db $FB ; end of message

;===================================================================================================
; Pond sword upgrade
;===================================================================================================
; 剣がより強くなった。
; なにかあたたかい手ざわりが
; する。
;===================================================================================================
Message_0091:
|1CA302| db $FD, $1A ; kanji 剣
|1CA304| db $15, $07, $39 ; がより
|1CA307| db $FD, $FB ; kanji 強
|1CA309| db $0A, $20, $4A, $18, $CD ; くなった。
|1CA30E| db $F8 ; row 2
|1CA30F| db $20, $21, $08, $00, $18, $18, $08, $01 ; なにかあたたかい
|1CA317| db $FD, $3E ; kanji 手
|1CA319| db $1F, $0D, $39, $15 ; ざわりが
|1CA31D| db $F9 ; row 3
|1CA31E| db $12, $3A, $CD ; する。
|1CA321| db $FB ; end of message

;===================================================================================================
; Pond of Happiness rupee progress
;===================================================================================================
; 幸せが[BCD][BCD]ルピーふえた。
; ぜんぶで[BCD][BCD]になった。
; またひとつ幸せになった。
;===================================================================================================
Message_0092:
|1CA322| db $FD, $4E ; kanji 幸
|1CA324| db $13, $15 ; せが
|1CA326| db $FE, $6C, $03 ; BCD digit 3
|1CA329| db $FE, $6C, $02 ; BCD digit 2
|1CA32C| db $8A, $93, $C9, $2A, $03, $18, $CD ; ルピーふえた。
|1CA333| db $F8 ; row 2
|1CA334| db $27, $0F, $3F, $36 ; ぜんぶで
|1CA338| db $FE, $6C, $01 ; BCD digit 1
|1CA33B| db $FE, $6C, $00 ; BCD digit 0
|1CA33E| db $21, $20, $4A, $18, $CD ; になった。
|1CA343| db $F9 ; row 3
|1CA344| db $30, $18, $29, $1C, $1A ; またひとつ
|1CA349| db $FD, $4E ; kanji 幸
|1CA34B| db $13, $21, $20, $4A, $18, $CD ; せになった。
|1CA351| db $FB ; end of message

;===================================================================================================
; Pond of Happiness pick capacity upgrade
;===================================================================================================
; あなたののぞみをかなえましょ
; ▶バクダンもっと持ちたい
;   矢をもっと持ちたい
;===================================================================================================
Message_0093:
|1CA352| db $00, $20, $18, $24, $24, $2D, $31, $0E ; あなたののぞみを
|1CA35A| db $08, $20, $03, $30, $11, $49 ; かなえましょ
|1CA360| db $F8 ; row 2
|1CA361| db $FF, $FF, $E4, $8D, $5A, $7E, $5F, $34 ; ␣␣▶バクダンも
|1CA369| db $4A, $1C ; っと
|1CA36B| db $FD, $DB ; kanji 持
|1CA36D| db $19, $18, $01 ; ちたい
|1CA370| db $F9 ; row 3
|1CA371| db $FF, $FF, $FF ; ␣␣␣
|1CA374| db $FD, $BB ; kanji 矢
|1CA376| db $0E, $34, $4A, $1C ; をもっと
|1CA37A| db $FD, $DB ; kanji 持
|1CA37C| db $19, $18, $01 ; ちたい
|1CA37F| db $FE, $68 ; choose 2 low
|1CA381| db $FB ; end of message

;===================================================================================================
; Pond of Happiness bomb capacity upgrade
;===================================================================================================
; では,バクダンを[BCD][BCD]コ持てる
; ようにしましょう。
; 私があげられる小さな幸せです
;===================================================================================================
Message_0094:
|1CA382| db $36, $28, $C8, $8D, $5A, $7E, $5F, $0E ; では,バクダンを
|1CA38A| db $FE, $6C, $01 ; BCD digit 1
|1CA38D| db $FE, $6C, $00 ; BCD digit 0
|1CA390| db $5C ; コ
|1CA391| db $FD, $DB ; kanji 持
|1CA393| db $1B, $3A ; てる
|1CA395| db $F8 ; row 2
|1CA396| db $07, $02, $21, $11, $30, $11, $49, $02 ; ようにしましょう
|1CA39E| db $CD ; 。
|1CA39F| db $F9 ; row 3
|1CA3A0| db $FD, $26 ; kanji 私
|1CA3A2| db $15, $00, $1D, $38, $3B, $3A ; があげられる
|1CA3A8| db $FD, $FA ; kanji 小
|1CA3AA| db $10, $20 ; さな
|1CA3AC| db $FD, $4E ; kanji 幸
|1CA3AE| db $13, $36, $12 ; せです
|1CA3B1| db $FB ; end of message

;===================================================================================================
; Pond of Happiness arrow capacity upgrade
;===================================================================================================
; では,矢を[BCD][BCD]本持てるように
; しましょう。
; 私があげられる小さな幸せです
;===================================================================================================
Message_0095:
|1CA3B2| db $36, $28, $C8 ; では,
|1CA3B5| db $FD, $BB ; kanji 矢
|1CA3B7| db $0E ; を
|1CA3B8| db $FE, $6C, $01 ; BCD digit 1
|1CA3BB| db $FE, $6C, $00 ; BCD digit 0
|1CA3BE| db $FD, $24 ; kanji 本
|1CA3C0| db $FD, $DB ; kanji 持
|1CA3C2| db $1B, $3A, $07, $02, $21 ; てるように
|1CA3C7| db $F8 ; row 2
|1CA3C8| db $11, $30, $11, $49, $02, $CD ; しましょう。
|1CA3CE| db $F9 ; row 3
|1CA3CF| db $FD, $26 ; kanji 私
|1CA3D1| db $15, $00, $1D, $38, $3B, $3A ; があげられる
|1CA3D7| db $FD, $FA ; kanji 小
|1CA3D9| db $10, $20 ; さな
|1CA3DB| db $FD, $4E ; kanji 幸
|1CA3DD| db $13, $36, $12 ; せです
|1CA3E0| db $FB ; end of message

;===================================================================================================
; Pond of Happiness maxed out rupees
;===================================================================================================
; 悪いけど,これいじょうあなた
; の力になれないわ⋯。
; ごめんなさい。
; かわりに,私のともだちをしょ
; うかいするわ。 願いのタキに
; いるカワイイ子よ!
; ルピーは,おかえしします。
; あなたが,幸せでありますよう
; に⋯。
;===================================================================================================
Message_0096:
|1CA3E1| db $FD, $85 ; kanji 悪
|1CA3E3| db $01, $0B, $37, $C8, $0C, $3B, $01, $25 ; いけど,これいじ
|1CA3EB| db $49, $02, $00, $20, $18 ; ょうあなた
|1CA3F0| db $F8 ; row 2
|1CA3F1| db $24 ; の
|1CA3F2| db $FD, $99 ; kanji 力
|1CA3F4| db $21, $20, $3B, $20, $01, $0D, $CC, $CD ; になれないわ⋯。
|1CA3FC| db $F9 ; row 3
|1CA3FD| db $1E, $33, $0F, $20, $10, $01, $CD ; ごめんなさい。
|1CA404| db $FA ; wait for key
|1CA405| db $F6 ; scroll
|1CA406| db $08, $0D, $39, $21, $C8 ; かわりに,
|1CA40B| db $FD, $26 ; kanji 私
|1CA40D| db $24, $1C, $34, $2E, $19, $0E, $11, $49 ; のともだちをしょ
|1CA415| db $F6 ; scroll
|1CA416| db $02, $08, $01, $12, $3A, $0D, $CD, $FF ; うかいするわ。␣
|1CA41E| db $FD, $0A ; kanji 願
|1CA420| db $01, $24, $68, $59, $21 ; いのタキに
|1CA425| db $F6 ; scroll
|1CA426| db $01, $3A, $58, $5D, $51, $51 ; いるカワイイ
|1CA42C| db $FD, $11 ; kanji 子
|1CA42E| db $07, $C7 ; よ!
|1CA430| db $FA ; wait for key
|1CA431| db $F6 ; scroll
|1CA432| db $8A, $93, $C9, $28, $C8, $04, $08, $03 ; ルピーは,おかえ
|1CA43A| db $11, $11, $30, $12, $CD ; しします。
|1CA43F| db $F6 ; scroll
|1CA440| db $00, $20, $18, $15, $C8 ; あなたが,
|1CA445| db $FD, $4E ; kanji 幸
|1CA447| db $13, $36, $00, $39, $30, $12, $07, $02 ; せでありますよう
|1CA44F| db $F6 ; scroll
|1CA450| db $21, $CC, $CD ; に⋯。
|1CA453| db $FB ; end of message

;===================================================================================================
; Old man near pit
;===================================================================================================
; あぁ 足もとに気を付けなされ
; 穴が開いておるでな。
; そこを右へ行ってくださらんか
; お若いの,あんたもやっぱり
; 『黄金の力』を求めて 山へ
; 行かれるのか?
; この先は魔物の山じゃ。
; たくさんの男達が『黄金の力』
; を求め この山で消えていった
; 悪いことは言わん。あんたも
; 深入りせんことじゃて⋯。
;===================================================================================================
Message_0097:
|1CA454| db $00, $4B, $FF ; あぁ␣
|1CA457| db $FD, $96 ; kanji 足
|1CA459| db $34, $1C, $21 ; もとに
|1CA45C| db $FD, $37 ; kanji 気
|1CA45E| db $0E ; を
|1CA45F| db $FD, $52 ; kanji 付
|1CA461| db $0B, $20, $10, $3B ; けなされ
|1CA465| db $F8 ; row 2
|1CA466| db $FD, $5C ; kanji 穴
|1CA468| db $15 ; が
|1CA469| db $FD, $4B ; kanji 開
|1CA46B| db $01, $1B, $04, $3A, $36, $20, $CD ; いておるでな。
|1CA472| db $F9 ; row 3
|1CA473| db $14, $0C, $0E ; そこを
|1CA476| db $FD, $B1 ; kanji 右
|1CA478| db $2B ; へ
|1CA479| db $FD, $02 ; kanji 行
|1CA47B| db $4A, $1B, $0A, $2E, $10, $38, $0F, $08 ; ってくださらんか
|1CA483| db $FA ; wait for key
|1CA484| db $F6 ; scroll
|1CA485| db $04 ; お
|1CA486| db $FD, $67 ; kanji 若
|1CA488| db $01, $24, $C8, $00, $0F, $18, $34, $05 ; いの,あんたもや
|1CA490| db $4A, $42, $39 ; っぱり
|1CA493| db $F6 ; scroll
|1CA494| db $C4 ; 『
|1CA495| db $FD, $98 ; kanji 黄
|1CA497| db $FD, $43 ; kanji 金
|1CA499| db $24 ; の
|1CA49A| db $FD, $99 ; kanji 力
|1CA49C| db $C5, $0E ; 』を
|1CA49E| db $FD, $9B ; kanji 求
|1CA4A0| db $33, $1B, $FF ; めて␣
|1CA4A3| db $FD, $94 ; kanji 山
|1CA4A5| db $2B ; へ
|1CA4A6| db $F6 ; scroll
|1CA4A7| db $FD, $02 ; kanji 行
|1CA4A9| db $08, $3B, $3A, $24, $08, $C6 ; かれるのか?
|1CA4AF| db $FA ; wait for key
|1CA4B0| db $F6 ; scroll
|1CA4B1| db $0C, $24 ; この
|1CA4B3| db $FD, $9C ; kanji 先
|1CA4B5| db $28 ; は
|1CA4B6| db $FD, $2D ; kanji 魔
|1CA4B8| db $FD, $51 ; kanji 物
|1CA4BA| db $24 ; の
|1CA4BB| db $FD, $94 ; kanji 山
|1CA4BD| db $25, $47, $CD ; じゃ。
|1CA4C0| db $F6 ; scroll
|1CA4C1| db $18, $0A, $10, $0F, $24 ; たくさんの
|1CA4C6| db $FD, $5E ; kanji 男
|1CA4C8| db $FD, $13 ; kanji 達
|1CA4CA| db $15, $C4 ; が『
|1CA4CC| db $FD, $98 ; kanji 黄
|1CA4CE| db $FD, $43 ; kanji 金
|1CA4D0| db $24 ; の
|1CA4D1| db $FD, $99 ; kanji 力
|1CA4D3| db $C5 ; 』
|1CA4D4| db $F6 ; scroll
|1CA4D5| db $0E ; を
|1CA4D6| db $FD, $9B ; kanji 求
|1CA4D8| db $33, $FF, $0C, $24 ; め␣この
|1CA4DC| db $FD, $94 ; kanji 山
|1CA4DE| db $36 ; で
|1CA4DF| db $FD, $9D ; kanji 消
|1CA4E1| db $03, $1B, $01, $4A, $18 ; えていった
|1CA4E6| db $FA ; wait for key
|1CA4E7| db $F6 ; scroll
|1CA4E8| db $F6 ; scroll
|1CA4E9| db $FD, $85 ; kanji 悪
|1CA4EB| db $01, $0C, $1C, $28 ; いことは
|1CA4EF| db $FD, $16 ; kanji 言
|1CA4F1| db $0D, $0F, $CD, $00, $0F, $18, $34 ; わん。あんたも
|1CA4F8| db $F6 ; scroll
|1CA4F9| db $FD, $64 ; kanji 深
|1CA4FB| db $FD, $49 ; kanji 入
|1CA4FD| db $39, $13, $0F, $0C, $1C, $25, $47, $1B ; りせんことじゃて
|1CA505| db $CC, $CD ; ⋯。
|1CA507| db $FB ; end of message

;===================================================================================================
; Old man heart in pot
;===================================================================================================
; おぉ,そのツボの中には
; ハートが入っとるはずじゃ。
;===================================================================================================
Message_0098:
|1CA508| db $04, $4F, $C8, $14, $24, $6A, $91, $24 ; おぉ,そのツボの
|1CA510| db $FD, $AE ; kanji 中
|1CA512| db $21, $28 ; には
|1CA514| db $F8 ; row 2
|1CA515| db $78, $C9, $6C, $15 ; ハートが
|1CA519| db $FD, $49 ; kanji 入
|1CA51B| db $4A, $1C, $3A, $28, $26, $25, $47, $CD ; っとるはずじゃ。
|1CA523| db $FB ; end of message

;===================================================================================================
; Old man at last corner
;===================================================================================================
; おぉ ここを右じゃ ⋯ ⋯
; ワシにもなあ,あんたくらいの
; まご娘がいてのう⋯。
; 国王に お城に連れて行かれて
; 戻ってこぬ⋯ イケニエなど
; きっと司祭のたくらみじゃ!
; 魔法陣を封じた7賢者の力を
; うけつぐ娘たちを捕えて,その
; 力をりようするつもりじゃ。
;===================================================================================================
Message_0099:
|1CA524| db $04, $4F, $FF, $0C, $0C, $0E ; おぉ␣ここを
|1CA52A| db $FD, $B1 ; kanji 右
|1CA52C| db $25, $47, $FF, $CC, $FF, $CC ; じゃ␣⋯␣⋯
|1CA532| db $F8 ; row 2
|1CA533| db $5D, $61, $21, $34, $20, $00, $C8, $00 ; ワシにもなあ,あ
|1CA53B| db $0F, $18, $0A, $38, $01, $24 ; んたくらいの
|1CA541| db $F9 ; row 3
|1CA542| db $30, $1E ; まご
|1CA544| db $FD, $00 ; kanji 娘
|1CA546| db $15, $01, $1B, $24, $02, $CC, $CD ; がいてのう⋯。
|1CA54D| db $FA ; wait for key
|1CA54E| db $F6 ; scroll
|1CA54F| db $FD, $2B ; kanji 国
|1CA551| db $FD, $44 ; kanji 王
|1CA553| db $21, $FF, $04 ; に␣お
|1CA556| db $FD, $01 ; kanji 城
|1CA558| db $21 ; に
|1CA559| db $FD, $40 ; kanji 連
|1CA55B| db $3B, $1B ; れて
|1CA55D| db $FD, $02 ; kanji 行
|1CA55F| db $08, $3B, $1B ; かれて
|1CA562| db $F6 ; scroll
|1CA563| db $FD, $0F ; kanji 戻
|1CA565| db $4A, $1B, $0C, $22, $CC, $FF, $51, $5B ; ってこぬ⋯␣イケ
|1CA56D| db $71, $53, $20, $37 ; ニエなど
|1CA571| db $F6 ; scroll
|1CA572| db $09, $4A, $1C ; きっと
|1CA575| db $FD, $0D ; kanji 司
|1CA577| db $FD, $17 ; kanji 祭
|1CA579| db $24, $18, $0A, $38, $31, $25, $47, $C7 ; のたくらみじゃ!
|1CA581| db $FA ; wait for key
|1CA582| db $F6 ; scroll
|1CA583| db $FD, $2D ; kanji 魔
|1CA585| db $FD, $3C ; kanji 法
|1CA587| db $FD, $C5 ; kanji 陣
|1CA589| db $0E ; を
|1CA58A| db $FD, $9E ; kanji 封
|1CA58C| db $25, $18, $A7 ; じた7
|1CA58F| db $FD, $C4 ; kanji 賢
|1CA591| db $FD, $1E ; kanji 者
|1CA593| db $24 ; の
|1CA594| db $FD, $99 ; kanji 力
|1CA596| db $0E ; を
|1CA597| db $F6 ; scroll
|1CA598| db $02, $0B, $1A, $17 ; うけつぐ
|1CA59C| db $FD, $00 ; kanji 娘
|1CA59E| db $18, $19, $0E ; たちを
|1CA5A1| db $FD, $9F ; kanji 捕
|1CA5A3| db $03, $1B, $C8, $14, $24 ; えて,その
|1CA5A8| db $F6 ; scroll
|1CA5A9| db $FD, $99 ; kanji 力
|1CA5AB| db $0E, $39, $07, $02, $12, $3A, $1A, $34 ; をりようするつも
|1CA5B3| db $39, $25, $47, $CD ; りじゃ。
|1CA5B7| db $FB ; end of message

;===================================================================================================
; Old man greeting
;===================================================================================================
; どなたか知らぬが,山へ行くな
; ら,連れて行ってくれぬか。
; ランプをなくしてしもうての。
;===================================================================================================
Message_009A:
|1CA5B8| db $37, $20, $18, $08 ; どなたか
|1CA5BC| db $FD, $93 ; kanji 知
|1CA5BE| db $38, $22, $15, $C8 ; らぬが,
|1CA5C2| db $FD, $94 ; kanji 山
|1CA5C4| db $2B ; へ
|1CA5C5| db $FD, $02 ; kanji 行
|1CA5C7| db $0A, $20 ; くな
|1CA5C9| db $F8 ; row 2
|1CA5CA| db $38, $C8 ; ら,
|1CA5CC| db $FD, $40 ; kanji 連
|1CA5CE| db $3B, $1B ; れて
|1CA5D0| db $FD, $02 ; kanji 行
|1CA5D2| db $4A, $1B, $0A, $3B, $22, $08, $CD ; ってくれぬか。
|1CA5D9| db $F9 ; row 3
|1CA5DA| db $88, $5F, $94, $0E, $20, $0A, $11, $1B ; ランプをなくして
|1CA5E2| db $11, $34, $02, $1B, $24, $CD ; しもうての。
|1CA5E8| db $FB ; end of message

;===================================================================================================
; Old man returned
;===================================================================================================
; イケニエにされた娘は,今も
; どこかで生きておる。それを
; 救う『勇者』が現れる時を
; ワシは信じてまっておる⋯。
; おっ,つい話こんでしもうたの
; 年よりに色々と ありがとう。
; おお,そうじゃ。もし魔法陣に
; 迷いこんだ時は,このカガミに
; あんたの 姿をうつしなさい。
;===================================================================================================
Message_009B:
|1CA5E9| db $51, $5B, $71, $53, $21, $10, $3B, $18 ; イケニエにされた
|1CA5F1| db $FD, $00 ; kanji 娘
|1CA5F3| db $28, $C8 ; は,
|1CA5F5| db $FD, $6A ; kanji 今
|1CA5F7| db $34 ; も
|1CA5F8| db $F8 ; row 2
|1CA5F9| db $37, $0C, $08, $36 ; どこかで
|1CA5FD| db $FD, $B4 ; kanji 生
|1CA5FF| db $09, $1B, $04, $3A, $CD, $14, $3B, $0E ; きておる。それを
|1CA607| db $F9 ; row 3
|1CA608| db $FD, $28 ; kanji 救
|1CA60A| db $02, $C4 ; う『
|1CA60C| db $FD, $A0 ; kanji 勇
|1CA60E| db $FD, $1E ; kanji 者
|1CA610| db $C5, $15 ; 』が
|1CA612| db $FD, $BC ; kanji 現
|1CA614| db $3B, $3A ; れる
|1CA616| db $FD, $88 ; kanji 時
|1CA618| db $0E ; を
|1CA619| db $FA ; wait for key
|1CA61A| db $F6 ; scroll
|1CA61B| db $5D, $61, $28 ; ワシは
|1CA61E| db $FD, $45 ; kanji 信
|1CA620| db $25, $1B, $30, $4A, $1B, $04, $3A, $CC ; じてまっておる⋯
|1CA628| db $CD ; 。
|1CA629| db $F6 ; scroll
|1CA62A| db $04, $4A, $C8, $1A, $01 ; おっ,つい
|1CA62F| db $FD, $A3 ; kanji 話
|1CA631| db $0C, $0F, $36, $11, $34, $02, $18, $24 ; こんでしもうたの
|1CA639| db $F6 ; scroll
|1CA63A| db $FD, $A1 ; kanji 年
|1CA63C| db $07, $39, $21 ; よりに
|1CA63F| db $FD, $A4 ; kanji 色
|1CA641| db $FD, $A5 ; kanji 々
|1CA643| db $1C, $FF, $00, $39, $15, $1C, $02, $CD ; と␣ありがとう。
|1CA64B| db $FA ; wait for key
|1CA64C| db $F6 ; scroll
|1CA64D| db $04, $04, $C8, $14, $02, $25, $47, $CD ; おお,そうじゃ。
|1CA655| db $34, $11 ; もし
|1CA657| db $FD, $2D ; kanji 魔
|1CA659| db $FD, $3C ; kanji 法
|1CA65B| db $FD, $C5 ; kanji 陣
|1CA65D| db $21 ; に
|1CA65E| db $F6 ; scroll
|1CA65F| db $FD, $70 ; kanji 迷
|1CA661| db $01, $0C, $0F, $2E ; いこんだ
|1CA665| db $FD, $88 ; kanji 時
|1CA667| db $28, $C8, $0C, $24, $58, $65, $81, $21 ; は,このカガミに
|1CA66F| db $F6 ; scroll
|1CA670| db $00, $0F, $18, $24, $FF ; あんたの␣
|1CA675| db $FD, $A2 ; kanji 姿
|1CA677| db $0E, $02, $1A, $11, $20, $10, $01, $CD ; をうつしなさい。
|1CA67F| db $FB ; end of message

;===================================================================================================
; Old man before Agahnim defeated game state and no moon pearl
;===================================================================================================
; 王様は きっと司祭にだまされ
; ておる。 司祭は魔の力の通路
; を開こうとしておるのじゃ。
; 山の上の塔には,ムーンパール
; と呼ばれる玉がある。必ず見つ
; けなされ。
; わしが,あんたにしてやれるの
; は,つかれをいやす事くらい⋯
; いつでも来なされ。
;===================================================================================================
Message_009C:
|1CA680| db $FD, $44 ; kanji 王
|1CA682| db $FD, $10 ; kanji 様
|1CA684| db $28, $FF, $09, $4A, $1C ; は␣きっと
|1CA689| db $FD, $0D ; kanji 司
|1CA68B| db $FD, $17 ; kanji 祭
|1CA68D| db $21, $2E, $30, $10, $3B ; にだまされ
|1CA692| db $F8 ; row 2
|1CA693| db $1B, $04, $3A, $CD, $FF ; ておる。␣
|1CA698| db $FD, $0D ; kanji 司
|1CA69A| db $FD, $17 ; kanji 祭
|1CA69C| db $28 ; は
|1CA69D| db $FD, $2D ; kanji 魔
|1CA69F| db $24 ; の
|1CA6A0| db $FD, $99 ; kanji 力
|1CA6A2| db $24 ; の
|1CA6A3| db $FD, $09 ; kanji 通
|1CA6A5| db $FD, $B6 ; kanji 路
|1CA6A7| db $F9 ; row 3
|1CA6A8| db $0E ; を
|1CA6A9| db $FD, $4B ; kanji 開
|1CA6AB| db $0C, $02, $1C, $11, $1B, $04, $3A, $24 ; こうとしておるの
|1CA6B3| db $25, $47, $CD ; じゃ。
|1CA6B6| db $FA ; wait for key
|1CA6B7| db $F6 ; scroll
|1CA6B8| db $FD, $94 ; kanji 山
|1CA6BA| db $24 ; の
|1CA6BB| db $FD, $72 ; kanji 上
|1CA6BD| db $24 ; の
|1CA6BE| db $FD, $D5 ; kanji 塔
|1CA6C0| db $21, $28, $C8, $82, $C9, $5F, $92, $C9 ; には,ムーンパー
|1CA6C8| db $8A ; ル
|1CA6C9| db $F6 ; scroll
|1CA6CA| db $1C ; と
|1CA6CB| db $FD, $50 ; kanji 呼
|1CA6CD| db $3D, $3B, $3A ; ばれる
|1CA6D0| db $FD, $D2 ; kanji 玉
|1CA6D2| db $15, $00, $3A, $CD ; がある。
|1CA6D6| db $FD, $30 ; kanji 必
|1CA6D8| db $26 ; ず
|1CA6D9| db $FD, $4C ; kanji 見
|1CA6DB| db $1A ; つ
|1CA6DC| db $F6 ; scroll
|1CA6DD| db $0B, $20, $10, $3B, $CD ; けなされ。
|1CA6E2| db $FA ; wait for key
|1CA6E3| db $F6 ; scroll
|1CA6E4| db $0D, $11, $15, $C8, $00, $0F, $18, $21 ; わしが,あんたに
|1CA6EC| db $11, $1B, $05, $3B, $3A, $24 ; してやれるの
|1CA6F2| db $F6 ; scroll
|1CA6F3| db $28, $C8, $1A, $08, $3B, $0E, $01, $05 ; は,つかれをいや
|1CA6FB| db $12 ; す
|1CA6FC| db $FD, $22 ; kanji 事
|1CA6FE| db $0A, $38, $01, $CC ; くらい⋯
|1CA702| db $F6 ; scroll
|1CA703| db $01, $1A, $36, $34 ; いつでも
|1CA707| db $FD, $D6 ; kanji 来
|1CA709| db $20, $10, $3B, $CD ; なされ。
|1CA70D| db $FB ; end of message

;===================================================================================================
; Old man before Agahnim defeated game state and moon pearl is had
;===================================================================================================
; ムーンパールは聖地へおもむく
; 勇者のオマモリじゃ。人の姿を
; かえる魔力から守ってくれる。
; それを手に入れたあんたこそ
; ワシのまっておった勇者じゃな
; どうか娘を助けてやってくれ!
; わしが,あんたにしてやれるの
; は,つかれをいやす事くらい⋯
; いつでも来なされ。
;===================================================================================================
Message_009D:
|1CA70E| db $F7 ; row 1
|1CA70F| db $82, $C9, $5F, $92, $C9, $8A, $28 ; ムーンパールは
|1CA716| db $FD, $F6 ; kanji 聖
|1CA718| db $FD, $33 ; kanji 地
|1CA71A| db $2B, $04, $34, $32, $0A ; へおもむく
|1CA71F| db $F8 ; row 2
|1CA720| db $FD, $A0 ; kanji 勇
|1CA722| db $FD, $1E ; kanji 者
|1CA724| db $24, $54, $80, $84, $89, $25, $47, $CD ; のオマモリじゃ。
|1CA72C| db $FD, $38 ; kanji 人
|1CA72E| db $24 ; の
|1CA72F| db $FD, $A2 ; kanji 姿
|1CA731| db $0E ; を
|1CA732| db $F9 ; row 3
|1CA733| db $08, $03, $3A ; かえる
|1CA736| db $FD, $2D ; kanji 魔
|1CA738| db $FD, $99 ; kanji 力
|1CA73A| db $08, $38 ; から
|1CA73C| db $FD, $91 ; kanji 守
|1CA73E| db $4A, $1B, $0A, $3B, $3A, $CD ; ってくれる。
|1CA744| db $FA ; wait for key
|1CA745| db $F6 ; scroll
|1CA746| db $14, $3B, $0E ; それを
|1CA749| db $FD, $3E ; kanji 手
|1CA74B| db $21 ; に
|1CA74C| db $FD, $49 ; kanji 入
|1CA74E| db $3B, $18, $00, $0F, $18, $0C, $14 ; れたあんたこそ
|1CA755| db $F6 ; scroll
|1CA756| db $5D, $61, $24, $30, $4A, $1B, $04, $4A ; ワシのまっておっ
|1CA75E| db $18 ; た
|1CA75F| db $FD, $A0 ; kanji 勇
|1CA761| db $FD, $1E ; kanji 者
|1CA763| db $25, $47, $20 ; じゃな
|1CA766| db $F6 ; scroll
|1CA767| db $37, $02, $08 ; どうか
|1CA76A| db $FD, $00 ; kanji 娘
|1CA76C| db $0E ; を
|1CA76D| db $FD, $CA ; kanji 助
|1CA76F| db $0B, $1B, $05, $4A, $1B, $0A, $3B, $C7 ; けてやってくれ!
|1CA777| db $FA ; wait for key
|1CA778| db $F6 ; scroll
|1CA779| db $0D, $11, $15, $C8, $00, $0F, $18, $21 ; わしが,あんたに
|1CA781| db $11, $1B, $05, $3B, $3A, $24 ; してやれるの
|1CA787| db $F6 ; scroll
|1CA788| db $28, $C8, $1A, $08, $3B, $0E, $01, $05 ; は,つかれをいや
|1CA790| db $12 ; す
|1CA791| db $FD, $22 ; kanji 事
|1CA793| db $0A, $38, $01, $CC ; くらい⋯
|1CA797| db $F6 ; scroll
|1CA798| db $01, $1A, $36, $34 ; いつでも
|1CA79C| db $FD, $D6 ; kanji 来
|1CA79E| db $20, $10, $3B, $CD ; なされ。
|1CA7A2| db $FB ; end of message

;===================================================================================================
; Old man when Agahnim defeated game state
;===================================================================================================
; おお,[LINK]か。どうやら
; 司祭によって城のあたりで,
; 2つの世界がつながった様じゃ
; 闇世界へ向かうのならば,城へ
; 行きなされ。
; わしが,あんたにしてやれるの
; は,つかれをいやす事くらい⋯
; いつでも来なされ。
;===================================================================================================
Message_009E:
|1CA7A3| db $04, $04, $C8 ; おお,
|1CA7A6| db $FE, $6A ; write player name
|1CA7A8| db $08, $CD, $37, $02, $05, $38 ; か。どうやら
|1CA7AE| db $F8 ; row 2
|1CA7AF| db $FD, $0D ; kanji 司
|1CA7B1| db $FD, $17 ; kanji 祭
|1CA7B3| db $21, $07, $4A, $1B ; によって
|1CA7B7| db $FD, $01 ; kanji 城
|1CA7B9| db $24, $00, $18, $39, $36, $C8 ; のあたりで,
|1CA7BF| db $F9 ; row 3
|1CA7C0| db $A2, $1A, $24 ; 2つの
|1CA7C3| db $FD, $E8 ; kanji 世
|1CA7C5| db $FD, $E9 ; kanji 界
|1CA7C7| db $15, $1A, $20, $15, $4A, $18 ; がつながった
|1CA7CD| db $FD, $10 ; kanji 様
|1CA7CF| db $25, $47 ; じゃ
|1CA7D1| db $FA ; wait for key
|1CA7D2| db $F6 ; scroll
|1CA7D3| db $FD, $57 ; kanji 闇
|1CA7D5| db $FD, $E8 ; kanji 世
|1CA7D7| db $FD, $E9 ; kanji 界
|1CA7D9| db $2B ; へ
|1CA7DA| db $FD, $86 ; kanji 向
|1CA7DC| db $08, $02, $24, $20, $38, $3D, $C8 ; かうのならば,
|1CA7E3| db $FD, $01 ; kanji 城
|1CA7E5| db $2B ; へ
|1CA7E6| db $F6 ; scroll
|1CA7E7| db $FD, $02 ; kanji 行
|1CA7E9| db $09, $20, $10, $3B, $CD ; きなされ。
|1CA7EE| db $F6 ; scroll
|1CA7EF| db $FA ; wait for key
|1CA7F0| db $F6 ; scroll
|1CA7F1| db $0D, $11, $15, $C8, $00, $0F, $18, $21 ; わしが,あんたに
|1CA7F9| db $11, $1B, $05, $3B, $3A, $24 ; してやれるの
|1CA7FF| db $F6 ; scroll
|1CA800| db $28, $C8, $1A, $08, $3B, $0E, $01, $05 ; は,つかれをいや
|1CA808| db $12 ; す
|1CA809| db $FD, $22 ; kanji 事
|1CA80B| db $0A, $38, $01, $CC ; くらい⋯
|1CA80F| db $F6 ; scroll
|1CA810| db $01, $1A, $36, $34 ; いつでも
|1CA814| db $FD, $D6 ; kanji 来
|1CA816| db $20, $10, $3B, $CD ; なされ。
|1CA81A| db $FB ; end of message

;===================================================================================================
; Flute dad when no flute
;===================================================================================================
; ⋯ むにゃ わしのむすこは
; フエの好きな子じゃったが
; 『黄金の力』を探しに行った
; きり帰ってこん ⋯ ⋯
; どこで,どうしているのやら⋯
; ⋯ ぐう ぐう〜 ぐう〜
;===================================================================================================
Message_009F:
|1CA81B| db $FF, $CC, $FF, $32, $21, $47, $FF, $0D ; ␣⋯␣むにゃ␣わ
|1CA823| db $11, $24, $32, $12, $0C, $28 ; しのむすこは
|1CA829| db $F8 ; row 2
|1CA82A| db $7A, $53, $24 ; フエの
|1CA82D| db $FD, $6D ; kanji 好
|1CA82F| db $09, $20 ; きな
|1CA831| db $FD, $11 ; kanji 子
|1CA833| db $25, $47, $4A, $18, $15 ; じゃったが
|1CA838| db $F9 ; row 3
|1CA839| db $C4 ; 『
|1CA83A| db $FD, $98 ; kanji 黄
|1CA83C| db $FD, $43 ; kanji 金
|1CA83E| db $24 ; の
|1CA83F| db $FD, $99 ; kanji 力
|1CA841| db $C5, $0E ; 』を
|1CA843| db $FD, $69 ; kanji 探
|1CA845| db $11, $21 ; しに
|1CA847| db $FD, $02 ; kanji 行
|1CA849| db $4A, $18 ; った
|1CA84B| db $FA ; wait for key
|1CA84C| db $F6 ; scroll
|1CA84D| db $09, $39 ; きり
|1CA84F| db $FD, $D7 ; kanji 帰
|1CA851| db $4A, $1B, $0C, $0F, $FF, $CC, $FF, $CC ; ってこん␣⋯␣⋯
|1CA859| db $F6 ; scroll
|1CA85A| db $37, $0C, $36, $C8, $37, $02, $11, $1B ; どこで,どうして
|1CA862| db $01, $3A, $24, $05, $38, $CC ; いるのやら⋯
|1CA868| db $F6 ; scroll
|1CA869| db $CC, $FF, $17, $02, $FF, $17, $02, $CE ; ⋯␣ぐう␣ぐう〜
|1CA871| db $FF, $17, $02, $CE ; ␣ぐう〜
|1CA875| db $FB ; end of message

;===================================================================================================
; Flute dad when flute is played
;===================================================================================================
; ⋯ むにゃ ⋯ こ,これは
; むすこのオカリナ⋯!
; むすこに会いなさったのか!
; どこにおりますか,ゲンキでし
; たか⋯ ⋯ ⋯ ⋯
; そうですか⋯ いや,何も言い
; なさらんでも,そのカオ見れば
; わかりますですじゃ。
; そのオカリナは,あんたが持っ
; ていて下さらんか⋯。
; それで,むすこのかわりに,
; 村のトリにオカリナの音色を
; きかせてやって下され⋯。
; どうか,お願いですじゃ。
; むすこも,よろこぶでしょう⋯
; ⋯ ただ,もうー度だけ,
; むすこに会いたかった⋯。
;===================================================================================================
Message_00A0:
|1CA876| db $FF, $CC, $FF, $32, $21, $47, $FF, $CC ; ␣⋯␣むにゃ␣⋯
|1CA87E| db $FF, $0C, $C8, $0C, $3B, $28 ; ␣こ,これは
|1CA884| db $F8 ; row 2
|1CA885| db $32, $12, $0C, $24, $54, $58, $89, $70 ; むすこのオカリナ
|1CA88D| db $CC, $C7 ; ⋯!
|1CA88F| db $F9 ; row 3
|1CA890| db $32, $12, $0C, $21 ; むすこに
|1CA894| db $FD, $04 ; kanji 会
|1CA896| db $01, $20, $10, $4A, $18, $24, $08, $C7 ; いなさったのか!
|1CA89E| db $FA ; wait for key
|1CA89F| db $F6 ; scroll
|1CA8A0| db $37, $0C, $21, $04, $39, $30, $12, $08 ; どこにおりますか
|1CA8A8| db $C8, $6D, $5F, $59, $36, $11 ; ,ゲンキでし
|1CA8AE| db $F6 ; scroll
|1CA8AF| db $18, $08, $CC, $FF, $CC, $FF, $CC, $FF ; たか⋯␣⋯␣⋯␣
|1CA8B7| db $CC ; ⋯
|1CA8B8| db $F6 ; scroll
|1CA8B9| db $FA ; wait for key
|1CA8BA| db $F6 ; scroll
|1CA8BB| db $14, $02, $36, $12, $08, $CC, $FF, $01 ; そうですか⋯␣い
|1CA8C3| db $05, $C8 ; や,
|1CA8C5| db $FD, $8B ; kanji 何
|1CA8C7| db $34 ; も
|1CA8C8| db $FD, $16 ; kanji 言
|1CA8CA| db $01 ; い
|1CA8CB| db $F6 ; scroll
|1CA8CC| db $20, $10, $38, $0F, $36, $34, $C8, $14 ; なさらんでも,そ
|1CA8D4| db $24, $58, $54 ; のカオ
|1CA8D7| db $FD, $4C ; kanji 見
|1CA8D9| db $3B, $3D ; れば
|1CA8DB| db $F6 ; scroll
|1CA8DC| db $0D, $08, $39, $30, $12, $36, $12, $25 ; わかりますですじ
|1CA8E4| db $47, $CD ; ゃ。
|1CA8E6| db $FA ; wait for key
|1CA8E7| db $F6 ; scroll
|1CA8E8| db $14, $24, $54, $58, $89, $70, $28, $C8 ; そのオカリナは,
|1CA8F0| db $00, $0F, $18, $15 ; あんたが
|1CA8F4| db $FD, $DB ; kanji 持
|1CA8F6| db $4A ; っ
|1CA8F7| db $F6 ; scroll
|1CA8F8| db $1B, $01, $1B ; ていて
|1CA8FB| db $FD, $61 ; kanji 下
|1CA8FD| db $10, $38, $0F, $08, $CC, $CD ; さらんか⋯。
|1CA903| db $F6 ; scroll
|1CA904| db $14, $3B, $36, $C8, $32, $12, $0C, $24 ; それで,むすこの
|1CA90C| db $08, $0D, $39, $21, $C8 ; かわりに,
|1CA911| db $FA ; wait for key
|1CA912| db $F6 ; scroll
|1CA913| db $FD, $8C ; kanji 村
|1CA915| db $24, $6C, $89, $21, $54, $58, $89, $70 ; のトリにオカリナ
|1CA91D| db $24 ; の
|1CA91E| db $FD, $AC ; kanji 音
|1CA920| db $FD, $A4 ; kanji 色
|1CA922| db $0E ; を
|1CA923| db $F6 ; scroll
|1CA924| db $09, $08, $13, $1B, $05, $4A, $1B ; きかせてやって
|1CA92B| db $FD, $61 ; kanji 下
|1CA92D| db $10, $3B, $CC, $CD ; され⋯。
|1CA931| db $F6 ; scroll
|1CA932| db $37, $02, $08, $C8, $04 ; どうか,お
|1CA937| db $FD, $0A ; kanji 願
|1CA939| db $01, $36, $12, $25, $47, $CD ; いですじゃ。
|1CA93F| db $FA ; wait for key
|1CA940| db $F6 ; scroll
|1CA941| db $32, $12, $0C, $34, $C8, $07, $3C, $0C ; むすこも,よろこ
|1CA949| db $3F, $36, $11, $49, $02, $CC ; ぶでしょう⋯
|1CA94F| db $F6 ; scroll
|1CA950| db $FF, $CC, $FF, $18, $2E, $C8, $34, $02 ; ␣⋯␣ただ,もう
|1CA958| db $C9 ; ー
|1CA959| db $FD, $2A ; kanji 度
|1CA95B| db $2E, $0B, $C8 ; だけ,
|1CA95E| db $F6 ; scroll
|1CA95F| db $32, $12, $0C, $21 ; むすこに
|1CA963| db $FD, $04 ; kanji 会
|1CA965| db $01, $18, $08, $4A, $18, $CC, $CD ; いたかった⋯。
|1CA96C| db $FB ; end of message

;===================================================================================================
; Flute dad after playing flute
;===================================================================================================
; そのオカリナは,あんたが持っ
; ていて下さらんか⋯。
; それで,むすこのかわりに,
; 村のトリにオカリナの音色を
; きかせてやって下され⋯。
; どうか,お願いですじゃ。
; むすこも,よろこぶでしょう⋯
; ⋯ ただ,もうー度だけ,
; むすこに会いたかった⋯。
;===================================================================================================
Message_00A1:
|1CA96D| db $14, $24, $54, $58, $89, $70, $28, $C8 ; そのオカリナは,
|1CA975| db $00, $0F, $18, $15 ; あんたが
|1CA979| db $FD, $DB ; kanji 持
|1CA97B| db $4A ; っ
|1CA97C| db $F8 ; row 2
|1CA97D| db $1B, $01, $1B ; ていて
|1CA980| db $FD, $61 ; kanji 下
|1CA982| db $10, $38, $0F, $08, $CC, $CD ; さらんか⋯。
|1CA988| db $F9 ; row 3
|1CA989| db $14, $3B, $36, $C8, $32, $12, $0C, $24 ; それで,むすこの
|1CA991| db $08, $0D, $39, $21, $C8 ; かわりに,
|1CA996| db $FA ; wait for key
|1CA997| db $F6 ; scroll
|1CA998| db $FD, $8C ; kanji 村
|1CA99A| db $24, $6C, $89, $21, $54, $58, $89, $70 ; のトリにオカリナ
|1CA9A2| db $24 ; の
|1CA9A3| db $FD, $AC ; kanji 音
|1CA9A5| db $FD, $A4 ; kanji 色
|1CA9A7| db $0E ; を
|1CA9A8| db $F6 ; scroll
|1CA9A9| db $09, $08, $13, $1B, $05, $4A, $1B ; きかせてやって
|1CA9B0| db $FD, $61 ; kanji 下
|1CA9B2| db $10, $3B, $CC, $CD ; され⋯。
|1CA9B6| db $F6 ; scroll
|1CA9B7| db $37, $02, $08, $C8, $04 ; どうか,お
|1CA9BC| db $FD, $0A ; kanji 願
|1CA9BE| db $01, $36, $12, $25, $47, $CD ; いですじゃ。
|1CA9C4| db $FA ; wait for key
|1CA9C5| db $F6 ; scroll
|1CA9C6| db $32, $12, $0C, $34, $C8, $07, $3C, $0C ; むすこも,よろこ
|1CA9CE| db $3F, $36, $11, $49, $02, $CC ; ぶでしょう⋯
|1CA9D4| db $F6 ; scroll
|1CA9D5| db $FF, $CC, $FF, $18, $2E, $C8, $34, $02 ; ␣⋯␣ただ,もう
|1CA9DD| db $C9 ; ー
|1CA9DE| db $FD, $2A ; kanji 度
|1CA9E0| db $2E, $0B, $C8 ; だけ,
|1CA9E3| db $F6 ; scroll
|1CA9E4| db $32, $12, $0C, $21 ; むすこに
|1CA9E8| db $FD, $04 ; kanji 会
|1CA9EA| db $01, $18, $08, $4A, $18, $CC, $CD ; いたかった⋯。
|1CA9F1| db $FB ; end of message

;===================================================================================================
; Flute kid's dad snoring when flute is had
;---------------------------------------------------------------------------------------------------
; ZZZZZZZzzzzzzzzzzzzzzzzzzzzzzzzzzz
;===================================================================================================
; ぐう〜 ぐう〜
; ⋯ ⋯ ⋯
; ぐっ ぐう〜 ぐう〜
;===================================================================================================
Message_00A2:
|1CA9F2| db $FF, $17, $02, $CE, $FF, $17, $02, $CE ; ␣ぐう〜␣ぐう〜
|1CA9FA| db $F8 ; row 2
|1CA9FB| db $FF, $FF, $CC, $FF, $CC, $FF, $CC ; ␣␣⋯␣⋯␣⋯
|1CAA02| db $F9 ; row 3
|1CAA03| db $FF, $17, $4A, $FF, $17, $02, $CE, $FF ; ␣ぐっ␣ぐう〜␣
|1CAA0B| db $17, $02, $CE ; ぐう〜
|1CAA0E| db $FB ; end of message

;===================================================================================================
; Sweeping lady
;===================================================================================================
; おお,[LINK]や。 姫を連れ
; さらったと言うウワサじゃが,
; ワシは,お前を信じとるよ。
;===================================================================================================
Message_00A3:
|1CAA0F| db $04, $04, $C8 ; おお,
|1CAA12| db $FE, $6A ; write player name
|1CAA14| db $05, $CD, $FF ; や。␣
|1CAA17| db $FD, $FF ; kanji 姫
|1CAA19| db $0E ; を
|1CAA1A| db $FD, $40 ; kanji 連
|1CAA1C| db $3B ; れ
|1CAA1D| db $F8 ; row 2
|1CAA1E| db $10, $38, $4A, $18, $1C ; さらったと
|1CAA23| db $FD, $16 ; kanji 言
|1CAA25| db $02, $52, $5D, $60, $25, $47, $15, $C8 ; うウワサじゃが,
|1CAA2D| db $F9 ; row 3
|1CAA2E| db $5D, $61, $28, $C8, $04 ; ワシは,お
|1CAA33| db $FD, $78 ; kanji 前
|1CAA35| db $0E ; を
|1CAA36| db $FD, $45 ; kanji 信
|1CAA38| db $25, $1C, $3A, $07, $CD ; じとるよ。
|1CAA3D| db $FB ; end of message

;===================================================================================================
; Running boy when caught
;===================================================================================================
; ま,まいった!その足でゼルダ
; 姫をさらったわけかい⋯そんな
; 悪いやつには見えないけどなぁ
; とにかく,それだけ足がはやい
; んだったら,色々な所に,体当
; りしてみるといいかもな⋯。
; この村の木には,おとくな物が
; ひっかかってるみたいだしよ。
; まあ,ためしてごらん。なっ!
;===================================================================================================
Message_00A4:
|1CAA3E| db $30, $C8, $30, $01, $4A, $18, $C7, $14 ; ま,まいった!そ
|1CAA46| db $24 ; の
|1CAA47| db $FD, $96 ; kanji 足
|1CAA49| db $36, $77, $8A, $7E ; でゼルダ
|1CAA4D| db $F8 ; row 2
|1CAA4E| db $FD, $FF ; kanji 姫
|1CAA50| db $0E, $10, $38, $4A, $18, $0D, $0B, $08 ; をさらったわけか
|1CAA58| db $01, $CC, $14, $0F, $20 ; い⋯そんな
|1CAA5D| db $F9 ; row 3
|1CAA5E| db $FD, $85 ; kanji 悪
|1CAA60| db $01, $05, $1A, $21, $28 ; いやつには
|1CAA65| db $FD, $4C ; kanji 見
|1CAA67| db $03, $20, $01, $0B, $37, $20, $4B ; えないけどなぁ
|1CAA6E| db $FA ; wait for key
|1CAA6F| db $F6 ; scroll
|1CAA70| db $1C, $21, $08, $0A, $C8, $14, $3B, $2E ; とにかく,それだ
|1CAA78| db $0B ; け
|1CAA79| db $FD, $96 ; kanji 足
|1CAA7B| db $15, $28, $05, $01 ; がはやい
|1CAA7F| db $F6 ; scroll
|1CAA80| db $0F, $2E, $4A, $18, $38, $C8 ; んだったら,
|1CAA86| db $FD, $A4 ; kanji 色
|1CAA88| db $FD, $A5 ; kanji 々
|1CAA8A| db $20 ; な
|1CAA8B| db $FD, $55 ; kanji 所
|1CAA8D| db $21, $C8 ; に,
|1CAA8F| db $FD, $BF ; kanji 体
|1CAA91| db $FD, $25 ; kanji 当
|1CAA93| db $F6 ; scroll
|1CAA94| db $39, $11, $1B, $31, $3A, $1C, $01, $01 ; りしてみるといい
|1CAA9C| db $08, $34, $20, $CC, $CD ; かもな⋯。
|1CAAA1| db $FA ; wait for key
|1CAAA2| db $F6 ; scroll
|1CAAA3| db $0C, $24 ; この
|1CAAA5| db $FD, $8C ; kanji 村
|1CAAA7| db $24 ; の
|1CAAA8| db $FD, $EB ; kanji 木
|1CAAAA| db $21, $28, $C8, $04, $1C, $0A, $20 ; には,おとくな
|1CAAB1| db $FD, $51 ; kanji 物
|1CAAB3| db $15 ; が
|1CAAB4| db $F6 ; scroll
|1CAAB5| db $29, $4A, $08, $08, $4A, $1B, $3A, $31 ; ひっかかってるみ
|1CAABD| db $18, $01, $2E, $11, $07, $CD ; たいだしよ。
|1CAAC3| db $F6 ; scroll
|1CAAC4| db $30, $00, $C8, $18, $33, $11, $1B, $1E ; まあ,ためしてご
|1CAACC| db $38, $0F, $CD, $20, $4A, $C7 ; らん。なっ!
|1CAAD2| db $FB ; end of message

;===================================================================================================
; Signpost: Generic message
;===================================================================================================
; おいおい,こんなもん見てる
; ヒマがあるんやったら,
; さっさとゴールに行かんかい!
;===================================================================================================
Message_00A5:
|1CAAD3| db $04, $01, $04, $01, $C8, $0C, $0F, $20 ; おいおい,こんな
|1CAADB| db $34, $0F ; もん
|1CAADD| db $FD, $4C ; kanji 見
|1CAADF| db $1B, $3A ; てる
|1CAAE1| db $F8 ; row 2
|1CAAE2| db $79, $80, $15, $00, $3A, $0F, $05, $4A ; ヒマがあるんやっ
|1CAAEA| db $18, $38, $C8 ; たら,
|1CAAED| db $F9 ; row 3
|1CAAEE| db $10, $4A, $10, $1C, $6E, $C9, $8A, $21 ; さっさとゴールに
|1CAAF6| db $FD, $02 ; kanji 行
|1CAAF8| db $08, $0F, $08, $01, $C7 ; かんかい!
|1CAAFD| db $FB ; end of message

;===================================================================================================
; Signpost: Bumper cave
;===================================================================================================
; マントをまといし者に
; ハートのかけらをゆずろう
;===================================================================================================
Message_00A6:
|1CAAFE| db $FF, $80, $5F, $6C, $0E, $30, $1C, $01 ; ␣マントをまとい
|1CAB06| db $11 ; し
|1CAB07| db $FD, $1E ; kanji 者
|1CAB09| db $21 ; に
|1CAB0A| db $F8 ; row 2
|1CAB0B| db $FF, $78, $C9, $6C, $24, $08, $0B, $38 ; ␣ハートのかけら
|1CAB13| db $0E, $06, $26, $3C, $02 ; をゆずろう
|1CAB18| db $FB ; end of message

;===================================================================================================
; Signpost: Lake of Ill Omen warning
;===================================================================================================
; このいけに,物を投げこむ者
; ワザワイあれ!
;===================================================================================================
Message_00A7:
|1CAB19| db $FF, $0C, $24, $01, $0B, $21, $C8 ; ␣このいけに,
|1CAB20| db $FD, $51 ; kanji 物
|1CAB22| db $0E ; を
|1CAB23| db $FD, $FC ; kanji 投
|1CAB25| db $1D, $0C, $32 ; げこむ
|1CAB28| db $FD, $1E ; kanji 者
|1CAB2A| db $F8 ; row 2
|1CAB2B| db $FF, $5D, $6F, $5D, $51, $00, $3B, $C7 ; ␣ワザワイあれ!
|1CAB33| db $FB ; end of message

;===================================================================================================
; Signpost: Skull Woods directions and Village of Outcasts directions
;===================================================================================================
; この先 🡅 ドクロの森
; この先 🡇 はぐれ者の村
;===================================================================================================
Message_00A8:
|1CAB34| db $0C, $24 ; この
|1CAB36| db $FD, $9C ; kanji 先
|1CAB38| db $FF, $E0, $FF, $87, $5A, $8C, $24 ; ␣🡅␣ドクロの
|1CAB3F| db $FD, $65 ; kanji 森
|1CAB41| db $F9 ; row 3
|1CAB42| db $0C, $24 ; この
|1CAB44| db $FD, $9C ; kanji 先
|1CAB46| db $FF, $E1, $FF, $28, $17, $3B ; ␣🡇␣はぐれ
|1CAB4C| db $FD, $1E ; kanji 者
|1CAB4E| db $24 ; の
|1CAB4F| db $FD, $8C ; kanji 村
|1CAB51| db $FB ; end of message

;===================================================================================================
; Signpost: Cave west of Bomb Shop directions
;===================================================================================================
; この先 🡆 洞くつあり
;===================================================================================================
Message_00A9:
|1CAB52| db $F8 ; row 2
|1CAB53| db $0C, $24 ; この
|1CAB55| db $FD, $9C ; kanji 先
|1CAB57| db $FF, $E2, $FF ; ␣🡆␣
|1CAB5A| db $FD, $EF ; kanji 洞
|1CAB5C| db $0A, $1A, $00, $39 ; くつあり
|1CAB60| db $FB ; end of message

;===================================================================================================
; Signpost: Palace of Darkness directions
;===================================================================================================
; この先 🡆 ヤミの神殿
;===================================================================================================
Message_00AA:
|1CAB61| db $F8 ; row 2
|1CAB62| db $0C, $24 ; この
|1CAB64| db $FD, $9C ; kanji 先
|1CAB66| db $FF, $E2, $FF, $55, $81, $24 ; ␣🡆␣ヤミの
|1CAB6C| db $FD, $05 ; kanji 神
|1CAB6E| db $FD, $90 ; kanji 殿
|1CAB70| db $FB ; end of message

;===================================================================================================
; Signpost: Bomb Shop directions
;===================================================================================================
; この先 🡄 バクダン屋
;===================================================================================================
Message_00AB:
|1CAB71| db $F8 ; row 2
|1CAB72| db $0C, $24 ; この
|1CAB74| db $FD, $9C ; kanji 先
|1CAB76| db $FF, $E3, $FF, $8D, $5A, $7E, $5F ; ␣🡄␣バクダン
|1CAB7D| db $FD, $3D ; kanji 屋
|1CAB7F| db $FB ; end of message

;===================================================================================================
; Signpost: Misery Mire directions
;===================================================================================================
; 🡄 悪魔のぬま
; この先 はいる道はなし
; 出て行く道もなし
;===================================================================================================
Message_00AC:
|1CAB80| db $FF, $E3, $FF, $FF, $FF, $FF ; ␣🡄␣␣␣␣
|1CAB86| db $FD, $85 ; kanji 悪
|1CAB88| db $FD, $2D ; kanji 魔
|1CAB8A| db $24, $22, $30 ; のぬま
|1CAB8D| db $F8 ; row 2
|1CAB8E| db $0C, $24 ; この
|1CAB90| db $FD, $9C ; kanji 先
|1CAB92| db $FF, $FF, $FF, $28, $01, $3A ; ␣␣␣はいる
|1CAB98| db $FD, $5D ; kanji 道
|1CAB9A| db $28, $20, $11 ; はなし
|1CAB9D| db $F9 ; row 3
|1CAB9E| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CABA4| db $FD, $23 ; kanji 出
|1CABA6| db $1B ; て
|1CABA7| db $FD, $02 ; kanji 行
|1CABA9| db $0A ; く
|1CABAA| db $FD, $5D ; kanji 道
|1CABAC| db $34, $20, $11 ; もなし
|1CABAF| db $FB ; end of message

;===================================================================================================
; Signpost: Village of Outcasts marker
;===================================================================================================
; ここは,はぐれ者の村
; ルピーのないやつおことわり
;===================================================================================================
Message_00AD:
|1CABB0| db $0C, $0C, $28, $C8, $28, $17, $3B ; ここは,はぐれ
|1CABB7| db $FD, $1E ; kanji 者
|1CABB9| db $24 ; の
|1CABBA| db $FD, $8C ; kanji 村
|1CABBC| db $F8 ; row 2
|1CABBD| db $8A, $93, $C9, $24, $20, $01, $05, $1A ; ルピーのないやつ
|1CABC5| db $04, $0C, $1C, $0D, $39 ; おことわり
|1CABCA| db $FB ; end of message

;===================================================================================================
; Signpost: Waterfall of Wishing is close!
;===================================================================================================
; もうちょっとで,願いのタキ
;===================================================================================================
Message_00AE:
|1CABCB| db $F8 ; row 2
|1CABCC| db $34, $02, $19, $49, $4A, $1C, $36, $C8 ; もうちょっとで,
|1CABD4| db $FD, $0A ; kanji 願
|1CABD6| db $01, $24, $68, $59 ; いのタキ
|1CABDA| db $FB ; end of message

;===================================================================================================
; Signpost: Lake of Ill Omen directions
;===================================================================================================
; この先 🡆🡅
; わざわいのイケ
;===================================================================================================
Message_00AF:
|1CABDB| db $0C, $24 ; この
|1CABDD| db $FD, $9C ; kanji 先
|1CABDF| db $FF, $E2, $E0 ; ␣🡆🡅
|1CABE2| db $F8 ; row 2
|1CABE3| db $FF, $FF, $0D, $1F, $0D, $01, $24, $51 ; ␣␣わざわいのイ
|1CABEB| db $5B ; ケ
|1CABEC| db $FB ; end of message

;===================================================================================================
; Tutorial guard on battlements
;===================================================================================================
; ふう,司祭のアグニムが来てか
; ら,みんなどうかしちまったみ
; たいだ。おれもああなるのかな
;===================================================================================================
Message_00B0:
|1CABED| db $2A, $02, $C8 ; ふう,
|1CABF0| db $FD, $0D ; kanji 司
|1CABF2| db $FD, $17 ; kanji 祭
|1CABF4| db $24, $50, $67, $71, $82, $15 ; のアグニムが
|1CABFA| db $FD, $D6 ; kanji 来
|1CABFC| db $1B, $08 ; てか
|1CABFE| db $F8 ; row 2
|1CABFF| db $38, $C8, $31, $0F, $20, $37, $02, $08 ; ら,みんなどうか
|1CAC07| db $11, $19, $30, $4A, $18, $31 ; しちまったみ
|1CAC0D| db $F9 ; row 3
|1CAC0E| db $18, $01, $2E, $CD, $04, $3B, $34, $00 ; たいだ。おれもあ
|1CAC16| db $00, $20, $3A, $24, $08, $20 ; あなるのかな
|1CAC1C| db $FB ; end of message

;===================================================================================================
; Tutorial guards at Hyrule Castle
;===================================================================================================
; こら こら 城へは入れんぞ
; 子どもは 早く帰って
; ねなさい!
;===================================================================================================
Message_00B1:
|1CAC1D| db $0C, $38, $FF, $0C, $38, $FF ; こら␣こら␣
|1CAC23| db $FD, $01 ; kanji 城
|1CAC25| db $2B, $28 ; へは
|1CAC27| db $FD, $49 ; kanji 入
|1CAC29| db $3B, $0F, $2D ; れんぞ
|1CAC2C| db $F8 ; row 2
|1CAC2D| db $FD, $11 ; kanji 子
|1CAC2F| db $37, $34, $28, $FF ; どもは␣
|1CAC33| db $FD, $18 ; kanji 早
|1CAC35| db $0A ; く
|1CAC36| db $FD, $D7 ; kanji 帰
|1CAC38| db $4A, $1B ; って
|1CAC3A| db $F9 ; row 3
|1CAC3B| db $23, $20, $10, $01, $C7 ; ねなさい!
|1CAC40| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Generic hello
;===================================================================================================
; [LINK]よ,ワシじゃ
; 長老サハスラーラじゃ。
; お前に,助言をあたえよう。
; この神殿にある宝は,かたいヨ
; ロイをまとった魔物をも倒せる
; はずじゃ。必ずみつけなされ。
;===================================================================================================
Message_00B2:
|1CAC41| db $FE, $6B, $02 ; border: 2
|1CAC44| db $FE, $6A ; write player name
|1CAC46| db $07, $C8, $5D, $61, $25, $47 ; よ,ワシじゃ
|1CAC4C| db $F8 ; row 2
|1CAC4D| db $FD, $8D ; kanji 長
|1CAC4F| db $FD, $E5 ; kanji 老
|1CAC51| db $60, $78, $62, $88, $C9, $88, $25, $47 ; サハスラーラじゃ
|1CAC59| db $CD ; 。
|1CAC5A| db $F9 ; row 3
|1CAC5B| db $04 ; お
|1CAC5C| db $FD, $78 ; kanji 前
|1CAC5E| db $21, $C8 ; に,
|1CAC60| db $FD, $CA ; kanji 助
|1CAC62| db $FD, $16 ; kanji 言
|1CAC64| db $0E, $00, $18, $03, $07, $02, $CD ; をあたえよう。
|1CAC6B| db $FA ; wait for key
|1CAC6C| db $F6 ; scroll
|1CAC6D| db $0C, $24 ; この
|1CAC6F| db $FD, $05 ; kanji 神
|1CAC71| db $FD, $90 ; kanji 殿
|1CAC73| db $21, $00, $3A ; にある
|1CAC76| db $FD, $9A ; kanji 宝
|1CAC78| db $28, $C8, $08, $18, $01, $57 ; は,かたいヨ
|1CAC7E| db $F6 ; scroll
|1CAC7F| db $8C, $51, $0E, $30, $1C, $4A, $18 ; ロイをまとった
|1CAC86| db $FD, $2D ; kanji 魔
|1CAC88| db $FD, $51 ; kanji 物
|1CAC8A| db $0E, $34 ; をも
|1CAC8C| db $FD, $29 ; kanji 倒
|1CAC8E| db $13, $3A ; せる
|1CAC90| db $F6 ; scroll
|1CAC91| db $28, $26, $25, $47, $CD ; はずじゃ。
|1CAC96| db $FD, $30 ; kanji 必
|1CAC98| db $26, $31, $1A, $0B, $20, $10, $3B, $CD ; ずみつけなされ。
|1CACA0| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Tower of Hera big chest
;===================================================================================================
; [LINK]よ,サハスラーラじゃ
; この塔には,ムーンパールと
; よばれる玉がおかれておる。
; その玉を持つ者は,魔物の世界
; にあっても,姿がかわらぬよう
; 守ってくれるのじゃ。
; 必ず手に入れて塔を出るがよい
; 忘れるでないぞ⋯。
;===================================================================================================
Message_00B3:
|1CACA1| db $FE, $6B, $02 ; border: 2
|1CACA4| db $FE, $6A ; write player name
|1CACA6| db $07, $C8, $60, $78, $62, $88, $C9, $88 ; よ,サハスラーラ
|1CACAE| db $25, $47 ; じゃ
|1CACB0| db $F8 ; row 2
|1CACB1| db $0C, $24 ; この
|1CACB3| db $FD, $D5 ; kanji 塔
|1CACB5| db $21, $28, $C8, $82, $C9, $5F, $92, $C9 ; には,ムーンパー
|1CACBD| db $8A, $1C ; ルと
|1CACBF| db $F9 ; row 3
|1CACC0| db $07, $3D, $3B, $3A ; よばれる
|1CACC4| db $FD, $D2 ; kanji 玉
|1CACC6| db $15, $04, $08, $3B, $1B, $04, $3A, $CD ; がおかれておる。
|1CACCE| db $FA ; wait for key
|1CACCF| db $F6 ; scroll
|1CACD0| db $14, $24 ; その
|1CACD2| db $FD, $D2 ; kanji 玉
|1CACD4| db $0E ; を
|1CACD5| db $FD, $DB ; kanji 持
|1CACD7| db $1A ; つ
|1CACD8| db $FD, $1E ; kanji 者
|1CACDA| db $28, $C8 ; は,
|1CACDC| db $FD, $2D ; kanji 魔
|1CACDE| db $FD, $51 ; kanji 物
|1CACE0| db $24 ; の
|1CACE1| db $FD, $E8 ; kanji 世
|1CACE3| db $FD, $E9 ; kanji 界
|1CACE5| db $F6 ; scroll
|1CACE6| db $21, $00, $4A, $1B, $34, $C8 ; にあっても,
|1CACEC| db $FD, $A2 ; kanji 姿
|1CACEE| db $15, $08, $0D, $38, $22, $07, $02 ; がかわらぬよう
|1CACF5| db $F6 ; scroll
|1CACF6| db $FD, $91 ; kanji 守
|1CACF8| db $4A, $1B, $0A, $3B, $3A, $24, $25, $47 ; ってくれるのじゃ
|1CAD00| db $CD ; 。
|1CAD01| db $FA ; wait for key
|1CAD02| db $F6 ; scroll
|1CAD03| db $FD, $30 ; kanji 必
|1CAD05| db $26 ; ず
|1CAD06| db $FD, $3E ; kanji 手
|1CAD08| db $21 ; に
|1CAD09| db $FD, $49 ; kanji 入
|1CAD0B| db $3B, $1B ; れて
|1CAD0D| db $FD, $D5 ; kanji 塔
|1CAD0F| db $0E ; を
|1CAD10| db $FD, $23 ; kanji 出
|1CAD12| db $3A, $15, $07, $01 ; るがよい
|1CAD16| db $F6 ; scroll
|1CAD17| db $FD, $D8 ; kanji 忘
|1CAD19| db $3B, $3A, $36, $20, $01, $2D, $CC, $CD ; れるでないぞ⋯。
|1CAD21| db $F6 ; scroll
|1CAD22| db $FB ; end of message

;===================================================================================================
; Pedestal untranslated
;===================================================================================================
; 𓄿≈≈ 𓄿≈≈ ☥≈≈
; ☥ 𓄿≈≈𓄿 ☥
; 𓄿≈≈ ☥𓄿𓄿☥ ≈≈☥
;===================================================================================================
Message_00B4:
|1CAD23| db $DD, $DF, $DF, $FF, $DD, $DF, $DF, $FF ; 𓄿≈≈␣𓄿≈≈␣
|1CAD2B| db $DE, $DF, $DF ; ☥≈≈
|1CAD2E| db $F8 ; row 2
|1CAD2F| db $FF, $FF, $DE, $FF, $DD, $DF, $DF, $DD ; ␣␣☥␣𓄿≈≈𓄿
|1CAD37| db $FF, $DE ; ␣☥
|1CAD39| db $F9 ; row 3
|1CAD3A| db $DD, $DF, $DF, $FF, $DE, $DD, $DD, $DE ; 𓄿≈≈␣☥𓄿𓄿☥
|1CAD42| db $FF, $DF, $DF, $DE ; ␣≈≈☥
|1CAD46| db $FB ; end of message

;===================================================================================================
; Pedestal translated
;===================================================================================================
; 『オオイナル ワザワイ』の
; ふりかかる時,3つの紋章を
; かかげし『勇者』来たりて,
; その手で,この剣を引きぬくで
; あろう。その者ナイトのー族の
; 血をひく者なり。
;===================================================================================================
Message_00B5:
|1CAD47| db $C4, $54, $54, $51, $70, $8A, $FF, $5D ; 『オオイナル␣ワ
|1CAD4F| db $6F, $5D, $51, $C5, $24 ; ザワイ』の
|1CAD54| db $F8 ; row 2
|1CAD55| db $2A, $39, $08, $08, $3A ; ふりかかる
|1CAD5A| db $FD, $88 ; kanji 時
|1CAD5C| db $C8, $A3, $1A, $24 ; ,3つの
|1CAD60| db $FD, $53 ; kanji 紋
|1CAD62| db $FD, $54 ; kanji 章
|1CAD64| db $0E ; を
|1CAD65| db $F9 ; row 3
|1CAD66| db $08, $08, $1D, $11, $C4 ; かかげし『
|1CAD6B| db $FD, $A0 ; kanji 勇
|1CAD6D| db $FD, $1E ; kanji 者
|1CAD6F| db $C5 ; 』
|1CAD70| db $FD, $D6 ; kanji 来
|1CAD72| db $18, $39, $1B, $C8 ; たりて,
|1CAD76| db $FA ; wait for key
|1CAD77| db $F6 ; scroll
|1CAD78| db $14, $24 ; その
|1CAD7A| db $FD, $3E ; kanji 手
|1CAD7C| db $36, $C8, $0C, $24 ; で,この
|1CAD80| db $FD, $1A ; kanji 剣
|1CAD82| db $0E ; を
|1CAD83| db $FD, $48 ; kanji 引
|1CAD85| db $09, $22, $0A, $36 ; きぬくで
|1CAD89| db $F6 ; scroll
|1CAD8A| db $00, $3C, $02, $CD, $14, $24 ; あろう。その
|1CAD90| db $FD, $1E ; kanji 者
|1CAD92| db $70, $51, $6C, $24, $C9 ; ナイトのー
|1CAD97| db $FD, $F2 ; kanji 族
|1CAD99| db $24 ; の
|1CAD9A| db $F6 ; scroll
|1CAD9B| db $FD, $B9 ; kanji 血
|1CAD9D| db $0E, $29, $0A ; をひく
|1CADA0| db $FD, $1E ; kanji 者
|1CADA2| db $20, $39, $CD ; なり。
|1CADA5| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Spectacle rock
;===================================================================================================
; [LINK]よ,このサハスラーラ
; のことば,よくきくのじゃ。
; メガネイワにのぼるのじゃ。
; そうすれば,このヘブラ山の
; ヘラの塔へたどりつけるじゃろ
; う。よくかんがえることじゃ。
;===================================================================================================
Message_00B6:
|1CADA6| db $FE, $6B, $02 ; border: 2
|1CADA9| db $FE, $6A ; write player name
|1CADAB| db $07, $C8, $0C, $24, $60, $78, $62, $88 ; よ,このサハスラ
|1CADB3| db $C9, $88 ; ーラ
|1CADB5| db $F8 ; row 2
|1CADB6| db $24, $0C, $1C, $3D, $C8, $07, $0A, $09 ; のことば,よくき
|1CADBE| db $0A, $24, $25, $47, $CD ; くのじゃ。
|1CADC3| db $F9 ; row 3
|1CADC4| db $83, $65, $73, $51, $5D, $21, $24, $41 ; メガネイワにのぼ
|1CADCC| db $3A, $24, $25, $47, $CD ; るのじゃ。
|1CADD1| db $FA ; wait for key
|1CADD2| db $F6 ; scroll
|1CADD3| db $14, $02, $12, $3B, $3D, $C8, $0C, $24 ; そうすれば,この
|1CADDB| db $7B, $8F, $88 ; ヘブラ
|1CADDE| db $FD, $94 ; kanji 山
|1CADE0| db $24 ; の
|1CADE1| db $F6 ; scroll
|1CADE2| db $7B, $88, $24 ; ヘラの
|1CADE5| db $FD, $D5 ; kanji 塔
|1CADE7| db $2B, $18, $37, $39, $1A, $0B, $3A, $25 ; へたどりつけるじ
|1CADEF| db $47, $3C ; ゃろ
|1CADF1| db $F6 ; scroll
|1CADF2| db $02, $CD, $07, $0A, $08, $0F, $15, $03 ; う。よくかんがえ
|1CADFA| db $3A, $0C, $1C, $25, $47, $CD ; ることじゃ。
|1CAE00| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Swamp Palace entrance
;===================================================================================================
; [LINK]よ,よくきけ。光と闇
; それぞれの世界にある物は
; たがいにその姿をまねておる。
; 1つの物の姿がかわれば,
; もう,1つもかわっておるはず
; じゃ。よくかんがえるのじゃ。
;===================================================================================================
Message_00B7:
|1CAE01| db $FE, $6B, $02 ; border: 2
|1CAE04| db $FE, $6A ; write player name
|1CAE06| db $07, $C8, $07, $0A, $09, $0B, $CD ; よ,よくきけ。
|1CAE0D| db $FD, $73 ; kanji 光
|1CAE0F| db $1C ; と
|1CAE10| db $FD, $57 ; kanji 闇
|1CAE12| db $F8 ; row 2
|1CAE13| db $14, $3B, $2D, $3B, $24 ; それぞれの
|1CAE18| db $FD, $E8 ; kanji 世
|1CAE1A| db $FD, $E9 ; kanji 界
|1CAE1C| db $21, $00, $3A ; にある
|1CAE1F| db $FD, $51 ; kanji 物
|1CAE21| db $28 ; は
|1CAE22| db $F9 ; row 3
|1CAE23| db $18, $15, $01, $21, $14, $24 ; たがいにその
|1CAE29| db $FD, $A2 ; kanji 姿
|1CAE2B| db $0E, $30, $23, $1B, $04, $3A, $CD ; をまねておる。
|1CAE32| db $FA ; wait for key
|1CAE33| db $F6 ; scroll
|1CAE34| db $A1, $1A, $24 ; 1つの
|1CAE37| db $FD, $51 ; kanji 物
|1CAE39| db $24 ; の
|1CAE3A| db $FD, $A2 ; kanji 姿
|1CAE3C| db $15, $08, $0D, $3B, $3D, $C8 ; がかわれば,
|1CAE42| db $F6 ; scroll
|1CAE43| db $34, $02, $C8, $A1, $1A, $34, $08, $0D ; もう,1つもかわ
|1CAE4B| db $4A, $1B, $04, $3A, $28, $26 ; っておるはず
|1CAE51| db $F6 ; scroll
|1CAE52| db $25, $47, $CD, $07, $0A, $08, $0F, $15 ; じゃ。よくかんが
|1CAE5A| db $03, $3A, $24, $25, $47, $CD ; えるのじゃ。
|1CAE60| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Gargoyle's Domain attic
;===================================================================================================
; [LINK]⋯私よ,ゼルダよ⋯。
; 盗賊ブラインドの魔術にまどわ
; されないで!気を付けてね。
;===================================================================================================
Message_00B8:
|1CAE61| db $FE, $6B, $02 ; border: 2
|1CAE64| db $FE, $6A ; write player name
|1CAE66| db $CC ; ⋯
|1CAE67| db $FD, $26 ; kanji 私
|1CAE69| db $07, $C8, $77, $8A, $7E, $07, $CC, $CD ; よ,ゼルダよ⋯。
|1CAE71| db $F8 ; row 2
|1CAE72| db $FD, $F1 ; kanji 盗
|1CAE74| db $FD, $EE ; kanji 賊
|1CAE76| db $8F, $88, $51, $5F, $87, $24 ; ブラインドの
|1CAE7C| db $FD, $2D ; kanji 魔
|1CAE7E| db $FD, $CB ; kanji 術
|1CAE80| db $21, $30, $37, $0D ; にまどわ
|1CAE84| db $F9 ; row 3
|1CAE85| db $10, $3B, $20, $01, $36, $C7 ; されないで!
|1CAE8B| db $FD, $37 ; kanji 気
|1CAE8D| db $0E ; を
|1CAE8E| db $FD, $52 ; kanji 付
|1CAE90| db $0B, $1B, $23, $CD ; けてね。
|1CAE94| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Misery Mire moving wall
;===================================================================================================
; [LINK]よ,サハスラーラじゃ
; 4つのあかりをともせば,
; すすむ道が開けるじゃろう。
;===================================================================================================
Message_00B9:
|1CAE95| db $FE, $6B, $02 ; border: 2
|1CAE98| db $FE, $6A ; write player name
|1CAE9A| db $07, $C8, $60, $78, $62, $88, $C9, $88 ; よ,サハスラーラ
|1CAEA2| db $25, $47 ; じゃ
|1CAEA4| db $F8 ; row 2
|1CAEA5| db $A4, $1A, $24, $00, $08, $39, $0E, $1C ; 4つのあかりをと
|1CAEAD| db $34, $13, $3D, $C8 ; もせば,
|1CAEB1| db $F9 ; row 3
|1CAEB2| db $12, $12, $32 ; すすむ
|1CAEB5| db $FD, $5D ; kanji 道
|1CAEB7| db $15 ; が
|1CAEB8| db $FD, $4B ; kanji 開
|1CAEBA| db $0B, $3A, $25, $47, $3C, $02, $CD ; けるじゃろう。
|1CAEC1| db $FB ; end of message

;===================================================================================================
; Desert tablet untranslated
;===================================================================================================
; 𓄿𓄿☥≈ 𓄿≈≈𓄿
; ☥ ≈𓄿☥≈
; ≈≈𓄿≈ ☥☥𓄿☥
;===================================================================================================
Message_00BA:
|1CAEC2| db $FF, $FF, $DD, $DD, $DE, $DF, $FF, $DD ; ␣␣𓄿𓄿☥≈␣𓄿
|1CAECA| db $DF, $DF, $DD ; ≈≈𓄿
|1CAECD| db $F8 ; row 2
|1CAECE| db $FF, $FF, $FF, $DE, $FF, $DF, $DD, $DE ; ␣␣␣☥␣≈𓄿☥
|1CAED6| db $DF ; ≈
|1CAED7| db $F9 ; row 3
|1CAED8| db $FF, $FF, $DF, $DF, $DD, $DF, $FF, $DE ; ␣␣≈≈𓄿≈␣☥
|1CAEE0| db $DE, $DD, $DE ; ☥𓄿☥
|1CAEE3| db $FB ; end of message

;===================================================================================================
; Desert tablet translated
;===================================================================================================
; このセキバンの前で念ずるが
; よい。そなたの願い伝われば,
; 道は開けるであろう⋯。
;===================================================================================================
Message_00BB:
|1CAEE4| db $0C, $24, $63, $59, $8D, $5F, $24 ; このセキバンの
|1CAEEB| db $FD, $78 ; kanji 前
|1CAEED| db $36 ; で
|1CAEEE| db $FD, $B2 ; kanji 念
|1CAEF0| db $26, $3A, $15 ; ずるが
|1CAEF3| db $F8 ; row 2
|1CAEF4| db $07, $01, $CD, $14, $20, $18, $24 ; よい。そなたの
|1CAEFB| db $FD, $0A ; kanji 願
|1CAEFD| db $01 ; い
|1CAEFE| db $FD, $2E ; kanji 伝
|1CAF00| db $0D, $3B, $3D, $C8 ; われば,
|1CAF04| db $F9 ; row 3
|1CAF05| db $FD, $5D ; kanji 道
|1CAF07| db $28 ; は
|1CAF08| db $FD, $4B ; kanji 開
|1CAF0A| db $0B, $3A, $36, $00, $3C, $02, $CC, $CD ; けるであろう⋯。
|1CAF12| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Pyramid fall
;===================================================================================================
; ガノンのうごきを封じたら
; 『銀の矢』でとどめをさすの
; じゃっ!よいな[LINK]よ⋯。
;===================================================================================================
Message_00BC:
|1CAF13| db $FE, $6B, $02 ; border: 2
|1CAF16| db $65, $74, $5F, $24, $02, $1E, $09, $0E ; ガノンのうごきを
|1CAF1E| db $FD, $9E ; kanji 封
|1CAF20| db $25, $18, $38 ; じたら
|1CAF23| db $F8 ; row 2
|1CAF24| db $C4 ; 『
|1CAF25| db $FD, $DE ; kanji 銀
|1CAF27| db $24 ; の
|1CAF28| db $FD, $BB ; kanji 矢
|1CAF2A| db $C5, $36, $1C, $37, $33, $0E, $10, $12 ; 』でとどめをさす
|1CAF32| db $24 ; の
|1CAF33| db $F9 ; row 3
|1CAF34| db $25, $47, $4A, $C7, $07, $01, $20 ; じゃっ!よいな
|1CAF3B| db $FE, $6A ; write player name
|1CAF3D| db $07, $CC, $CD ; よ⋯。
|1CAF40| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Palace of Darkness right side
;===================================================================================================
; [LINK]⋯私の声がきこえる?
; 私よ,ゼルダよ。
; 私は今,デスマウンテンにある
; カメイワのなかに封じ込められ
; ているの。あなたが,来てくれ
; るのを信じてまっています⋯
;===================================================================================================
Message_00BD:
|1CAF41| db $FE, $6B, $02 ; border: 2
|1CAF44| db $FE, $6A ; write player name
|1CAF46| db $CC ; ⋯
|1CAF47| db $FD, $26 ; kanji 私
|1CAF49| db $24 ; の
|1CAF4A| db $FD, $60 ; kanji 声
|1CAF4C| db $15, $09, $0C, $03, $3A, $C6 ; がきこえる?
|1CAF52| db $F8 ; row 2
|1CAF53| db $FD, $26 ; kanji 私
|1CAF55| db $07, $C8, $77, $8A, $7E, $07, $CD ; よ,ゼルダよ。
|1CAF5C| db $F9 ; row 3
|1CAF5D| db $FD, $26 ; kanji 私
|1CAF5F| db $28 ; は
|1CAF60| db $FD, $6A ; kanji 今
|1CAF62| db $C8, $86, $62, $80, $52, $5F, $6B, $5F ; ,デスマウンテン
|1CAF6A| db $21, $00, $3A ; にある
|1CAF6D| db $FA ; wait for key
|1CAF6E| db $F6 ; scroll
|1CAF6F| db $58, $83, $51, $5D, $24, $20, $08, $21 ; カメイワのなかに
|1CAF77| db $FD, $9E ; kanji 封
|1CAF79| db $25 ; じ
|1CAF7A| db $FD, $DC ; kanji 込
|1CAF7C| db $33, $38, $3B ; められ
|1CAF7F| db $F6 ; scroll
|1CAF80| db $1B, $01, $3A, $24, $CD, $00, $20, $18 ; ているの。あなた
|1CAF88| db $15, $C8 ; が,
|1CAF8A| db $FD, $D6 ; kanji 来
|1CAF8C| db $1B, $0A, $3B ; てくれ
|1CAF8F| db $F6 ; scroll
|1CAF90| db $3A, $24, $0E ; るのを
|1CAF93| db $FD, $45 ; kanji 信
|1CAF95| db $25, $1B, $30, $4A, $1B, $01, $30, $12 ; じてまっています
|1CAF9D| db $CC ; ⋯
|1CAF9E| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Desert Palace torches
;===================================================================================================
; [LINK]よ,サハスラーラじゃ
; すべての魔物のヤカタにおかれ
; た宝は,必ず手に入れるのじゃ
;===================================================================================================
Message_00BE:
|1CAF9F| db $FE, $6B, $02 ; border: 2
|1CAFA2| db $FE, $6A ; write player name
|1CAFA4| db $07, $C8, $60, $78, $62, $88, $C9, $88 ; よ,サハスラーラ
|1CAFAC| db $25, $47 ; じゃ
|1CAFAE| db $F8 ; row 2
|1CAFAF| db $12, $40, $1B, $24 ; すべての
|1CAFB3| db $FD, $2D ; kanji 魔
|1CAFB5| db $FD, $51 ; kanji 物
|1CAFB7| db $24, $55, $58, $68, $21, $04, $08, $3B ; のヤカタにおかれ
|1CAFBF| db $F9 ; row 3
|1CAFC0| db $18 ; た
|1CAFC1| db $FD, $9A ; kanji 宝
|1CAFC3| db $28, $C8 ; は,
|1CAFC5| db $FD, $30 ; kanji 必
|1CAFC7| db $26 ; ず
|1CAFC8| db $FD, $3E ; kanji 手
|1CAFCA| db $21 ; に
|1CAFCB| db $FD, $49 ; kanji 入
|1CAFCD| db $3B, $3A, $24, $25, $47 ; れるのじゃ
|1CAFD2| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Agahnim's Tower 5F
;===================================================================================================
; よいか,[LINK]よ。
; マスターソードといえども,
; 司祭の体をきる事はできぬ。
; やつの魔力をぎゃくに,りよう
; するのじゃ。
;===================================================================================================
Message_00BF:
|1CAFD3| db $FE, $6B, $02 ; border: 2
|1CAFD6| db $07, $01, $08, $C8 ; よいか,
|1CAFDA| db $FE, $6A ; write player name
|1CAFDC| db $07, $CD ; よ。
|1CAFDE| db $F8 ; row 2
|1CAFDF| db $80, $62, $68, $C9, $64, $C9, $87, $1C ; マスターソードと
|1CAFE7| db $01, $03, $37, $34, $C8 ; いえども,
|1CAFEC| db $F9 ; row 3
|1CAFED| db $FD, $0D ; kanji 司
|1CAFEF| db $FD, $17 ; kanji 祭
|1CAFF1| db $24 ; の
|1CAFF2| db $FD, $BF ; kanji 体
|1CAFF4| db $0E, $09, $3A ; をきる
|1CAFF7| db $FD, $22 ; kanji 事
|1CAFF9| db $28, $36, $09, $22, $CD ; はできぬ。
|1CAFFE| db $FA ; wait for key
|1CAFFF| db $F6 ; scroll
|1CB000| db $05, $1A, $24 ; やつの
|1CB003| db $FD, $2D ; kanji 魔
|1CB005| db $FD, $99 ; kanji 力
|1CB007| db $0E, $16, $47, $0A, $21, $C8, $39, $07 ; をぎゃくに,りよ
|1CB00F| db $02 ; う
|1CB010| db $F6 ; scroll
|1CB011| db $12, $3A, $24, $25, $47, $CD ; するのじゃ。
|1CB017| db $F6 ; scroll
|1CB018| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Ice Palace long ice room
;===================================================================================================
; [LINK]よ,魔法の力を使いき
; るでないぞ。魔法のクスリを
; 持っておらぬのならば,
; 心して,奥へすすむがよい。
; むりをするでないぞ⋯。
;===================================================================================================
Message_00C0:
|1CB019| db $FE, $6B, $02 ; border: 2
|1CB01C| db $FE, $6A ; write player name
|1CB01E| db $07, $C8 ; よ,
|1CB020| db $FD, $2D ; kanji 魔
|1CB022| db $FD, $3C ; kanji 法
|1CB024| db $24 ; の
|1CB025| db $FD, $99 ; kanji 力
|1CB027| db $0E ; を
|1CB028| db $FD, $89 ; kanji 使
|1CB02A| db $01, $09 ; いき
|1CB02C| db $F8 ; row 2
|1CB02D| db $3A, $36, $20, $01, $2D, $CD ; るでないぞ。
|1CB033| db $FD, $2D ; kanji 魔
|1CB035| db $FD, $3C ; kanji 法
|1CB037| db $24, $5A, $62, $89, $0E ; のクスリを
|1CB03C| db $F9 ; row 3
|1CB03D| db $FD, $DB ; kanji 持
|1CB03F| db $4A, $1B, $04, $38, $22, $24, $20, $38 ; っておらぬのなら
|1CB047| db $3D, $C8 ; ば,
|1CB049| db $FA ; wait for key
|1CB04A| db $F6 ; scroll
|1CB04B| db $FD, $E6 ; kanji 心
|1CB04D| db $11, $1B, $C8 ; して,
|1CB050| db $FD, $80 ; kanji 奥
|1CB052| db $2B, $12, $12, $32, $15, $07, $01, $CD ; へすすむがよい。
|1CB05A| db $F6 ; scroll
|1CB05B| db $32, $39, $0E, $12, $3A, $36, $20, $01 ; むりをするでない
|1CB063| db $2D, $CC, $CD ; ぞ⋯。
|1CB066| db $F6 ; scroll
|1CB067| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Turtle Rock entrance
;===================================================================================================
; [LINK]よ,魔法のクスリは
; もっておるか。クスリがないの
; なら,先へはすすまぬ事じゃ。
;===================================================================================================
Message_00C1:
|1CB068| db $FE, $6B, $02 ; border: 2
|1CB06B| db $FE, $6A ; write player name
|1CB06D| db $07, $C8 ; よ,
|1CB06F| db $FD, $2D ; kanji 魔
|1CB071| db $FD, $3C ; kanji 法
|1CB073| db $24, $5A, $62, $89, $28 ; のクスリは
|1CB078| db $F8 ; row 2
|1CB079| db $34, $4A, $1B, $04, $3A, $08, $CD, $5A ; もっておるか。ク
|1CB081| db $62, $89, $15, $20, $01, $24 ; スリがないの
|1CB087| db $F9 ; row 3
|1CB088| db $20, $38, $C8 ; なら,
|1CB08B| db $FD, $9C ; kanji 先
|1CB08D| db $2B, $28, $12, $12, $30, $22 ; へはすすまぬ
|1CB093| db $FD, $22 ; kanji 事
|1CB095| db $25, $47, $CD ; じゃ。
|1CB098| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Ice Palace entrance
;===================================================================================================
; [LINK]よ,ここでは大小2つ
; の炎が,お前を守ってくれる
; だろう⋯。
;===================================================================================================
Message_00C2:
|1CB099| db $FE, $6B, $02 ; border: 2
|1CB09C| db $FE, $6A ; write player name
|1CB09E| db $07, $C8, $0C, $0C, $36, $28 ; よ,ここでは
|1CB0A4| db $FD, $5F ; kanji 大
|1CB0A6| db $FD, $FA ; kanji 小
|1CB0A8| db $A2, $1A ; 2つ
|1CB0AA| db $F8 ; row 2
|1CB0AB| db $24 ; の
|1CB0AC| db $FD, $A9 ; kanji 炎
|1CB0AE| db $15, $C8, $04 ; が,お
|1CB0B1| db $FD, $78 ; kanji 前
|1CB0B3| db $0E ; を
|1CB0B4| db $FD, $91 ; kanji 守
|1CB0B6| db $4A, $1B, $0A, $3B, $3A ; ってくれる
|1CB0BB| db $F9 ; row 3
|1CB0BC| db $2E, $3C, $02, $CC, $CD ; だろう⋯。
|1CB0C1| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Ice Palace stalfos knights
;===================================================================================================
; [LINK]⋯,ガイコツの剣士は
; 剣だけでは倒せないわ。くずれ
; た時に,とどめをさすのよ。
;===================================================================================================
Message_00C3:
|1CB0C2| db $FE, $6B, $02 ; border: 2
|1CB0C5| db $FE, $6A ; write player name
|1CB0C7| db $CC, $C8, $65, $51, $5C, $6A, $24 ; ⋯,ガイコツの
|1CB0CE| db $FD, $1A ; kanji 剣
|1CB0D0| db $FD, $6B ; kanji 士
|1CB0D2| db $28 ; は
|1CB0D3| db $F8 ; row 2
|1CB0D4| db $FD, $1A ; kanji 剣
|1CB0D6| db $2E, $0B, $36, $28 ; だけでは
|1CB0DA| db $FD, $29 ; kanji 倒
|1CB0DC| db $13, $20, $01, $0D, $CD, $0A, $26, $3B ; せないわ。くずれ
|1CB0E4| db $F9 ; row 3
|1CB0E5| db $18 ; た
|1CB0E6| db $FD, $88 ; kanji 時
|1CB0E8| db $21, $C8, $1C, $37, $33, $0E, $10, $12 ; に,とどめをさす
|1CB0F0| db $24, $07, $CD ; のよ。
|1CB0F3| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Tower of Hera entrance
;===================================================================================================
; [LINK]よ,ワシじゃ
; 長老サハスラーラじゃ。
; お前に,助言をあたえよう。
; 魔物のヤカタでマジカルミラー
; を使えば,いつでも入口に帰る
; ことができる。忘れるでないぞ
;===================================================================================================
Message_00C4:
|1CB0F4| db $FE, $6B, $02 ; border: 2
|1CB0F7| db $FE, $6A ; write player name
|1CB0F9| db $07, $C8, $5D, $61, $25, $47 ; よ,ワシじゃ
|1CB0FF| db $F8 ; row 2
|1CB100| db $FD, $8D ; kanji 長
|1CB102| db $FD, $E5 ; kanji 老
|1CB104| db $60, $78, $62, $88, $C9, $88, $25, $47 ; サハスラーラじゃ
|1CB10C| db $CD ; 。
|1CB10D| db $F9 ; row 3
|1CB10E| db $04 ; お
|1CB10F| db $FD, $78 ; kanji 前
|1CB111| db $21, $C8 ; に,
|1CB113| db $FD, $CA ; kanji 助
|1CB115| db $FD, $16 ; kanji 言
|1CB117| db $0E, $00, $18, $03, $07, $02, $CD ; をあたえよう。
|1CB11E| db $FA ; wait for key
|1CB11F| db $F6 ; scroll
|1CB120| db $FD, $2D ; kanji 魔
|1CB122| db $FD, $51 ; kanji 物
|1CB124| db $24, $55, $58, $68, $36, $80, $75, $58 ; のヤカタでマジカ
|1CB12C| db $8A, $81, $88, $C9 ; ルミラー
|1CB130| db $F6 ; scroll
|1CB131| db $0E ; を
|1CB132| db $FD, $89 ; kanji 使
|1CB134| db $03, $3D, $C8, $01, $1A, $36, $34 ; えば,いつでも
|1CB13B| db $FD, $49 ; kanji 入
|1CB13D| db $FD, $4A ; kanji 口
|1CB13F| db $21 ; に
|1CB140| db $FD, $D7 ; kanji 帰
|1CB142| db $3A ; る
|1CB143| db $F6 ; scroll
|1CB144| db $0C, $1C, $15, $36, $09, $3A, $CD ; ことができる。
|1CB14B| db $FD, $D8 ; kanji 忘
|1CB14D| db $3B, $3A, $36, $20, $01, $2D ; れるでないぞ
|1CB153| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Houlihan room
;===================================================================================================
; ここは,秘密の部屋だよ〜ん。
; みんなにはないしょだよ〜ん。
;===================================================================================================
Message_00C5:
|1CB154| db $0C, $0C, $28, $C8 ; ここは,
|1CB158| db $FD, $C1 ; kanji 秘
|1CB15A| db $FD, $C2 ; kanji 密
|1CB15C| db $24 ; の
|1CB15D| db $FD, $B7 ; kanji 部
|1CB15F| db $FD, $3D ; kanji 屋
|1CB161| db $2E, $07, $CE, $0F, $CD ; だよ〜ん。
|1CB166| db $F8 ; row 2
|1CB167| db $31, $0F, $20, $21, $28, $20, $01, $11 ; みんなにはないし
|1CB16F| db $49, $2E, $07, $CE, $0F, $CD ; ょだよ〜ん。
|1CB175| db $FB ; end of message

;===================================================================================================
; Bee catch
;===================================================================================================
; ハチをつかまえた。どうする?
; ▶ ビンに入れておく
;   逃がしてやる
;===================================================================================================
Message_00C6:
|1CB176| db $78, $69, $0E, $1A, $08, $30, $03, $18 ; ハチをつかまえた
|1CB17E| db $CD, $37, $02, $12, $3A, $C6 ; 。どうする?
|1CB184| db $F8 ; row 2
|1CB185| db $FF, $FF, $E4, $FF, $FF, $8E, $5F, $21 ; ␣␣▶␣␣ビンに
|1CB18D| db $FD, $49 ; kanji 入
|1CB18F| db $3B, $1B, $04, $0A ; れておく
|1CB193| db $F9 ; row 3
|1CB194| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CB199| db $FD, $DD ; kanji 逃
|1CB19B| db $15, $11, $1B, $05, $3A ; がしてやる
|1CB1A0| db $FE, $68 ; choose 2 low
|1CB1A2| db $FB ; end of message

;===================================================================================================
; Fairy catch
;===================================================================================================
; ヨウセイをつかまえた。
; ▶ ビンに入れておく
;   逃がしてやる
;===================================================================================================
Message_00C7:
|1CB1A3| db $57, $52, $63, $51, $0E, $1A, $08, $30 ; ヨウセイをつかま
|1CB1AB| db $03, $18, $CD ; えた。
|1CB1AE| db $F8 ; row 2
|1CB1AF| db $FF, $FF, $E4, $FF, $FF, $8E, $5F, $21 ; ␣␣▶␣␣ビンに
|1CB1B7| db $FD, $49 ; kanji 入
|1CB1B9| db $3B, $1B, $04, $0A ; れておく
|1CB1BD| db $F9 ; row 3
|1CB1BE| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CB1C3| db $FD, $DD ; kanji 逃
|1CB1C5| db $15, $11, $1B, $05, $3A ; がしてやる
|1CB1CA| db $FE, $68 ; choose 2 low
|1CB1CC| db $FB ; end of message

;===================================================================================================
; Full bottles during catch
;===================================================================================================
; あきビンがありません。
; しかたがない⋯,逃がして
; あげよう。
;===================================================================================================
Message_00C8:
|1CB1CD| db $00, $09, $8E, $5F, $15, $00, $39, $30 ; あきビンがありま
|1CB1D5| db $13, $0F, $CD ; せん。
|1CB1D8| db $F8 ; row 2
|1CB1D9| db $11, $08, $18, $15, $20, $01, $CC, $C8 ; しかたがない⋯,
|1CB1E1| db $FD, $DD ; kanji 逃
|1CB1E3| db $15, $11, $1B ; がして
|1CB1E6| db $F9 ; row 3
|1CB1E7| db $00, $1D, $07, $02, $CD ; あげよう。
|1CB1EC| db $FB ; end of message

;===================================================================================================
; Race game guy results
;===================================================================================================
; ただいまの タイムは
; [BCD][BCD]ふん [BCD][BCD]びょう
; でした。
;===================================================================================================
Message_00C9:
|1CB1ED| db $18, $2E, $01, $30, $24, $FF, $68, $51 ; ただいまの␣タイ
|1CB1F5| db $82, $28 ; ムは
|1CB1F7| db $F8 ; row 2
|1CB1F8| db $FF, $FF ; ␣␣
|1CB1FA| db $FE, $6C, $03 ; BCD digit 3
|1CB1FD| db $FE, $6C, $02 ; BCD digit 2
|1CB200| db $2A, $0F, $FF ; ふん␣
|1CB203| db $FE, $6C, $01 ; BCD digit 1
|1CB206| db $FE, $6C, $00 ; BCD digit 0
|1CB209| db $3E, $49, $02 ; びょう
|1CB20C| db $F9 ; row 3
|1CB20D| db $36, $11, $18, $CD ; でした。
|1CB211| db $FB ; end of message

;===================================================================================================
; Race game girl start
;===================================================================================================
; 15びょういないにゴールへ
; ついたら,いい物あげるよ。
; よ〜〜〜い⋯ ⋯ ⋯ ドン!
;===================================================================================================
Message_00CA:
|1CB212| db $A1, $A5, $3E, $49, $02, $01, $20, $01 ; 15びょういない
|1CB21A| db $21, $6E, $C9, $8A, $2B ; にゴールへ
|1CB21F| db $F8 ; row 2
|1CB220| db $1A, $01, $18, $38, $C8, $01, $01 ; ついたら,いい
|1CB227| db $FD, $51 ; kanji 物
|1CB229| db $00, $1D, $3A, $07, $CD ; あげるよ。
|1CB22E| db $F9 ; row 3
|1CB22F| db $07, $CE, $CE, $CE, $01, $CC, $FF, $CC ; よ〜〜〜い⋯␣⋯
|1CB237| db $FF, $CC, $FF, $87, $5F, $C7 ; ␣⋯␣ドン!
|1CB23D| db $FB ; end of message

;===================================================================================================
; Race game guy win
;===================================================================================================
; ごうか〜く!
; おめでとうございま〜す!
; ハートのかけらをプレゼント!
;===================================================================================================
Message_00CB:
|1CB23E| db $1E, $02, $08, $CE, $0A, $C7 ; ごうか〜く!
|1CB244| db $F8 ; row 2
|1CB245| db $04, $33, $36, $1C, $02, $1E, $1F, $01 ; おめでとうござい
|1CB24D| db $30, $CE, $12, $C7 ; ま〜す!
|1CB251| db $F9 ; row 3
|1CB252| db $78, $C9, $6C, $24, $08, $0B, $38, $0E ; ハートのかけらを
|1CB25A| db $94, $8B, $77, $5F, $6C, $C7 ; プレゼント!
|1CB260| db $FB ; end of message

;===================================================================================================
; Race game guy loss
;===================================================================================================
; ふごうか〜く!
; 残念でした。
; また,トライして下さい!
;===================================================================================================
Message_00CC:
|1CB261| db $2A, $1E, $02, $08, $CE, $0A, $C7 ; ふごうか〜く!
|1CB268| db $F8 ; row 2
|1CB269| db $FD, $C6 ; kanji 残
|1CB26B| db $FD, $B2 ; kanji 念
|1CB26D| db $36, $11, $18, $CD ; でした。
|1CB271| db $F9 ; row 3
|1CB272| db $30, $18, $C8, $6C, $88, $51, $11, $1B ; また,トライして
|1CB27A| db $FD, $61 ; kanji 下
|1CB27C| db $10, $01, $C7 ; さい!
|1CB27F| db $FB ; end of message

;===================================================================================================
; Race game guy out of prizes
;===================================================================================================
; もう,あげる物がありませ〜ん
; ごめんなさ〜い!
;===================================================================================================
Message_00CD:
|1CB280| db $34, $02, $C8, $00, $1D, $3A ; もう,あげる
|1CB286| db $FD, $51 ; kanji 物
|1CB288| db $15, $00, $39, $30, $13, $CE, $0F ; がありませ〜ん
|1CB28F| db $F8 ; row 2
|1CB290| db $F9 ; row 3
|1CB291| db $1E, $33, $0F, $20, $10, $CE, $01, $C7 ; ごめんなさ〜い!
|1CB299| db $FB ; end of message

;===================================================================================================
; Race game guy illegal entry
;===================================================================================================
; ちゃんと,入口からはいって
; こないとダメだよ。 だって
; タイムがはかれないから⋯。
;===================================================================================================
Message_00CE:
|1CB29A| db $19, $47, $0F, $1C, $C8 ; ちゃんと,
|1CB29F| db $FD, $49 ; kanji 入
|1CB2A1| db $FD, $4A ; kanji 口
|1CB2A3| db $08, $38, $28, $01, $4A, $1B ; からはいって
|1CB2A9| db $F8 ; row 2
|1CB2AA| db $0C, $20, $01, $1C, $7E, $83, $2E, $07 ; こないとダメだよ
|1CB2B2| db $CD, $FF, $2E, $4A, $1B ; 。␣だって
|1CB2B7| db $F9 ; row 3
|1CB2B8| db $68, $51, $82, $15, $28, $08, $3B, $20 ; タイムがはかれな
|1CB2C0| db $01, $08, $38, $CC, $CD ; いから⋯。
|1CB2C5| db $FB ; end of message

;===================================================================================================
; Bottle vendor sales pitch
;===================================================================================================
; なんでも入る 魔法のビンは
; いらないあるか?
; 100ルピーでOKあるね。
; どうするあるよ?
; ▶ か う
;   いらない
;===================================================================================================
Message_00CF:
|1CB2C6| db $20, $0F, $36, $34 ; なんでも
|1CB2CA| db $FD, $49 ; kanji 入
|1CB2CC| db $3A, $FF ; る␣
|1CB2CE| db $FD, $2D ; kanji 魔
|1CB2D0| db $FD, $3C ; kanji 法
|1CB2D2| db $24, $8E, $5F, $28 ; のビンは
|1CB2D6| db $F8 ; row 2
|1CB2D7| db $01, $38, $20, $01, $00, $3A, $08, $C6 ; いらないあるか?
|1CB2DF| db $F9 ; row 3
|1CB2E0| db $A1, $A0, $A0, $8A, $93, $C9, $36, $B8 ; 100ルピーでO
|1CB2E8| db $B4, $00, $3A, $23, $CD ; Kあるね。
|1CB2ED| db $FA ; wait for key
|1CB2EE| db $F6 ; scroll
|1CB2EF| db $37, $02, $12, $3A, $00, $3A, $07, $C6 ; どうするあるよ?
|1CB2F7| db $F6 ; scroll
|1CB2F8| db $FF, $FF, $E4, $FF, $08, $FF, $FF, $02 ; ␣␣▶␣か␣␣う
|1CB300| db $F6 ; scroll
|1CB301| db $FF, $FF, $FF, $FF, $01, $38, $20, $01 ; ␣␣␣␣いらない
|1CB309| db $FE, $68 ; choose 2 low
|1CB30B| db $FB ; end of message

;===================================================================================================
; Bottle vendor purchase
;===================================================================================================
; おお ありがとさんね。
; おもいっきり アタマの上に
; かかげるよろし!
;===================================================================================================
Message_00D0:
|1CB30C| db $04, $04, $FF, $00, $39, $15, $1C, $10 ; おお␣ありがとさ
|1CB314| db $0F, $23, $CD ; んね。
|1CB317| db $F8 ; row 2
|1CB318| db $04, $34, $01, $4A, $09, $39, $FF, $50 ; おもいっきり␣ア
|1CB320| db $68, $80, $24 ; タマの
|1CB323| db $FD, $72 ; kanji 上
|1CB325| db $21 ; に
|1CB326| db $F9 ; row 3
|1CB327| db $08, $08, $1D, $3A, $07, $3C, $11, $C7 ; かかげるよろし!
|1CB32F| db $FB ; end of message

;===================================================================================================
; Bottle vendor: you are poor
;===================================================================================================
; あいや〜 ザンネンあるね。
; ルピー集めて
; また 来るよろしね。
;===================================================================================================
Message_00D1:
|1CB330| db $00, $01, $05, $CE, $FF, $6F, $5F, $73 ; あいや〜␣ザンネ
|1CB338| db $5F, $00, $3A, $23, $CD ; ンあるね。
|1CB33D| db $F8 ; row 2
|1CB33E| db $8A, $93, $C9 ; ルピー
|1CB341| db $FD, $E0 ; kanji 集
|1CB343| db $33, $1B ; めて
|1CB345| db $F9 ; row 3
|1CB346| db $30, $18, $FF ; また␣
|1CB349| db $FD, $D6 ; kanji 来
|1CB34B| db $3A, $07, $3C, $11, $23, $CD ; るよろしね。
|1CB351| db $FB ; end of message

;===================================================================================================
; Bottle vendor no more bottles
;===================================================================================================
; もう ビンはうりきれたね。
; また 来るよろしね。
; ⋯ ⋯ ⋯
;===================================================================================================
Message_00D2:
|1CB352| db $34, $02, $FF, $8E, $5F, $28, $02, $39 ; もう␣ビンはうり
|1CB35A| db $09, $3B, $18, $23, $CD ; きれたね。
|1CB35F| db $F8 ; row 2
|1CB360| db $30, $18, $FF ; また␣
|1CB363| db $FD, $D6 ; kanji 来
|1CB365| db $3A, $07, $3C, $11, $23, $CD ; るよろしね。
|1CB36B| db $F9 ; row 3
|1CB36C| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB372| db $FB ; end of message

;===================================================================================================
; Bottle vendor buying bee
;===================================================================================================
; あいや〜 これはめずらしい
; ハチあるね。
; 100ルピーでかうあるよ。
;===================================================================================================
Message_00D3:
|1CB373| db $00, $01, $05, $CE, $FF, $FF, $0C, $3B ; あいや〜␣␣これ
|1CB37B| db $28, $33, $26, $38, $11, $01 ; はめずらしい
|1CB381| db $F8 ; row 2
|1CB382| db $78, $69, $00, $3A, $23, $CD ; ハチあるね。
|1CB388| db $F9 ; row 3
|1CB389| db $A1, $A0, $A0, $8A, $93, $C9, $36, $08 ; 100ルピーでか
|1CB391| db $02, $00, $3A, $07, $CD ; うあるよ。
|1CB396| db $FB ; end of message

;===================================================================================================
; Bottle vendor accepting fish
;===================================================================================================
; あいや〜 さかなをたべるは
; 体にヨロシイあるよ。
; これと,かえっこするね。
;===================================================================================================
Message_00D4:
|1CB397| db $00, $01, $05, $CE, $FF, $10, $08, $20 ; あいや〜␣さかな
|1CB39F| db $0E, $18, $40, $3A, $28 ; をたべるは
|1CB3A4| db $F8 ; row 2
|1CB3A5| db $FD, $BF ; kanji 体
|1CB3A7| db $21, $57, $8C, $61, $51, $00, $3A, $07 ; にヨロシイあるよ
|1CB3AF| db $CD ; 。
|1CB3B0| db $F9 ; row 3
|1CB3B1| db $0C, $3B, $1C, $C8, $08, $03, $4A, $0C ; これと,かえっこ
|1CB3B9| db $12, $3A, $23, $CD ; するね。
|1CB3BD| db $FB ; end of message

;===================================================================================================
; Hobo gifting bottle
;===================================================================================================
; よう [LINK]!何だか
; たいへんそうだが オレの
; やれる物は こんなもんだけだ
;===================================================================================================
Message_00D5:
|1CB3BE| db $07, $02, $FF ; よう␣
|1CB3C1| db $FE, $6A ; write player name
|1CB3C3| db $C7 ; !
|1CB3C4| db $FD, $8B ; kanji 何
|1CB3C6| db $2E, $08 ; だか
|1CB3C8| db $F8 ; row 2
|1CB3C9| db $18, $01, $2B, $0F, $14, $02, $2E, $15 ; たいへんそうだが
|1CB3D1| db $FF, $54, $8B, $24 ; ␣オレの
|1CB3D5| db $F9 ; row 3
|1CB3D6| db $05, $3B, $3A ; やれる
|1CB3D9| db $FD, $51 ; kanji 物
|1CB3DB| db $28, $FF, $0C, $0F, $20, $34, $0F, $2E ; は␣こんなもんだ
|1CB3E3| db $0B, $2E ; けだ
|1CB3E5| db $FB ; end of message

;===================================================================================================
; Dwarf tempering request
;===================================================================================================
; おう,あんたかい!
; よく,来たね。
; なんなりと言っとくれっ!
; ▶ 剣をきたえる
;   ちょっとよっただけ
;===================================================================================================
Message_00D6:
|1CB3E6| db $04, $02, $C8, $00, $0F, $18, $08, $01 ; おう,あんたかい
|1CB3EE| db $C7 ; !
|1CB3EF| db $F8 ; row 2
|1CB3F0| db $07, $0A, $C8 ; よく,
|1CB3F3| db $FD, $D6 ; kanji 来
|1CB3F5| db $18, $23, $CD ; たね。
|1CB3F8| db $F9 ; row 3
|1CB3F9| db $FA ; wait for key
|1CB3FA| db $F6 ; scroll
|1CB3FB| db $20, $0F, $20, $39, $1C ; なんなりと
|1CB400| db $FD, $16 ; kanji 言
|1CB402| db $4A, $1C, $0A, $3B, $4A, $C7 ; っとくれっ!
|1CB408| db $F6 ; scroll
|1CB409| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CB40D| db $FD, $1A ; kanji 剣
|1CB40F| db $0E, $09, $18, $03, $3A ; をきたえる
|1CB414| db $F6 ; scroll
|1CB415| db $FF, $FF, $FF, $FF, $19, $49, $4A, $1C ; ␣␣␣␣ちょっと
|1CB41D| db $07, $4A, $18, $2E, $0B ; よっただけ
|1CB422| db $FE, $68 ; choose 2 low
|1CB424| db $FB ; end of message

;===================================================================================================
; Dwarf tempering payment
;===================================================================================================
; 大まけにまけとくぜっ!
; ▶ 剣 ⋯ 10ルピー
;   ちょっとまって
;===================================================================================================
Message_00D7:
|1CB425| db $FD, $5F ; kanji 大
|1CB427| db $30, $0B, $21, $30, $0B, $1C, $0A, $27 ; まけにまけとくぜ
|1CB42F| db $4A, $C7 ; っ!
|1CB431| db $F8 ; row 2
|1CB432| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CB436| db $FD, $1A ; kanji 剣
|1CB438| db $FF, $CC, $FF, $A1, $A0, $8A, $93, $C9 ; ␣⋯␣10ルピー
|1CB440| db $F9 ; row 3
|1CB441| db $FF, $FF, $FF, $FF, $19, $49, $4A, $1C ; ␣␣␣␣ちょっと
|1CB449| db $30, $4A, $1B ; まって
|1CB44C| db $FE, $68 ; choose 2 low
|1CB44E| db $FB ; end of message

;===================================================================================================
; Dwarf tempering confirmation
;===================================================================================================
; 剣をきたえりゃいいんだな?
; ▶ うん
;   ちょっとまって
;===================================================================================================
Message_00D8:
|1CB44F| db $FD, $1A ; kanji 剣
|1CB451| db $0E, $09, $18, $03, $39, $47, $01, $01 ; をきたえりゃいい
|1CB459| db $0F, $2E, $20, $C6 ; んだな?
|1CB45D| db $F8 ; row 2
|1CB45E| db $FF, $FF, $E4, $FF, $02, $0F ; ␣␣▶␣うん
|1CB464| db $F9 ; row 3
|1CB465| db $FF, $FF, $FF, $FF, $19, $49, $4A, $1C ; ␣␣␣␣ちょっと
|1CB46D| db $30, $4A, $1B ; まって
|1CB470| db $FE, $68 ; choose 2 low
|1CB472| db $FB ; end of message

;===================================================================================================
; Tossed fighter sword get
;===================================================================================================
; う〜ん,それより強くは,でき
; ねえなぁ⋯。 すまねえ⋯。
;===================================================================================================
Message_00D9:
|1CB473| db $02, $CE, $0F, $C8, $14, $3B, $07, $39 ; う〜ん,それより
|1CB47B| db $FD, $FB ; kanji 強
|1CB47D| db $0A, $28, $C8, $36, $09 ; くは,でき
|1CB482| db $F8 ; row 2
|1CB483| db $23, $03, $20, $4B, $CC, $CD, $FF, $12 ; ねえなぁ⋯。␣す
|1CB48B| db $30, $23, $03, $CC, $CD ; まねえ⋯。
|1CB490| db $FB ; end of message

;===================================================================================================
; Dwarf tempering declined
;===================================================================================================
; また,いつでもよっとくんな!
; ほいこらっ!
; よいこらっ!
;===================================================================================================
Message_00DA:
|1CB491| db $30, $18, $C8, $01, $1A, $36, $34, $07 ; また,いつでもよ
|1CB499| db $4A, $1C, $0A, $0F, $20, $C7 ; っとくんな!
|1CB49F| db $F8 ; row 2
|1CB4A0| db $FF, $FF, $FF, $2C, $01, $0C, $38, $4A ; ␣␣␣ほいこらっ
|1CB4A8| db $C7 ; !
|1CB4A9| db $F9 ; row 3
|1CB4AA| db $FF, $FF, $FF, $07, $01, $0C, $38, $4A ; ␣␣␣よいこらっ
|1CB4B2| db $C7 ; !
|1CB4B3| db $FB ; end of message

;===================================================================================================
; Dwarf tempering accepted
;===================================================================================================
; ほいきた,剣をちょっとばかし
; あずからしてもらうよっ!
;===================================================================================================
Message_00DB:
|1CB4B4| db $2C, $01, $09, $18, $C8 ; ほいきた,
|1CB4B9| db $FD, $1A ; kanji 剣
|1CB4BB| db $0E, $19, $49, $4A, $1C, $3D, $08, $11 ; をちょっとばかし
|1CB4C3| db $F8 ; row 2
|1CB4C4| db $00, $26, $08, $38, $11, $1B, $34, $38 ; あずからしてもら
|1CB4CC| db $02, $07, $4A, $C7 ; うよっ!
|1CB4D0| db $FB ; end of message

;===================================================================================================
; Dwarf here's your sword
;===================================================================================================
; おう,剣がきたえあがったぜ!
; そら,かかげてみなっ!
;===================================================================================================
Message_00DC:
|1CB4D1| db $04, $02, $C8 ; おう,
|1CB4D4| db $FD, $1A ; kanji 剣
|1CB4D6| db $15, $09, $18, $03, $00, $15, $4A, $18 ; がきたえあがった
|1CB4DE| db $27, $C7 ; ぜ!
|1CB4E0| db $F8 ; row 2
|1CB4E1| db $14, $38, $C8, $08, $08, $1D, $1B, $31 ; そら,かかげてみ
|1CB4E9| db $20, $4A, $C7 ; なっ!
|1CB4EC| db $FB ; end of message

;===================================================================================================
; Dwarf misses his friend
;===================================================================================================
; ゆくえ知れずのあいぼうが
; 帰ってくりゃあ,あんたの剣も
; きたえてやれんだがねえ⋯。
;===================================================================================================
Message_00DD:
|1CB4ED| db $06, $0A, $03 ; ゆくえ
|1CB4F0| db $FD, $93 ; kanji 知
|1CB4F2| db $3B, $26, $24, $00, $01, $41, $02, $15 ; れずのあいぼうが
|1CB4FA| db $F8 ; row 2
|1CB4FB| db $FD, $D7 ; kanji 帰
|1CB4FD| db $4A, $1B, $0A, $39, $47, $00, $C8, $00 ; ってくりゃあ,あ
|1CB505| db $0F, $18, $24 ; んたの
|1CB508| db $FD, $1A ; kanji 剣
|1CB50A| db $34 ; も
|1CB50B| db $F9 ; row 3
|1CB50C| db $09, $18, $03, $1B, $05, $3B, $0F, $2E ; きたえてやれんだ
|1CB514| db $15, $23, $03, $CC, $CD ; がねえ⋯。
|1CB519| db $FB ; end of message

;===================================================================================================
; Dwarf friend returned
;===================================================================================================
; おお!なんてこったい,
; あいぼうをみつけてきたのかい
; ⋯ うれしいじゃないかい⋯
; また,ウチへよっとくれい!
; そん時は,あんたの剣
; ばっちりきたえさせてもらうぜ
;===================================================================================================
Message_00DE:
|1CB51A| db $04, $04, $C7, $20, $0F, $1B, $0C, $4A ; おお!なんてこっ
|1CB522| db $18, $01, $C8 ; たい,
|1CB525| db $F8 ; row 2
|1CB526| db $00, $01, $41, $02, $0E, $31, $1A, $0B ; あいぼうをみつけ
|1CB52E| db $1B, $09, $18, $24, $08, $01 ; てきたのかい
|1CB534| db $F9 ; row 3
|1CB535| db $FF, $CC, $FF, $02, $3B, $11, $01, $25 ; ␣⋯␣うれしいじ
|1CB53D| db $47, $20, $01, $08, $01, $CC ; ゃないかい⋯
|1CB543| db $FA ; wait for key
|1CB544| db $F6 ; scroll
|1CB545| db $30, $18, $C8, $52, $69, $2B, $07, $4A ; また,ウチへよっ
|1CB54D| db $1C, $0A, $3B, $01, $C7 ; とくれい!
|1CB552| db $F6 ; scroll
|1CB553| db $14, $0F ; そん
|1CB555| db $FD, $88 ; kanji 時
|1CB557| db $28, $C8, $00, $0F, $18, $24 ; は,あんたの
|1CB55D| db $FD, $1A ; kanji 剣
|1CB55F| db $F6 ; scroll
|1CB560| db $3D, $4A, $19, $39, $09, $18, $03, $10 ; ばっちりきたえさ
|1CB568| db $13, $1B, $34, $38, $02, $27 ; せてもらうぜ
|1CB56E| db $FB ; end of message

;===================================================================================================
; Frog greeting
;===================================================================================================
; ゲロゲロ あんた姿がかわらね
; えとこ見ると,ただもんじゃあ
; ねえな。 そうだろ?
; おれは,もともとカカリコ村に
; 住んでいたんだ。そう言えば
; あいぼうはどうしてんだろなあ
; あんた,頼むよ。
; どうか,あいぼうにあわせて
; やってケロッ。頼む!
;===================================================================================================
Message_00DF:
|1CB56F| db $6D, $8C, $6D, $8C, $FF, $00, $0F, $18 ; ゲロゲロ␣あんた
|1CB577| db $FD, $A2 ; kanji 姿
|1CB579| db $15, $08, $0D, $38, $23 ; がかわらね
|1CB57E| db $F8 ; row 2
|1CB57F| db $03, $1C, $0C ; えとこ
|1CB582| db $FD, $4C ; kanji 見
|1CB584| db $3A, $1C, $C8, $18, $2E, $34, $0F, $25 ; ると,ただもんじ
|1CB58C| db $47, $00 ; ゃあ
|1CB58E| db $F9 ; row 3
|1CB58F| db $23, $03, $20, $CD, $FF, $14, $02, $2E ; ねえな。␣そうだ
|1CB597| db $3C, $C6 ; ろ?
|1CB599| db $FA ; wait for key
|1CB59A| db $F6 ; scroll
|1CB59B| db $04, $3B, $28, $C8, $34, $1C, $34, $1C ; おれは,もともと
|1CB5A3| db $58, $58, $89, $5C ; カカリコ
|1CB5A7| db $FD, $8C ; kanji 村
|1CB5A9| db $21 ; に
|1CB5AA| db $F6 ; scroll
|1CB5AB| db $FD, $3F ; kanji 住
|1CB5AD| db $0F, $36, $01, $18, $0F, $2E, $CD, $14 ; んでいたんだ。そ
|1CB5B5| db $02 ; う
|1CB5B6| db $FD, $16 ; kanji 言
|1CB5B8| db $03, $3D ; えば
|1CB5BA| db $F6 ; scroll
|1CB5BB| db $00, $01, $41, $02, $28, $37, $02, $11 ; あいぼうはどうし
|1CB5C3| db $1B, $0F, $2E, $3C, $20, $00 ; てんだろなあ
|1CB5C9| db $FA ; wait for key
|1CB5CA| db $F6 ; scroll
|1CB5CB| db $00, $0F, $18, $C8 ; あんた,
|1CB5CF| db $FD, $08 ; kanji 頼
|1CB5D1| db $32, $07, $CD ; むよ。
|1CB5D4| db $F6 ; scroll
|1CB5D5| db $37, $02, $08, $C8, $00, $01, $41, $02 ; どうか,あいぼう
|1CB5DD| db $21, $00, $0D, $13, $1B ; にあわせて
|1CB5E2| db $F6 ; scroll
|1CB5E3| db $05, $4A, $1B, $5B, $8C, $9A, $CD ; やってケロッ。
|1CB5EA| db $FD, $08 ; kanji 頼
|1CB5EC| db $32, $C7 ; む!
|1CB5EE| db $FB ; end of message

;===================================================================================================
; Dwarf tempering in progress
;===================================================================================================
; もうしわけネェ。
; もうしばらくしてから
; 来ておくんなっ!
;===================================================================================================
Message_00E0:
|1CB5EF| db $34, $02, $11, $0D, $0B, $73, $9E, $CD ; もうしわけネェ。
|1CB5F7| db $F8 ; row 2
|1CB5F8| db $34, $02, $11, $3D, $38, $0A, $11, $1B ; もうしばらくして
|1CB600| db $08, $38 ; から
|1CB602| db $F9 ; row 3
|1CB603| db $FD, $D6 ; kanji 来
|1CB605| db $1B, $04, $0A, $0F, $20, $4A, $C7 ; ておくんなっ!
|1CB60C| db $FB ; end of message

;===================================================================================================
; Dwarf gratitude
;===================================================================================================
; ありがとよっ!
; ありがとよっ!
;===================================================================================================
Message_00E1:
|1CB60D| db $FF, $FF, $00, $39, $15, $1C, $07, $4A ; ␣␣ありがとよっ
|1CB615| db $C7 ; !
|1CB616| db $F8 ; row 2
|1CB617| db $F9 ; row 3
|1CB618| db $FF, $FF, $00, $39, $15, $1C, $07, $4A ; ␣␣ありがとよっ
|1CB620| db $C7 ; !
|1CB621| db $FB ; end of message

;===================================================================================================
; Dwarf don't try to help
;===================================================================================================
; ほらほら,シロウトが手を出す
; んじゃねえよ。 じゃまになっ
; ていけねえやい。
;===================================================================================================
Message_00E2:
|1CB622| db $2C, $38, $2C, $38, $C8, $61, $8C, $52 ; ほらほら,シロウ
|1CB62A| db $6C, $15 ; トが
|1CB62C| db $FD, $3E ; kanji 手
|1CB62E| db $0E ; を
|1CB62F| db $FD, $23 ; kanji 出
|1CB631| db $12 ; す
|1CB632| db $F8 ; row 2
|1CB633| db $0F, $25, $47, $23, $03, $07, $CD, $FF ; んじゃねえよ。␣
|1CB63B| db $25, $47, $30, $21, $20, $4A ; じゃまになっ
|1CB641| db $F9 ; row 3
|1CB642| db $1B, $01, $0B, $23, $03, $05, $01, $CD ; ていけねえやい。
|1CB64A| db $FB ; end of message

;===================================================================================================
; Stumpy request
;===================================================================================================
; こっち側に 迷いこんだら
; こんな姿に なっちまって。
; ⋯ ⋯ ⋯
; モトの世界に いたころは
; よく フエをふいて
; あそんだものさ⋯。
; ⋯ ⋯ ⋯
; どうぶつ達の集まる小さな
; ひろ場,なつかしいなあ⋯。
; そこに,花のタネといっしょに
; オカリナをうめたんだ。
; 探してみてくれないか?
; ▶ う ん
;   いやん
;===================================================================================================
Message_00E3:
|1CB64B| db $0C, $4A, $19 ; こっち
|1CB64E| db $FD, $5A ; kanji 側
|1CB650| db $21, $FF ; に␣
|1CB652| db $FD, $70 ; kanji 迷
|1CB654| db $01, $0C, $0F, $2E, $38 ; いこんだら
|1CB659| db $F8 ; row 2
|1CB65A| db $0C, $0F, $20 ; こんな
|1CB65D| db $FD, $A2 ; kanji 姿
|1CB65F| db $21, $FF, $20, $4A, $19, $30, $4A, $1B ; に␣なっちまって
|1CB667| db $CD ; 。
|1CB668| db $F9 ; row 3
|1CB669| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB66F| db $FA ; wait for key
|1CB670| db $F6 ; scroll
|1CB671| db $84, $6C, $24 ; モトの
|1CB674| db $FD, $E8 ; kanji 世
|1CB676| db $FD, $E9 ; kanji 界
|1CB678| db $21, $FF, $01, $18, $0C, $3C, $28 ; に␣いたころは
|1CB67F| db $F6 ; scroll
|1CB680| db $07, $0A, $FF, $7A, $53, $0E, $2A, $01 ; よく␣フエをふい
|1CB688| db $1B ; て
|1CB689| db $F6 ; scroll
|1CB68A| db $00, $14, $0F, $2E, $34, $24, $10, $CC ; あそんだものさ⋯
|1CB692| db $CD ; 。
|1CB693| db $FA ; wait for key
|1CB694| db $F6 ; scroll
|1CB695| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB69B| db $F6 ; scroll
|1CB69C| db $37, $02, $3F, $1A ; どうぶつ
|1CB6A0| db $FD, $13 ; kanji 達
|1CB6A2| db $24 ; の
|1CB6A3| db $FD, $E0 ; kanji 集
|1CB6A5| db $30, $3A ; まる
|1CB6A7| db $FD, $FA ; kanji 小
|1CB6A9| db $10, $20 ; さな
|1CB6AB| db $F6 ; scroll
|1CB6AC| db $29, $3C ; ひろ
|1CB6AE| db $FD, $A8 ; kanji 場
|1CB6B0| db $C8, $20, $1A, $08, $11, $01, $20, $00 ; ,なつかしいなあ
|1CB6B8| db $CC, $CD ; ⋯。
|1CB6BA| db $FA ; wait for key
|1CB6BB| db $F6 ; scroll
|1CB6BC| db $14, $0C, $21, $C8 ; そこに,
|1CB6C0| db $FD, $63 ; kanji 花
|1CB6C2| db $24, $68, $73, $1C, $01, $4A, $11, $49 ; のタネといっしょ
|1CB6CA| db $21 ; に
|1CB6CB| db $F6 ; scroll
|1CB6CC| db $54, $58, $89, $70, $0E, $02, $33, $18 ; オカリナをうめた
|1CB6D4| db $0F, $2E, $CD ; んだ。
|1CB6D7| db $F6 ; scroll
|1CB6D8| db $FA ; wait for key
|1CB6D9| db $F6 ; scroll
|1CB6DA| db $FD, $69 ; kanji 探
|1CB6DC| db $11, $1B, $31, $1B, $0A, $3B, $20, $01 ; してみてくれない
|1CB6E4| db $08, $C6 ; か?
|1CB6E6| db $F6 ; scroll
|1CB6E7| db $FF, $FF, $E4, $FF, $02, $FF, $0F ; ␣␣▶␣う␣ん
|1CB6EE| db $F6 ; scroll
|1CB6EF| db $FF, $FF, $FF, $FF, $01, $05, $0F ; ␣␣␣␣いやん
|1CB6F6| db $FE, $68 ; choose 2 low
|1CB6F8| db $FB ; end of message

;===================================================================================================
; Stumpy shovel gift
;===================================================================================================
; じゃあ,このシャベルを
; きみにわたそう ⋯ ⋯ ⋯
; 頼んだよっ!
;===================================================================================================
Message_00E4:
|1CB6F9| db $25, $47, $00, $C8, $0C, $24, $61, $97 ; じゃあ,このシャ
|1CB701| db $90, $8A, $0E ; ベルを
|1CB704| db $F8 ; row 2
|1CB705| db $09, $31, $21, $0D, $18, $14, $02, $FF ; きみにわたそう␣
|1CB70D| db $CC, $FF, $CC, $FF, $CC ; ⋯␣⋯␣⋯
|1CB712| db $F9 ; row 3
|1CB713| db $FD, $08 ; kanji 頼
|1CB715| db $0F, $2E, $07, $4A, $C7 ; んだよっ!
|1CB71A| db $FB ; end of message

;===================================================================================================
; Stumpy rejected
;===================================================================================================
; ⋯ ⋯ ⋯
; そうかい,じゃあ もういいよ
; さよならっ!
;===================================================================================================
Message_00E5:
|1CB71B| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB721| db $F8 ; row 2
|1CB722| db $14, $02, $08, $01, $C8, $25, $47, $00 ; そうかい,じゃあ
|1CB72A| db $FF, $34, $02, $01, $01, $07 ; ␣もういいよ
|1CB730| db $F9 ; row 3
|1CB731| db $10, $07, $20, $38, $4A, $C7 ; さよならっ!
|1CB737| db $FB ; end of message

;===================================================================================================
; Stumpy when no flute
;===================================================================================================
; オカリナは みつかった?
; ⋯ ⋯ ⋯
; はやく 探しておくれよ。
;===================================================================================================
Message_00E6:
|1CB738| db $54, $58, $89, $70, $28, $FF, $31, $1A ; オカリナは␣みつ
|1CB740| db $08, $4A, $18, $C6 ; かった?
|1CB744| db $F8 ; row 2
|1CB745| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB74B| db $F9 ; row 3
|1CB74C| db $28, $05, $0A, $FF ; はやく␣
|1CB750| db $FD, $69 ; kanji 探
|1CB752| db $11, $1B, $04, $0A, $3B, $07, $CD ; しておくれよ。
|1CB759| db $FB ; end of message

;===================================================================================================
; Stumpy when flute is had
;===================================================================================================
; ありがとう [LINK] ⋯
; でも,ぼくはもう そいつを
; 吹く事は できないみたいだ。
; キミに あずかってほしい。
; そして,ぼくの住んでいた村へ
; 行くことがあったら,
; いねむりばかりしてる
; ジイさんに,わたしてやってよ
; ⋯ ⋯ ⋯
; ああ,いしきがうすれてきた⋯
; お願いだ,さいごにそいつの
; 音色を きかせておくれよ⋯
;===================================================================================================
Message_00E7:
|1CB75A| db $00, $39, $15, $1C, $02, $FF ; ありがとう␣
|1CB760| db $FE, $6A ; write player name
|1CB762| db $FF, $CC ; ␣⋯
|1CB764| db $F8 ; row 2
|1CB765| db $36, $34, $C8, $41, $0A, $28, $34, $02 ; でも,ぼくはもう
|1CB76D| db $FF, $14, $01, $1A, $0E ; ␣そいつを
|1CB772| db $F9 ; row 3
|1CB773| db $FD, $AD ; kanji 吹
|1CB775| db $0A ; く
|1CB776| db $FD, $22 ; kanji 事
|1CB778| db $28, $FF, $36, $09, $20, $01, $31, $18 ; は␣できないみた
|1CB780| db $01, $2E, $CD ; いだ。
|1CB783| db $FA ; wait for key
|1CB784| db $F6 ; scroll
|1CB785| db $59, $81, $21, $FF, $00, $26, $08, $4A ; キミに␣あずかっ
|1CB78D| db $1B, $2C, $11, $01, $CD ; てほしい。
|1CB792| db $F6 ; scroll
|1CB793| db $14, $11, $1B, $C8, $41, $0A, $24 ; そして,ぼくの
|1CB79A| db $FD, $3F ; kanji 住
|1CB79C| db $0F, $36, $01, $18 ; んでいた
|1CB7A0| db $FD, $8C ; kanji 村
|1CB7A2| db $2B ; へ
|1CB7A3| db $F6 ; scroll
|1CB7A4| db $FD, $02 ; kanji 行
|1CB7A6| db $0A, $0C, $1C, $15, $00, $4A, $18, $38 ; くことがあったら
|1CB7AE| db $C8 ; ,
|1CB7AF| db $FA ; wait for key
|1CB7B0| db $F6 ; scroll
|1CB7B1| db $01, $23, $32, $39, $3D, $08, $39, $11 ; いねむりばかりし
|1CB7B9| db $1B, $3A ; てる
|1CB7BB| db $F6 ; scroll
|1CB7BC| db $75, $51, $10, $0F, $21, $C8, $0D, $18 ; ジイさんに,わた
|1CB7C4| db $11, $1B, $05, $4A, $1B, $07 ; してやってよ
|1CB7CA| db $F6 ; scroll
|1CB7CB| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CB7D1| db $FA ; wait for key
|1CB7D2| db $F6 ; scroll
|1CB7D3| db $00, $00, $C8, $01, $11, $09, $15, $02 ; ああ,いしきがう
|1CB7DB| db $12, $3B, $1B, $09, $18, $CC ; すれてきた⋯
|1CB7E1| db $F6 ; scroll
|1CB7E2| db $04 ; お
|1CB7E3| db $FD, $0A ; kanji 願
|1CB7E5| db $01, $2E, $C8, $10, $01, $1E, $21, $14 ; いだ,さいごにそ
|1CB7ED| db $01, $1A, $24 ; いつの
|1CB7F0| db $F6 ; scroll
|1CB7F1| db $FD, $AC ; kanji 音
|1CB7F3| db $FD, $A4 ; kanji 色
|1CB7F5| db $0E, $FF, $09, $08, $13, $1B, $04, $0A ; を␣きかせておく
|1CB7FD| db $3B, $07, $CC ; れよ⋯
|1CB800| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Find Sahasrahla
;===================================================================================================
; ねあ〜ん で〜るた〜る
; まずは,長老サハスラーラを
; 探しなされ〜⋯。
;===================================================================================================
Message_00E8:
|1CB801| db $FE, $6D, $01 ; position: low
|1CB804| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CB80C| db $18, $CE, $3A ; た〜る
|1CB80F| db $F8 ; row 2
|1CB810| db $30, $26, $28, $C8 ; まずは,
|1CB814| db $FD, $8D ; kanji 長
|1CB816| db $FD, $E5 ; kanji 老
|1CB818| db $60, $78, $62, $88, $C9, $88, $0E ; サハスラーラを
|1CB81F| db $F9 ; row 3
|1CB820| db $FD, $69 ; kanji 探
|1CB822| db $11, $20, $10, $3B, $CE, $CC, $CD ; しなされ〜⋯。
|1CB829| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Open Desert Palace with Book of Mudora
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; サバクの入口は村に伝わるムド
; ラの書をもって開かれ〜る。
;===================================================================================================
Message_00E9:
|1CB82A| db $FE, $6D, $01 ; position: low
|1CB82D| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CB835| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CB83B| db $F8 ; row 2
|1CB83C| db $60, $8D, $5A, $24 ; サバクの
|1CB840| db $FD, $49 ; kanji 入
|1CB842| db $FD, $4A ; kanji 口
|1CB844| db $28 ; は
|1CB845| db $FD, $8C ; kanji 村
|1CB847| db $21 ; に
|1CB848| db $FD, $2E ; kanji 伝
|1CB84A| db $0D, $3A, $82, $87 ; わるムド
|1CB84E| db $F9 ; row 3
|1CB84F| db $88, $24 ; ラの
|1CB851| db $FD, $0E ; kanji 書
|1CB853| db $0E, $34, $4A, $1B ; をもって
|1CB857| db $FD, $4B ; kanji 開
|1CB859| db $08, $3B, $CE, $3A, $CD ; かれ〜る。
|1CB85E| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Find Aginah
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; サバクにも賢者のしそんが住ん
; でお〜る。
;===================================================================================================
Message_00EA:
|1CB85F| db $FE, $6D, $01 ; position: low
|1CB862| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CB86A| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CB870| db $F8 ; row 2
|1CB871| db $60, $8D, $5A, $21, $34 ; サバクにも
|1CB876| db $FD, $C4 ; kanji 賢
|1CB878| db $FD, $1E ; kanji 者
|1CB87A| db $24, $11, $14, $0F, $15 ; のしそんが
|1CB87F| db $FD, $3F ; kanji 住
|1CB881| db $0F ; ん
|1CB882| db $F9 ; row 3
|1CB883| db $36, $04, $CE, $3A, $CD ; でお〜る。
|1CB888| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Magic Shop with mushroom
;===================================================================================================
; ねあ〜ん で〜るた〜る
; 森のキノコは,神殿の北の
; 魔法屋にもっていきなされ〜。
;===================================================================================================
Message_00EB:
|1CB889| db $FE, $6D, $01 ; position: low
|1CB88C| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CB894| db $18, $CE, $3A ; た〜る
|1CB897| db $F8 ; row 2
|1CB898| db $FD, $65 ; kanji 森
|1CB89A| db $24, $59, $74, $5C, $28, $C8 ; のキノコは,
|1CB8A0| db $FD, $05 ; kanji 神
|1CB8A2| db $FD, $90 ; kanji 殿
|1CB8A4| db $24 ; の
|1CB8A5| db $FD, $7C ; kanji 北
|1CB8A7| db $24 ; の
|1CB8A8| db $F9 ; row 3
|1CB8A9| db $FD, $2D ; kanji 魔
|1CB8AB| db $FD, $3C ; kanji 法
|1CB8AD| db $FD, $3D ; kanji 屋
|1CB8AF| db $21, $34, $4A, $1B, $01, $09, $20, $10 ; にもっていきなさ
|1CB8B7| db $3B, $CE, $CD ; れ〜。
|1CB8BA| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: King Zora's location
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; 川をず〜とさかのぼった所に
; ゾーラの住む湖があ〜る。
;===================================================================================================
Message_00EC:
|1CB8BB| db $FE, $6D, $01 ; position: low
|1CB8BE| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CB8C6| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CB8CC| db $F8 ; row 2
|1CB8CD| db $FD, $B8 ; kanji 川
|1CB8CF| db $0E, $26, $CE, $1C, $10, $08, $24, $41 ; をず〜とさかのぼ
|1CB8D7| db $4A, $18 ; った
|1CB8D9| db $FD, $55 ; kanji 所
|1CB8DB| db $21 ; に
|1CB8DC| db $F9 ; row 3
|1CB8DD| db $7D, $C9, $88, $24 ; ゾーラの
|1CB8E1| db $FD, $3F ; kanji 住
|1CB8E3| db $32 ; む
|1CB8E4| db $FD, $12 ; kanji 湖
|1CB8E6| db $15, $00, $CE, $3A, $CD ; があ〜る。
|1CB8EB| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Moon Pearl at Tower of Hera
;===================================================================================================
; ねあ〜ん で〜るた〜る
; 山の塔には,ムーンパールなる
; 宝があ〜る。手に入れなされ〜
;===================================================================================================
Message_00ED:
|1CB8EC| db $FE, $6D, $01 ; position: low
|1CB8EF| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CB8F7| db $18, $CE, $3A ; た〜る
|1CB8FA| db $F8 ; row 2
|1CB8FB| db $FD, $94 ; kanji 山
|1CB8FD| db $24 ; の
|1CB8FE| db $FD, $D5 ; kanji 塔
|1CB900| db $21, $28, $C8, $82, $C9, $5F, $92, $C9 ; には,ムーンパー
|1CB908| db $8A, $20, $3A ; ルなる
|1CB90B| db $F9 ; row 3
|1CB90C| db $FD, $9A ; kanji 宝
|1CB90E| db $15, $00, $CE, $3A, $CD ; があ〜る。
|1CB913| db $FD, $3E ; kanji 手
|1CB915| db $21 ; に
|1CB916| db $FD, $49 ; kanji 入
|1CB918| db $3B, $20, $10, $3B, $CE ; れなされ〜
|1CB91D| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Agahnim cannot be hit directly
;===================================================================================================
; ねあ〜ん で〜るた〜る
; マスターソードは,司祭の体を
; 攻撃するための物ではな〜い。
;===================================================================================================
Message_00EE:
|1CB91E| db $FE, $6D, $01 ; position: low
|1CB921| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CB929| db $18, $CE, $3A ; た〜る
|1CB92C| db $F8 ; row 2
|1CB92D| db $80, $62, $68, $C9, $64, $C9, $87, $28 ; マスターソードは
|1CB935| db $C8 ; ,
|1CB936| db $FD, $0D ; kanji 司
|1CB938| db $FD, $17 ; kanji 祭
|1CB93A| db $24 ; の
|1CB93B| db $FD, $BF ; kanji 体
|1CB93D| db $0E ; を
|1CB93E| db $F9 ; row 3
|1CB93F| db $FD, $E2 ; kanji 攻
|1CB941| db $FD, $E3 ; kanji 撃
|1CB943| db $12, $3A, $18, $33, $24 ; するための
|1CB948| db $FD, $51 ; kanji 物
|1CB94A| db $36, $28, $20, $CE, $01, $CD ; ではな〜い。
|1CB950| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Magic bat cave
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; かじ屋の家の前のいどに,とび
; こんでみなさ〜い。
;===================================================================================================
Message_00EF:
|1CB951| db $FE, $6D, $01 ; position: low
|1CB954| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CB95C| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CB962| db $F8 ; row 2
|1CB963| db $08, $25 ; かじ
|1CB965| db $FD, $3D ; kanji 屋
|1CB967| db $24 ; の
|1CB968| db $FD, $56 ; kanji 家
|1CB96A| db $24 ; の
|1CB96B| db $FD, $78 ; kanji 前
|1CB96D| db $24, $01, $37, $21, $C8, $1C, $3E ; のいどに,とび
|1CB974| db $F9 ; row 3
|1CB975| db $0C, $0F, $36, $31, $20, $10, $CE, $01 ; こんでみなさ〜い
|1CB97D| db $CD ; 。
|1CB97E| db $FB ; end of message

;===================================================================================================
; Fortune teller rejected
;===================================================================================================
; ううむ,きょうは,ちょうしが
; 悪うございます。 またの
; おこしをまっておりますぞ。
;===================================================================================================
Message_00F0:
|1CB97F| db $FE, $6D, $01 ; position: low
|1CB982| db $02, $02, $32, $C8, $09, $49, $02, $28 ; ううむ,きょうは
|1CB98A| db $C8, $19, $49, $02, $11, $15 ; ,ちょうしが
|1CB990| db $F8 ; row 2
|1CB991| db $FD, $85 ; kanji 悪
|1CB993| db $02, $1E, $1F, $01, $30, $12, $CD, $FF ; うございます。␣
|1CB99B| db $30, $18, $24 ; またの
|1CB99E| db $F9 ; row 3
|1CB99F| db $04, $0C, $11, $0E, $30, $4A, $1B, $04 ; おこしをまってお
|1CB9A7| db $39, $30, $12, $2D, $CD ; りますぞ。
|1CB9AC| db $FB ; end of message

;===================================================================================================
; Fortune teller offer
;===================================================================================================
; おっ,あなたのカオに良くない
; ソウが出ておりますぞ⋯。
; さ,さ,うらなってしんぜよう
; おやすくしときますよ⋯。
; ▶ うらなってもらう
;   やめておく
;===================================================================================================
Message_00F1:
|1CB9AD| db $FE, $6D, $01 ; position: low
|1CB9B0| db $04, $4A, $C8, $00, $20, $18, $24, $58 ; おっ,あなたのカ
|1CB9B8| db $54, $21 ; オに
|1CB9BA| db $FD, $32 ; kanji 良
|1CB9BC| db $0A, $20, $01 ; くない
|1CB9BF| db $F8 ; row 2
|1CB9C0| db $64, $52, $15 ; ソウが
|1CB9C3| db $FD, $23 ; kanji 出
|1CB9C5| db $1B, $04, $39, $30, $12, $2D, $CC, $CD ; ておりますぞ⋯。
|1CB9CD| db $F9 ; row 3
|1CB9CE| db $10, $C8, $10, $C8, $02, $38, $20, $4A ; さ,さ,うらなっ
|1CB9D6| db $1B, $11, $0F, $27, $07, $02 ; てしんぜよう
|1CB9DC| db $FA ; wait for key
|1CB9DD| db $F6 ; scroll
|1CB9DE| db $04, $05, $12, $0A, $11, $1C, $09, $30 ; おやすくしときま
|1CB9E6| db $12, $07, $CC, $CD ; すよ⋯。
|1CB9EA| db $F6 ; scroll
|1CB9EB| db $FF, $FF, $E4, $FF, $02, $38, $20, $4A ; ␣␣▶␣うらなっ
|1CB9F3| db $1B, $34, $38, $02 ; てもらう
|1CB9F7| db $F6 ; scroll
|1CB9F8| db $FF, $FF, $FF, $FF, $05, $33, $1B, $04 ; ␣␣␣␣やめてお
|1CBA00| db $0A ; く
|1CBA01| db $FE, $68 ; choose 2 low
|1CBA03| db $FB ; end of message

;===================================================================================================
; Fortune teller payment
;===================================================================================================
; それでは [BCD][BCD]ルピーいただき
; ますぞ。では,あなたがゲンキ
; になりますよ〜に,ええいっ!
;===================================================================================================
Message_00F2:
|1CBA04| db $FE, $6D, $01 ; position: low
|1CBA07| db $14, $3B, $36, $28, $FF ; それでは␣
|1CBA0C| db $FE, $6C, $00 ; BCD digit 0
|1CBA0F| db $FE, $6C, $01 ; BCD digit 1
|1CBA12| db $8A, $93, $C9, $01, $18, $2E, $09 ; ルピーいただき
|1CBA19| db $F8 ; row 2
|1CBA1A| db $30, $12, $2D, $CD, $36, $28, $C8, $00 ; ますぞ。では,あ
|1CBA22| db $20, $18, $15, $6D, $5F, $59 ; なたがゲンキ
|1CBA28| db $F9 ; row 3
|1CBA29| db $21, $20, $39, $30, $12, $07, $CE, $21 ; になりますよ〜に
|1CBA31| db $C8, $03, $03, $01, $4A, $C7 ; ,ええいっ!
|1CBA37| db $FB ; end of message

;===================================================================================================
; Fortune teller farewell - accidentally unused
;===================================================================================================
; ううむ,それはザンネン⋯。
; また,おまちしておりますぞ。
;===================================================================================================
Message_00F3:
|1CBA38| db $FE, $6D, $01 ; position: low
|1CBA3B| db $02, $02, $32, $C8, $14, $3B, $28, $6F ; ううむ,それはザ
|1CBA43| db $5F, $73, $5F, $CC, $CD ; ンネン⋯。
|1CBA48| db $F8 ; row 2
|1CBA49| db $30, $18, $C8, $04, $30, $19, $11, $1B ; また,おまちして
|1CBA51| db $04, $39, $30, $12, $2D, $CD ; おりますぞ。
|1CBA57| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Locksmith
;===================================================================================================
; ねあ〜ん で〜るた〜る
; あやしのサバクのあたりに,
; 何か立ってお〜る。
;===================================================================================================
Message_00F4:
|1CBA58| db $FE, $6D, $01 ; position: low
|1CBA5B| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CBA63| db $18, $CE, $3A ; た〜る
|1CBA66| db $F8 ; row 2
|1CBA67| db $00, $05, $11, $24, $60, $8D, $5A, $24 ; あやしのサバクの
|1CBA6F| db $00, $18, $39, $21, $C8 ; あたりに,
|1CBA74| db $F9 ; row 3
|1CBA75| db $FD, $8B ; kanji 何
|1CBA77| db $08 ; か
|1CBA78| db $FD, $71 ; kanji 立
|1CBA7A| db $4A, $1B, $04, $CE, $3A, $CD ; ってお〜る。
|1CBA80| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Gossip shop
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; 宝箱のことは闇世界の洞くつ
; に住む,じょうほう屋にきけ〜
;===================================================================================================
Message_00F5:
|1CBA81| db $FE, $6D, $01 ; position: low
|1CBA84| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CBA8C| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CBA92| db $F8 ; row 2
|1CBA93| db $FD, $9A ; kanji 宝
|1CBA95| db $FD, $EA ; kanji 箱
|1CBA97| db $24, $0C, $1C, $28 ; のことは
|1CBA9B| db $FD, $57 ; kanji 闇
|1CBA9D| db $FD, $E8 ; kanji 世
|1CBA9F| db $FD, $E9 ; kanji 界
|1CBAA1| db $24 ; の
|1CBAA2| db $FD, $EF ; kanji 洞
|1CBAA4| db $0A, $1A ; くつ
|1CBAA6| db $F9 ; row 3
|1CBAA7| db $21 ; に
|1CBAA8| db $FD, $3F ; kanji 住
|1CBAAA| db $32, $C8, $25, $49, $02, $2C, $02 ; む,じょうほう
|1CBAB1| db $FD, $3D ; kanji 屋
|1CBAB3| db $21, $09, $0B, $CE ; にきけ〜
|1CBAB7| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Frog location
;===================================================================================================
; ねあ〜ん で〜るた〜る
; かじ屋のあいぼうは,はぐれ者
; の村のはずれにお〜る。
;===================================================================================================
Message_00F6:
|1CBAB8| db $FE, $6D, $01 ; position: low
|1CBABB| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CBAC3| db $18, $CE, $3A ; た〜る
|1CBAC6| db $F8 ; row 2
|1CBAC7| db $08, $25 ; かじ
|1CBAC9| db $FD, $3D ; kanji 屋
|1CBACB| db $24, $00, $01, $41, $02, $28, $C8, $28 ; のあいぼうは,は
|1CBAD3| db $17, $3B ; ぐれ
|1CBAD5| db $FD, $1E ; kanji 者
|1CBAD7| db $F9 ; row 3
|1CBAD8| db $24 ; の
|1CBAD9| db $FD, $8C ; kanji 村
|1CBADB| db $24, $28, $26, $3B, $21, $04, $CE, $3A ; のはずれにお〜る
|1CBAE3| db $CD ; 。
|1CBAE4| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Graveyard ledge
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; 光世界のハカ場には,宝が1つ
; ねむってお〜る。
;===================================================================================================
Message_00F7:
|1CBAE5| db $FE, $6D, $01 ; position: low
|1CBAE8| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CBAF0| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CBAF6| db $F8 ; row 2
|1CBAF7| db $FD, $73 ; kanji 光
|1CBAF9| db $FD, $E8 ; kanji 世
|1CBAFB| db $FD, $E9 ; kanji 界
|1CBAFD| db $24, $78, $58 ; のハカ
|1CBB00| db $FD, $A8 ; kanji 場
|1CBB02| db $21, $28, $C8 ; には,
|1CBB05| db $FD, $9A ; kanji 宝
|1CBB07| db $15, $A1, $1A ; が1つ
|1CBB0A| db $F9 ; row 3
|1CBB0B| db $23, $32, $4A, $1B, $04, $CE, $3A, $CD ; ねむってお〜る。
|1CBB13| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Bomb Shop
;===================================================================================================
; ねあ〜ん で〜るた〜る
; バクダン屋では,新しい
; バクダンもうってる事があ〜る
;===================================================================================================
Message_00F8:
|1CBB14| db $FE, $6D, $01 ; position: low
|1CBB17| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CBB1F| db $18, $CE, $3A ; た〜る
|1CBB22| db $F8 ; row 2
|1CBB23| db $8D, $5A, $7E, $5F ; バクダン
|1CBB27| db $FD, $3D ; kanji 屋
|1CBB29| db $36, $28, $C8 ; では,
|1CBB2C| db $FD, $E7 ; kanji 新
|1CBB2E| db $11, $01 ; しい
|1CBB30| db $F9 ; row 3
|1CBB31| db $8D, $5A, $7E, $5F, $34, $02, $4A, $1B ; バクダンもうって
|1CBB39| db $3A ; る
|1CBB3A| db $FD, $22 ; kanji 事
|1CBB3C| db $15, $00, $CE, $3A ; があ〜る
|1CBB40| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Pyramid fairy
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; 闇世界のピラミッドの中には
; 何かあ〜る。
;===================================================================================================
Message_00F9:
|1CBB41| db $FE, $6D, $01 ; position: low
|1CBB44| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CBB4C| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CBB52| db $F8 ; row 2
|1CBB53| db $FD, $57 ; kanji 闇
|1CBB55| db $FD, $E8 ; kanji 世
|1CBB57| db $FD, $E9 ; kanji 界
|1CBB59| db $24, $93, $88, $81, $9A, $87, $24 ; のピラミッドの
|1CBB60| db $FD, $AE ; kanji 中
|1CBB62| db $21, $28 ; には
|1CBB64| db $F9 ; row 3
|1CBB65| db $FD, $8B ; kanji 何
|1CBB67| db $08, $00, $CE, $3A, $CD ; かあ〜る。
|1CBB6C| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Ganon's Tower locked
;===================================================================================================
; ねあ〜ん で〜るた〜る
; ガノンの塔はデスマウンテンに
; 結界に守られ立ってお〜る。
;===================================================================================================
Message_00FA:
|1CBB6D| db $FE, $6D, $01 ; position: low
|1CBB70| db $23, $00, $CE, $0F, $FF, $36, $CE, $3A ; ねあ〜ん␣で〜る
|1CBB78| db $18, $CE, $3A ; た〜る
|1CBB7B| db $F8 ; row 2
|1CBB7C| db $65, $74, $5F, $24 ; ガノンの
|1CBB80| db $FD, $D5 ; kanji 塔
|1CBB82| db $28, $86, $62, $80, $52, $5F, $6B, $5F ; はデスマウンテン
|1CBB8A| db $21 ; に
|1CBB8B| db $F9 ; row 3
|1CBB8C| db $FD, $83 ; kanji 結
|1CBB8E| db $FD, $E9 ; kanji 界
|1CBB90| db $21 ; に
|1CBB91| db $FD, $91 ; kanji 守
|1CBB93| db $38, $3B ; られ
|1CBB95| db $FD, $71 ; kanji 立
|1CBB97| db $4A, $1B, $04, $CE, $3A, $CD ; ってお〜る。
|1CBB9D| db $FB ; end of message

;===================================================================================================
; Fortune teller hint: Silver arrows required for Ganon
;===================================================================================================
; くろまによ〜んくろまによ〜ん
; ガノンのとどめをさすには,
; 『銀の矢』が必要じゃあ〜。
;===================================================================================================
Message_00FB:
|1CBB9E| db $FE, $6D, $01 ; position: low
|1CBBA1| db $0A, $3C, $30, $21, $07, $CE, $0F, $0A ; くろまによ〜んく
|1CBBA9| db $3C, $30, $21, $07, $CE, $0F ; ろまによ〜ん
|1CBBAF| db $F8 ; row 2
|1CBBB0| db $65, $74, $5F, $24, $1C, $37, $33, $0E ; ガノンのとどめを
|1CBBB8| db $10, $12, $21, $28, $C8 ; さすには,
|1CBBBD| db $F9 ; row 3
|1CBBBE| db $C4 ; 『
|1CBBBF| db $FD, $DE ; kanji 銀
|1CBBC1| db $24 ; の
|1CBBC2| db $FD, $BB ; kanji 矢
|1CBBC4| db $C5, $15 ; 』が
|1CBBC6| db $FD, $30 ; kanji 必
|1CBBC8| db $FD, $31 ; kanji 要
|1CBBCA| db $25, $47, $00, $CE, $CD ; じゃあ〜。
|1CBBCF| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC offer
;===================================================================================================
; なあ,あんた20ルピーほど
; めぐんでくれたら,いい話を
; きかせてやるぜ⋯。
; どうだい?
; ▶ ルピーをはらう
;   ききたくない
;===================================================================================================
Message_00FC:
|1CBBD0| db $20, $00, $C8, $00, $0F, $18, $A2, $A0 ; なあ,あんた20
|1CBBD8| db $8A, $93, $C9, $2C, $37 ; ルピーほど
|1CBBDD| db $F8 ; row 2
|1CBBDE| db $33, $17, $0F, $36, $0A, $3B, $18, $38 ; めぐんでくれたら
|1CBBE6| db $C8, $01, $01 ; ,いい
|1CBBE9| db $FD, $A3 ; kanji 話
|1CBBEB| db $0E ; を
|1CBBEC| db $F9 ; row 3
|1CBBED| db $09, $08, $13, $1B, $05, $3A, $27, $CC ; きかせてやるぜ⋯
|1CBBF5| db $CD ; 。
|1CBBF6| db $FA ; wait for key
|1CBBF7| db $F6 ; scroll
|1CBBF8| db $37, $02, $2E, $01, $C6 ; どうだい?
|1CBBFD| db $F6 ; scroll
|1CBBFE| db $FF, $FF, $E4, $FF, $8A, $93, $C9, $0E ; ␣␣▶␣ルピーを
|1CBC06| db $28, $38, $02 ; はらう
|1CBC09| db $F6 ; scroll
|1CBC0A| db $FF, $FF, $FF, $FF, $09, $09, $18, $0A ; ␣␣␣␣ききたく
|1CBC12| db $20, $01 ; ない
|1CBC14| db $FE, $68 ; choose 2 low
|1CBC16| db $FB ; end of message

;===================================================================================================
; Dark World hint bird's story
;===================================================================================================
; へへっ ありがとうよっ。
; じつはな,この世界の川を
; ずっとさかのぼったところに
; ちょっとした いけがあるって
; 事だ。そこに,何か投げこんで
; みるといいぜっ。
; 何がおこるかは,知らねなあ。
; へへっ,それじゃあな⋯。
;===================================================================================================
Message_00FD:
|1CBC17| db $2B, $2B, $4A, $FF, $00, $39, $15, $1C ; へへっ␣ありがと
|1CBC1F| db $02, $07, $4A, $CD ; うよっ。
|1CBC23| db $F8 ; row 2
|1CBC24| db $25, $1A, $28, $20, $C8, $0C, $24 ; じつはな,この
|1CBC2B| db $FD, $E8 ; kanji 世
|1CBC2D| db $FD, $E9 ; kanji 界
|1CBC2F| db $24 ; の
|1CBC30| db $FD, $B8 ; kanji 川
|1CBC32| db $0E ; を
|1CBC33| db $F9 ; row 3
|1CBC34| db $26, $4A, $1C, $10, $08, $24, $41, $4A ; ずっとさかのぼっ
|1CBC3C| db $18, $1C, $0C, $3C, $21 ; たところに
|1CBC41| db $FA ; wait for key
|1CBC42| db $F6 ; scroll
|1CBC43| db $19, $49, $4A, $1C, $11, $18, $FF, $01 ; ちょっとした␣い
|1CBC4B| db $0B, $15, $00, $3A, $4A, $1B ; けがあるって
|1CBC51| db $F6 ; scroll
|1CBC52| db $FD, $22 ; kanji 事
|1CBC54| db $2E, $CD, $14, $0C, $21, $C8 ; だ。そこに,
|1CBC5A| db $FD, $8B ; kanji 何
|1CBC5C| db $08 ; か
|1CBC5D| db $FD, $FC ; kanji 投
|1CBC5F| db $1D, $0C, $0F, $36 ; げこんで
|1CBC63| db $F6 ; scroll
|1CBC64| db $31, $3A, $1C, $01, $01, $27, $4A, $CD ; みるといいぜっ。
|1CBC6C| db $FA ; wait for key
|1CBC6D| db $F6 ; scroll
|1CBC6E| db $FD, $8B ; kanji 何
|1CBC70| db $15, $04, $0C, $3A, $08, $28, $C8 ; がおこるかは,
|1CBC77| db $FD, $93 ; kanji 知
|1CBC79| db $38, $23, $20, $00, $CD ; らねなあ。
|1CBC7E| db $F6 ; scroll
|1CBC7F| db $2B, $2B, $4A, $C8, $14, $3B, $25, $47 ; へへっ,それじゃ
|1CBC87| db $00, $20, $CC, $CD ; あな⋯。
|1CBC8B| db $F6 ; scroll
|1CBC8C| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC is not interested in poor people
;===================================================================================================
; へへっ,そうかい。
; ルピーのないやつには,きょー
; みがないね。あっちへ行きな!
;===================================================================================================
Message_00FE:
|1CBC8D| db $2B, $2B, $4A, $C8, $14, $02, $08, $01 ; へへっ,そうかい
|1CBC95| db $CD ; 。
|1CBC96| db $F8 ; row 2
|1CBC97| db $8A, $93, $C9, $24, $20, $01, $05, $1A ; ルピーのないやつ
|1CBC9F| db $21, $28, $C8, $09, $49, $C9 ; には,きょー
|1CBCA5| db $F9 ; row 3
|1CBCA6| db $31, $15, $20, $01, $23, $CD, $00, $4A ; みがないね。あっ
|1CBCAE| db $19, $2B ; ちへ
|1CBCB0| db $FD, $02 ; kanji 行
|1CBCB2| db $09, $20, $C7 ; きな!
|1CBCB5| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC glover's story
;===================================================================================================
; へへっ ありがとよっ。
; じつはな,表の世界じゃおれも
; 盗賊だったんだよ⋯。
; その時のなかまで,つかまるの
; をこわがって,逃げたやつがい
; るんだ。
; やつは,カギあけの名人だった
; んだが,今は盗賊だった事を
; かくそうとしてるらしいぜ⋯。
; へんなおじさんのふりをしてな
; へッへッへ⋯。
;===================================================================================================
Message_00FF:
|1CBCB6| db $2B, $2B, $4A, $FF, $00, $39, $15, $1C ; へへっ␣ありがと
|1CBCBE| db $07, $4A, $CD ; よっ。
|1CBCC1| db $F8 ; row 2
|1CBCC2| db $25, $1A, $28, $20, $C8 ; じつはな,
|1CBCC7| db $FD, $42 ; kanji 表
|1CBCC9| db $24 ; の
|1CBCCA| db $FD, $E8 ; kanji 世
|1CBCCC| db $FD, $E9 ; kanji 界
|1CBCCE| db $25, $47, $04, $3B, $34 ; じゃおれも
|1CBCD3| db $F9 ; row 3
|1CBCD4| db $FD, $F1 ; kanji 盗
|1CBCD6| db $FD, $EE ; kanji 賊
|1CBCD8| db $2E, $4A, $18, $0F, $2E, $07, $CC, $CD ; だったんだよ⋯。
|1CBCE0| db $FA ; wait for key
|1CBCE1| db $F6 ; scroll
|1CBCE2| db $14, $24 ; その
|1CBCE4| db $FD, $88 ; kanji 時
|1CBCE6| db $24, $20, $08, $30, $36, $C8, $1A, $08 ; のなかまで,つか
|1CBCEE| db $30, $3A, $24 ; まるの
|1CBCF1| db $F6 ; scroll
|1CBCF2| db $0E, $0C, $0D, $15, $4A, $1B, $C8 ; をこわがって,
|1CBCF9| db $FD, $DD ; kanji 逃
|1CBCFB| db $1D, $18, $05, $1A, $15, $01 ; げたやつがい
|1CBD01| db $F6 ; scroll
|1CBD02| db $3A, $0F, $2E, $CD ; るんだ。
|1CBD06| db $FA ; wait for key
|1CBD07| db $F6 ; scroll
|1CBD08| db $05, $1A, $28, $C8, $58, $66, $00, $0B ; やつは,カギあけ
|1CBD10| db $24 ; の
|1CBD11| db $FD, $6F ; kanji 名
|1CBD13| db $FD, $38 ; kanji 人
|1CBD15| db $2E, $4A, $18 ; だった
|1CBD18| db $F6 ; scroll
|1CBD19| db $0F, $2E, $15, $C8 ; んだが,
|1CBD1D| db $FD, $6A ; kanji 今
|1CBD1F| db $28 ; は
|1CBD20| db $FD, $F1 ; kanji 盗
|1CBD22| db $FD, $EE ; kanji 賊
|1CBD24| db $2E, $4A, $18 ; だった
|1CBD27| db $FD, $22 ; kanji 事
|1CBD29| db $0E ; を
|1CBD2A| db $F6 ; scroll
|1CBD2B| db $08, $0A, $14, $02, $1C, $11, $1B, $3A ; かくそうとしてる
|1CBD33| db $38, $11, $01, $27, $CC, $CD ; らしいぜ⋯。
|1CBD39| db $FA ; wait for key
|1CBD3A| db $F6 ; scroll
|1CBD3B| db $2B, $0F, $20, $04, $25, $10, $0F, $24 ; へんなおじさんの
|1CBD43| db $2A, $39, $0E, $11, $1B, $20 ; ふりをしてな
|1CBD49| db $F6 ; scroll
|1CBD4A| db $2B, $9A, $2B, $9A, $2B, $CC, $CD ; へッへッへ⋯。
|1CBD51| db $F6 ; scroll
|1CBD52| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC octopus's story
;===================================================================================================
; へへっ ありがとうよっ。
; じつはな,この世界のピラミッ
; ドのなかで,ものすげ〜美人を
; みつけたんだよ。 けどよ,誰
; かが,入口をふさいじまったん
; だ。
; ふつうのバクダンじゃ,どうし
; ようもねえって話だぜ⋯。
;===================================================================================================
Message_0100:
|1CBD53| db $2B, $2B, $4A, $FF, $00, $39, $15, $1C ; へへっ␣ありがと
|1CBD5B| db $02, $07, $4A, $CD ; うよっ。
|1CBD5F| db $F8 ; row 2
|1CBD60| db $25, $1A, $28, $20, $C8, $0C, $24 ; じつはな,この
|1CBD67| db $FD, $E8 ; kanji 世
|1CBD69| db $FD, $E9 ; kanji 界
|1CBD6B| db $24, $93, $88, $81, $9A ; のピラミッ
|1CBD70| db $F9 ; row 3
|1CBD71| db $87, $24, $20, $08, $36, $C8, $34, $24 ; ドのなかで,もの
|1CBD79| db $12, $1D, $CE ; すげ〜
|1CBD7C| db $FD, $68 ; kanji 美
|1CBD7E| db $FD, $38 ; kanji 人
|1CBD80| db $0E ; を
|1CBD81| db $FA ; wait for key
|1CBD82| db $F6 ; scroll
|1CBD83| db $31, $1A, $0B, $18, $0F, $2E, $07, $CD ; みつけたんだよ。
|1CBD8B| db $FF, $0B, $37, $07, $C8 ; ␣けどよ,
|1CBD90| db $FD, $95 ; kanji 誰
|1CBD92| db $F6 ; scroll
|1CBD93| db $08, $15, $C8 ; かが,
|1CBD96| db $FD, $49 ; kanji 入
|1CBD98| db $FD, $4A ; kanji 口
|1CBD9A| db $0E, $2A, $10, $01, $25, $30, $4A, $18 ; をふさいじまった
|1CBDA2| db $0F ; ん
|1CBDA3| db $F6 ; scroll
|1CBDA4| db $2E, $CD ; だ。
|1CBDA6| db $FA ; wait for key
|1CBDA7| db $F6 ; scroll
|1CBDA8| db $2A, $1A, $02, $24, $8D, $5A, $7E, $5F ; ふつうのバクダン
|1CBDB0| db $25, $47, $C8, $37, $02, $11 ; じゃ,どうし
|1CBDB6| db $F6 ; scroll
|1CBDB7| db $07, $02, $34, $23, $03, $4A, $1B ; ようもねえって
|1CBDBE| db $FD, $A3 ; kanji 話
|1CBDC0| db $2E, $27, $CC, $CD ; だぜ⋯。
|1CBDC4| db $F6 ; scroll
|1CBDC5| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC watto's story
;===================================================================================================
; へへっ ありがとうよっ。
; じつはこの剣は,ヌマに住む
; 魔物がふらせてるらしいぜ。
; 魔物の力をうわまわる力で,
; 空気をうごかせば,剣もやむだ
; ろうよ。
;===================================================================================================
Message_0101:
|1CBDC6| db $2B, $2B, $4A, $FF, $00, $39, $15, $1C ; へへっ␣ありがと
|1CBDCE| db $02, $07, $4A, $CD ; うよっ。
|1CBDD2| db $F8 ; row 2
|1CBDD3| db $25, $1A, $28, $0C, $24 ; じつはこの
|1CBDD8| db $FD, $19 ; kanji 剣
|1CBDDA| db $28, $C8, $72, $80, $21 ; は,ヌマに
|1CBDDF| db $FD, $3F ; kanji 住
|1CBDE1| db $32 ; む
|1CBDE2| db $F9 ; row 3
|1CBDE3| db $FD, $2D ; kanji 魔
|1CBDE5| db $FD, $51 ; kanji 物
|1CBDE7| db $15, $2A, $38, $13, $1B, $3A, $38, $11 ; がふらせてるらし
|1CBDEF| db $01, $27, $CD ; いぜ。
|1CBDF2| db $FA ; wait for key
|1CBDF3| db $F6 ; scroll
|1CBDF4| db $FD, $2D ; kanji 魔
|1CBDF6| db $FD, $51 ; kanji 物
|1CBDF8| db $24 ; の
|1CBDF9| db $FD, $99 ; kanji 力
|1CBDFB| db $0E, $02, $0D, $30, $0D, $3A ; をうわまわる
|1CBE01| db $FD, $99 ; kanji 力
|1CBE03| db $36, $C8 ; で,
|1CBE05| db $F6 ; scroll
|1CBE06| db $FD, $AA ; kanji 空
|1CBE08| db $FD, $37 ; kanji 気
|1CBE0A| db $0E, $02, $1E, $08, $13, $3D, $C8 ; をうごかせば,
|1CBE11| db $FD, $19 ; kanji 剣
|1CBE13| db $34, $05, $32, $2E ; もやむだ
|1CBE17| db $F6 ; scroll
|1CBE18| db $3C, $02, $07, $CD ; ろうよ。
|1CBE1C| db $FB ; end of message

;===================================================================================================
; Sick kid asking for bottle
;===================================================================================================
; ゴホゴホ [LINK]にいちゃん
; ムシを入れるビンをもってる?
; ⋯そう,もってないの ゴホッ
;===================================================================================================
Message_0102:
|1CBE1D| db $FE, $6D, $01 ; position: low
|1CBE20| db $6E, $7C, $6E, $7C, $FF ; ゴホゴホ␣
|1CBE25| db $FE, $6A ; write player name
|1CBE27| db $21, $01, $19, $47, $0F ; にいちゃん
|1CBE2C| db $F8 ; row 2
|1CBE2D| db $82, $61, $0E ; ムシを
|1CBE30| db $FD, $49 ; kanji 入
|1CBE32| db $3B, $3A, $8E, $5F, $0E, $34, $4A, $1B ; れるビンをもって
|1CBE3A| db $3A, $C6 ; る?
|1CBE3C| db $F9 ; row 3
|1CBE3D| db $CC, $14, $02, $C8, $34, $4A, $1B, $20 ; ⋯そう,もってな
|1CBE45| db $01, $24, $FF, $6E, $7C, $9A ; いの␣ゴホッ
|1CBE4B| db $FB ; end of message

;===================================================================================================
; Sick kid gifting net
;===================================================================================================
; ぼくは,体がよわくって
; そとに出られないんだ⋯。
; ゴホ ゴホ ⋯
; 森や,山からながれてくる,
; 魔物の気にやられたんだろうっ
; てみんな言ってるけど⋯ゴホ
; これは,ゲンキになったら使う
; つもりのムシ取りあみだけど,
; おにいちゃんにかしてあげるよ
;===================================================================================================
Message_0103:
|1CBE4C| db $FE, $6D, $01 ; position: low
|1CBE4F| db $41, $0A, $28, $C8 ; ぼくは,
|1CBE53| db $FD, $BF ; kanji 体
|1CBE55| db $15, $07, $0D, $0A, $4A, $1B ; がよわくって
|1CBE5B| db $F8 ; row 2
|1CBE5C| db $14, $1C, $21 ; そとに
|1CBE5F| db $FD, $23 ; kanji 出
|1CBE61| db $38, $3B, $20, $01, $0F, $2E, $CC, $CD ; られないんだ⋯。
|1CBE69| db $F9 ; row 3
|1CBE6A| db $6E, $7C, $FF, $6E, $7C, $FF, $CC ; ゴホ␣ゴホ␣⋯
|1CBE71| db $FA ; wait for key
|1CBE72| db $F6 ; scroll
|1CBE73| db $FD, $65 ; kanji 森
|1CBE75| db $05, $C8 ; や,
|1CBE77| db $FD, $94 ; kanji 山
|1CBE79| db $08, $38, $20, $15, $3B, $1B, $0A, $3A ; からながれてくる
|1CBE81| db $C8 ; ,
|1CBE82| db $F6 ; scroll
|1CBE83| db $FD, $2D ; kanji 魔
|1CBE85| db $FD, $51 ; kanji 物
|1CBE87| db $24 ; の
|1CBE88| db $FD, $37 ; kanji 気
|1CBE8A| db $21, $05, $38, $3B, $18, $0F, $2E, $3C ; にやられたんだろ
|1CBE92| db $02, $4A ; うっ
|1CBE94| db $F6 ; scroll
|1CBE95| db $1B, $31, $0F, $20 ; てみんな
|1CBE99| db $FD, $16 ; kanji 言
|1CBE9B| db $4A, $1B, $3A, $0B, $37, $CC, $6E, $7C ; ってるけど⋯ゴホ
|1CBEA3| db $FA ; wait for key
|1CBEA4| db $F6 ; scroll
|1CBEA5| db $0C, $3B, $28, $C8, $6D, $5F, $59, $21 ; これは,ゲンキに
|1CBEAD| db $20, $4A, $18, $38 ; なったら
|1CBEB1| db $FD, $89 ; kanji 使
|1CBEB3| db $02 ; う
|1CBEB4| db $F6 ; scroll
|1CBEB5| db $1A, $34, $39, $24, $82, $61 ; つもりのムシ
|1CBEBB| db $FD, $47 ; kanji 取
|1CBEBD| db $39, $00, $31, $2E, $0B, $37, $C8 ; りあみだけど,
|1CBEC4| db $F6 ; scroll
|1CBEC5| db $04, $21, $01, $19, $47, $0F, $21, $08 ; おにいちゃんにか
|1CBECD| db $11, $1B, $00, $1D, $3A, $07 ; してあげるよ
|1CBED3| db $FB ; end of message

;===================================================================================================
; Sick kid pitying himself
;===================================================================================================
; あーあ はやくゲンキに
; なりたいなあ⋯。
; ゴホ ゴホ ⋯
;===================================================================================================
Message_0104:
|1CBED4| db $FE, $6D, $01 ; position: low
|1CBED7| db $00, $C9, $00, $FF, $28, $05, $0A, $6D ; あーあ␣はやくゲ
|1CBEDF| db $5F, $59, $21 ; ンキに
|1CBEE2| db $F8 ; row 2
|1CBEE3| db $20, $39, $18, $01, $20, $00, $CC, $CD ; なりたいなあ⋯。
|1CBEEB| db $F9 ; row 3
|1CBEEC| db $6E, $7C, $FF, $6E, $7C, $FF, $CC ; ゴホ␣ゴホ␣⋯
|1CBEF3| db $FB ; end of message

;===================================================================================================
; Locksmith bored
;===================================================================================================
; ⋯⋯⋯⋯⋯⋯⋯⋯⋯
;===================================================================================================
Message_0105:
|1CBEF4| db $FF, $CC, $CC, $CC, $CC, $CC, $CC, $CC ; ␣⋯⋯⋯⋯⋯⋯⋯
|1CBEFC| db $CC, $CC ; ⋯⋯
|1CBEFE| db $FB ; end of message

;===================================================================================================
; Locksmith unrepairably depressed about the loss of his sign
;===================================================================================================
; どうして⋯⋯⋯⋯⋯
;===================================================================================================
Message_0106:
|1CBEFF| db $FF, $37, $02, $11, $1B, $CC, $CC, $CC ; ␣どうして⋯⋯⋯
|1CBF07| db $CC, $CC ; ⋯⋯
|1CBF09| db $FB ; end of message

;===================================================================================================
; Locksmith: please keep my identity a secret
;===================================================================================================
; おれが,昔盗賊だった事を
; 知っているって?
; なあ,宝箱を開けてやるから
; みんなには,ナイショにして
; くれないかい?
; やくそくしてくれるかい?
; ▶ やくそくする
;   いいふらす
;===================================================================================================
Message_0107:
|1CBF0A| db $04, $3B, $15, $C8 ; おれが,
|1CBF0E| db $FD, $7E ; kanji 昔
|1CBF10| db $FD, $F1 ; kanji 盗
|1CBF12| db $FD, $EE ; kanji 賊
|1CBF14| db $2E, $4A, $18 ; だった
|1CBF17| db $FD, $22 ; kanji 事
|1CBF19| db $0E ; を
|1CBF1A| db $F8 ; row 2
|1CBF1B| db $FD, $93 ; kanji 知
|1CBF1D| db $4A, $1B, $01, $3A, $4A, $1B, $C6 ; っているって?
|1CBF24| db $F9 ; row 3
|1CBF25| db $FA ; wait for key
|1CBF26| db $F6 ; scroll
|1CBF27| db $20, $00, $C8 ; なあ,
|1CBF2A| db $FD, $9A ; kanji 宝
|1CBF2C| db $FD, $EA ; kanji 箱
|1CBF2E| db $0E ; を
|1CBF2F| db $FD, $4B ; kanji 開
|1CBF31| db $0B, $1B, $05, $3A, $08, $38 ; けてやるから
|1CBF37| db $F6 ; scroll
|1CBF38| db $31, $0F, $20, $21, $28, $C8, $70, $51 ; みんなには,ナイ
|1CBF40| db $61, $99, $21, $11, $1B ; ショにして
|1CBF45| db $F6 ; scroll
|1CBF46| db $0A, $3B, $20, $01, $08, $01, $C6 ; くれないかい?
|1CBF4D| db $FA ; wait for key
|1CBF4E| db $F6 ; scroll
|1CBF4F| db $05, $0A, $14, $0A, $11, $1B, $0A, $3B ; やくそくしてくれ
|1CBF57| db $3A, $08, $01, $C6 ; るかい?
|1CBF5B| db $F6 ; scroll
|1CBF5C| db $FF, $FF, $E4, $FF, $05, $0A, $14, $0A ; ␣␣▶␣やくそく
|1CBF64| db $12, $3A ; する
|1CBF66| db $F6 ; scroll
|1CBF67| db $FF, $FF, $FF, $FF, $01, $01, $2A, $38 ; ␣␣␣␣いいふら
|1CBF6F| db $12 ; す
|1CBF70| db $FE, $68 ; choose 2 low
|1CBF72| db $FB ; end of message

;===================================================================================================
; Locksmith: I cast upon thee the damnation of an eternal purple chest!
;===================================================================================================
; それなら,いつまでも宝箱を
; ひきずってるがいいさ!
;===================================================================================================
Message_0108:
|1CBF73| db $14, $3B, $20, $38, $C8, $01, $1A, $30 ; それなら,いつま
|1CBF7B| db $36, $34 ; でも
|1CBF7D| db $FD, $9A ; kanji 宝
|1CBF7F| db $FD, $EA ; kanji 箱
|1CBF81| db $0E ; を
|1CBF82| db $F8 ; row 2
|1CBF83| db $29, $09, $26, $4A, $1B, $3A, $15, $01 ; ひきずってるがい
|1CBF8B| db $01, $10, $C7 ; いさ!
|1CBF8E| db $FB ; end of message

;===================================================================================================
; Locksmith: Remember—this is our little secret. ;)
;===================================================================================================
; だれにも,言わないで
; おくれよ⋯。
;===================================================================================================
Message_0109:
|1CBF8F| db $2E, $3B, $21, $34, $C8 ; だれにも,
|1CBF94| db $FD, $16 ; kanji 言
|1CBF96| db $0D, $20, $01, $36 ; わないで
|1CBF9A| db $F8 ; row 2
|1CBF9B| db $04, $0A, $3B, $07, $CC, $CD ; おくれよ⋯。
|1CBFA1| db $FB ; end of message

;===================================================================================================
; Locksmith: bring the chest here
;===================================================================================================
; よし,それならここへ宝箱を
; 持っておいでよ⋯ 本当に
; みんなにはナイショだよ。
;===================================================================================================
Message_010A:
|1CBFA2| db $07, $11, $C8, $14, $3B, $20, $38, $0C ; よし,それならこ
|1CBFAA| db $0C, $2B ; こへ
|1CBFAC| db $FD, $9A ; kanji 宝
|1CBFAE| db $FD, $EA ; kanji 箱
|1CBFB0| db $0E ; を
|1CBFB1| db $F8 ; row 2
|1CBFB2| db $FD, $DB ; kanji 持
|1CBFB4| db $4A, $1B, $04, $01, $36, $07, $CC, $FF ; っておいでよ⋯␣
|1CBFBC| db $FD, $24 ; kanji 本
|1CBFBE| db $FD, $25 ; kanji 当
|1CBFC0| db $21 ; に
|1CBFC1| db $F9 ; row 3
|1CBFC2| db $31, $0F, $20, $21, $28, $70, $51, $61 ; みんなにはナイシ
|1CBFCA| db $99, $2E, $07, $CD ; ョだよ。
|1CBFCE| db $FB ; end of message

;===================================================================================================
; Medallion tablet untranslated
;===================================================================================================
; ☥☥ ☥𓄿≈☥≈ ≈𓄿≈
; ≈𓄿𓄿 ≈𓄿𓄿≈☥
; ≈≈𓄿☥≈ 𓄿≈☥☥𓄿
;===================================================================================================
Message_010B:
|1CBFCF| db $DE, $DE, $FF, $DE, $DD, $DF, $DE, $DF ; ☥☥␣☥𓄿≈☥≈
|1CBFD7| db $FF, $DF, $DD, $DF ; ␣≈𓄿≈
|1CBFDB| db $F8 ; row 2
|1CBFDC| db $DF, $DD, $DD, $FF, $DF, $DD, $DD, $DF ; ≈𓄿𓄿␣≈𓄿𓄿≈
|1CBFE4| db $DE ; ☥
|1CBFE5| db $F9 ; row 3
|1CBFE6| db $DF, $DF, $DD, $DE, $DF, $FF, $DD, $DF ; ≈≈𓄿☥≈␣𓄿≈
|1CBFEE| db $DE, $DE, $DD ; ☥☥𓄿
|1CBFF1| db $FB ; end of message

;===================================================================================================
; Ether tablet translated
;===================================================================================================
; マスターソードを かかげよ
; されば エーテルの魔法を
; えられん。
;===================================================================================================
Message_010C:
|1CBFF2| db $80, $62, $68, $C9, $64, $C9, $87, $0E ; マスターソードを
|1CBFFA| db $FF, $08, $08, $1D, $07 ; ␣かかげよ
|1CBFFF| db $F8 ; row 2
|1CC000| db $10, $3B, $3D, $FF, $53, $C9, $6B, $8A ; されば␣エーテル
|1CC008| db $24 ; の
|1CC009| db $FD, $2D ; kanji 魔
|1CC00B| db $FD, $3C ; kanji 法
|1CC00D| db $0E ; を
|1CC00E| db $F9 ; row 3
|1CC00F| db $03, $38, $3B, $0F, $CD ; えられん。
|1CC014| db $FB ; end of message

;===================================================================================================
; Bombos tablet translated
;===================================================================================================
; マスターソードを かかげよ
; されば ボンバーの魔法を
; えられん。
;===================================================================================================
Message_010D:
|1CC015| db $80, $62, $68, $C9, $64, $C9, $87, $0E ; マスターソードを
|1CC01D| db $FF, $08, $08, $1D, $07 ; ␣かかげよ
|1CC022| db $F8 ; row 2
|1CC023| db $10, $3B, $3D, $FF, $91, $5F, $8D, $C9 ; されば␣ボンバー
|1CC02B| db $24 ; の
|1CC02C| db $FD, $2D ; kanji 魔
|1CC02E| db $FD, $3C ; kanji 法
|1CC030| db $0E ; を
|1CC031| db $F9 ; row 3
|1CC032| db $03, $38, $3B, $0F, $CD ; えられん。
|1CC037| db $FB ; end of message

;===================================================================================================
; Magic bat
;===================================================================================================
; やい,よくも長いネムリから
; めざめさせて くれたなっ!
; ⋯ どうも ありがとう。
; やい,こうなったら おれいを
; してやるから カクゴしろ。
; ⋯ よろしいですか?
;===================================================================================================
Message_010E:
|1CC038| db $05, $01, $C8, $07, $0A, $34 ; やい,よくも
|1CC03E| db $FD, $8D ; kanji 長
|1CC040| db $01, $73, $82, $89, $08, $38 ; いネムリから
|1CC046| db $F8 ; row 2
|1CC047| db $33, $1F, $33, $10, $13, $1B, $FF, $0A ; めざめさせて␣く
|1CC04F| db $3B, $18, $20, $4A, $C7 ; れたなっ!
|1CC054| db $F9 ; row 3
|1CC055| db $FF, $CC, $FF, $37, $02, $34, $FF, $00 ; ␣⋯␣どうも␣あ
|1CC05D| db $39, $15, $1C, $02, $CD ; りがとう。
|1CC062| db $FA ; wait for key
|1CC063| db $F6 ; scroll
|1CC064| db $05, $01, $C8, $0C, $02, $20, $4A, $18 ; やい,こうなった
|1CC06C| db $38, $FF, $04, $3B, $01, $0E ; ら␣おれいを
|1CC072| db $F6 ; scroll
|1CC073| db $11, $1B, $05, $3A, $08, $38, $FF, $58 ; してやるから␣カ
|1CC07B| db $5A, $6E, $11, $3C, $CD ; クゴしろ。
|1CC080| db $F6 ; scroll
|1CC081| db $FF, $CC, $FF, $07, $3C, $11, $01, $36 ; ␣⋯␣よろしいで
|1CC089| db $12, $08, $C6 ; すか?
|1CC08C| db $FB ; end of message

;===================================================================================================
; Magic bat haha
;===================================================================================================
; ケケケ,ざまあみろ! これで
; 今までの2ぶんの1しか魔法は
; へらんぞ⋯,よかったですね。
; では,せいぜいがんばりやがれ
; ごきげんよう さようなら〜
;===================================================================================================
Message_010F:
|1CC08D| db $5B, $5B, $5B, $C8, $1F, $30, $00, $31 ; ケケケ,ざまあみ
|1CC095| db $3C, $C7, $FF, $0C, $3B, $36 ; ろ!␣これで
|1CC09B| db $F8 ; row 2
|1CC09C| db $FD, $6A ; kanji 今
|1CC09E| db $30, $36, $24, $A2, $3F, $0F, $24, $A1 ; までの2ぶんの1
|1CC0A6| db $11, $08 ; しか
|1CC0A8| db $FD, $2D ; kanji 魔
|1CC0AA| db $FD, $3C ; kanji 法
|1CC0AC| db $28 ; は
|1CC0AD| db $F9 ; row 3
|1CC0AE| db $2B, $38, $0F, $2D, $CC, $C8, $07, $08 ; へらんぞ⋯,よか
|1CC0B6| db $4A, $18, $36, $12, $23, $CD ; ったですね。
|1CC0BC| db $FA ; wait for key
|1CC0BD| db $F6 ; scroll
|1CC0BE| db $36, $28, $C8, $13, $01, $27, $01, $15 ; では,せいぜいが
|1CC0C6| db $0F, $3D, $39, $05, $15, $3B ; んばりやがれ
|1CC0CC| db $F6 ; scroll
|1CC0CD| db $FF, $1E, $09, $1D, $0F, $07, $02, $FF ; ␣ごきげんよう␣
|1CC0D5| db $10, $07, $02, $20, $38, $CE ; さようなら〜
|1CC0DB| db $F6 ; scroll
|1CC0DC| db $FB ; end of message

;===================================================================================================
; Attract mode
;===================================================================================================
; はるか昔 山と森にかこまれた
; 美しき ハイラルの大地⋯
; 全知全能の力を持つ黄金が
; この地方のどこかにあると
; 伝えられていました
; そのハイラルの王国で
; 黄金がかくされた聖地への
; 入口がみつかり
; 多くの人々があらそって
; 聖地へと消えていきました
; しかし 戻ってきた者はなく
; また,悪しき力がそこから
; わきでてきたと言うことです
; そこで 国の王は
; 7人の賢者に命じ聖地への
; 入口を封印させたそうです
; 封印は 2度と解かれる事は
; ないはずでした
; ⋯⋯しかし,それらのでき事が
; 伝説となったころ⋯
;===================================================================================================
Message_0110:
|1CC0DD| db $FE, $6E, $00 ; set scroll speed
|1CC0E0| db $FE, $77, $07 ; set color
|1CC0E3| db $FC, $03 ; text speed: 3
|1CC0E5| db $FE, $6B, $02 ; border: 2
|1CC0E8| db $FE, $67 ; next image
|1CC0EA| db $28, $3A, $08 ; はるか
|1CC0ED| db $FD, $7E ; kanji 昔
|1CC0EF| db $FF ; ␣
|1CC0F0| db $FD, $94 ; kanji 山
|1CC0F2| db $1C ; と
|1CC0F3| db $FD, $65 ; kanji 森
|1CC0F5| db $21, $08, $0C, $30, $3B, $18 ; にかこまれた
|1CC0FB| db $F8 ; row 2
|1CC0FC| db $FD, $68 ; kanji 美
|1CC0FE| db $11, $09, $FF, $78, $51, $88, $8A, $24 ; しき␣ハイラルの
|1CC106| db $FD, $5F ; kanji 大
|1CC108| db $FD, $33 ; kanji 地
|1CC10A| db $CC, $FF, $FF ; ⋯␣␣
|1CC10D| db $F9 ; row 3
|1CC10E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC116| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC11C| db $FE, $78, $09 ; wait
|1CC11F| db $F6 ; scroll
|1CC120| db $FD, $BE ; kanji 全
|1CC122| db $FD, $93 ; kanji 知
|1CC124| db $FD, $BE ; kanji 全
|1CC126| db $FD, $F3 ; kanji 能
|1CC128| db $24 ; の
|1CC129| db $FD, $99 ; kanji 力
|1CC12B| db $0E ; を
|1CC12C| db $FD, $DB ; kanji 持
|1CC12E| db $1A ; つ
|1CC12F| db $FD, $98 ; kanji 黄
|1CC131| db $FD, $43 ; kanji 金
|1CC133| db $15, $FF, $FF ; が␣␣
|1CC136| db $F6 ; scroll
|1CC137| db $0C, $24 ; この
|1CC139| db $FD, $33 ; kanji 地
|1CC13B| db $FD, $20 ; kanji 方
|1CC13D| db $24, $37, $0C, $08, $21, $00, $3A, $1C ; のどこかにあると
|1CC145| db $FF, $FF ; ␣␣
|1CC147| db $F6 ; scroll
|1CC148| db $FD, $2E ; kanji 伝
|1CC14A| db $03, $38, $3B, $1B, $01, $30, $11, $18 ; えられていました
|1CC152| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CC157| db $FE, $78, $09 ; wait
|1CC15A| db $FE, $67 ; next image
|1CC15C| db $FE, $67 ; next image
|1CC15E| db $F6 ; scroll
|1CC15F| db $14, $24, $78, $51, $88, $8A, $24 ; そのハイラルの
|1CC166| db $FD, $44 ; kanji 王
|1CC168| db $FD, $2B ; kanji 国
|1CC16A| db $36, $FF, $FF, $FF, $FF ; で␣␣␣␣
|1CC16F| db $F6 ; scroll
|1CC170| db $FD, $98 ; kanji 黄
|1CC172| db $FD, $43 ; kanji 金
|1CC174| db $15, $08, $0A, $10, $3B, $18 ; がかくされた
|1CC17A| db $FD, $F6 ; kanji 聖
|1CC17C| db $FD, $33 ; kanji 地
|1CC17E| db $2B, $24, $FF, $FF ; への␣␣
|1CC182| db $F6 ; scroll
|1CC183| db $FD, $49 ; kanji 入
|1CC185| db $FD, $4A ; kanji 口
|1CC187| db $15, $31, $1A, $08, $39, $FF, $FF, $FF ; がみつかり␣␣␣
|1CC18F| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CC193| db $FE, $78, $07 ; wait
|1CC196| db $F6 ; scroll
|1CC197| db $FD, $F5 ; kanji 多
|1CC199| db $0A, $24 ; くの
|1CC19B| db $FD, $38 ; kanji 人
|1CC19D| db $FD, $A5 ; kanji 々
|1CC19F| db $15, $00, $38, $14, $4A, $1B, $FF, $FF ; があらそって␣␣
|1CC1A7| db $FF ; ␣
|1CC1A8| db $F6 ; scroll
|1CC1A9| db $FD, $F6 ; kanji 聖
|1CC1AB| db $FD, $33 ; kanji 地
|1CC1AD| db $2B, $1C ; へと
|1CC1AF| db $FD, $9D ; kanji 消
|1CC1B1| db $03, $1B, $01, $09, $30, $11, $18, $FF ; えていきました␣
|1CC1B9| db $FF ; ␣
|1CC1BA| db $F6 ; scroll
|1CC1BB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC1C3| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC1C9| db $FE, $78, $07 ; wait
|1CC1CC| db $F6 ; scroll
|1CC1CD| db $11, $08, $11, $FF ; しかし␣
|1CC1D1| db $FD, $0F ; kanji 戻
|1CC1D3| db $4A, $1B, $09, $18 ; ってきた
|1CC1D7| db $FD, $1E ; kanji 者
|1CC1D9| db $28, $20, $0A, $FF ; はなく␣
|1CC1DD| db $F6 ; scroll
|1CC1DE| db $30, $18, $C8 ; また,
|1CC1E1| db $FD, $85 ; kanji 悪
|1CC1E3| db $11, $09 ; しき
|1CC1E5| db $FD, $99 ; kanji 力
|1CC1E7| db $15, $14, $0C, $08, $38, $FF, $FF ; がそこから␣␣
|1CC1EE| db $F6 ; scroll
|1CC1EF| db $0D, $09, $36, $1B, $09, $18, $1C ; わきでてきたと
|1CC1F6| db $FD, $16 ; kanji 言
|1CC1F8| db $02, $0C, $1C, $36, $12, $FF ; うことです␣
|1CC1FE| db $FE, $78, $09 ; wait
|1CC201| db $FE, $67 ; next image
|1CC203| db $FE, $67 ; next image
|1CC205| db $F6 ; scroll
|1CC206| db $14, $0C, $36, $FF ; そこで␣
|1CC20A| db $FD, $2B ; kanji 国
|1CC20C| db $24 ; の
|1CC20D| db $FD, $44 ; kanji 王
|1CC20F| db $28, $FF, $FF, $FF, $FF, $FF, $FF ; は␣␣␣␣␣␣
|1CC216| db $F6 ; scroll
|1CC217| db $A7 ; 7
|1CC218| db $FD, $38 ; kanji 人
|1CC21A| db $24 ; の
|1CC21B| db $FD, $C4 ; kanji 賢
|1CC21D| db $FD, $1E ; kanji 者
|1CC21F| db $21 ; に
|1CC220| db $FD, $E4 ; kanji 命
|1CC222| db $25 ; じ
|1CC223| db $FD, $F6 ; kanji 聖
|1CC225| db $FD, $33 ; kanji 地
|1CC227| db $2B, $24, $FF, $FF ; への␣␣
|1CC22B| db $F6 ; scroll
|1CC22C| db $FD, $49 ; kanji 入
|1CC22E| db $FD, $4A ; kanji 口
|1CC230| db $0E ; を
|1CC231| db $FD, $9E ; kanji 封
|1CC233| db $FD, $35 ; kanji 印
|1CC235| db $10, $13, $18, $14, $02, $36, $12, $FF ; させたそうです␣
|1CC23D| db $FF ; ␣
|1CC23E| db $FE, $78, $09 ; wait
|1CC241| db $FE, $67 ; next image
|1CC243| db $FE, $67 ; next image
|1CC245| db $F6 ; scroll
|1CC246| db $FD, $9E ; kanji 封
|1CC248| db $FD, $35 ; kanji 印
|1CC24A| db $28, $FF, $A2 ; は␣2
|1CC24D| db $FD, $2A ; kanji 度
|1CC24F| db $1C ; と
|1CC250| db $FD, $1C ; kanji 解
|1CC252| db $08, $3B, $3A ; かれる
|1CC255| db $FD, $22 ; kanji 事
|1CC257| db $28, $FF ; は␣
|1CC259| db $F6 ; scroll
|1CC25A| db $20, $01, $28, $26, $36, $11, $18, $FF ; ないはずでした␣
|1CC262| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC268| db $F6 ; scroll
|1CC269| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC271| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC277| db $FE, $78, $09 ; wait
|1CC27A| db $F6 ; scroll
|1CC27B| db $CC, $CC, $11, $08, $11, $C8, $14, $3B ; ⋯⋯しかし,それ
|1CC283| db $38, $24, $36, $09 ; らのでき
|1CC287| db $FD, $22 ; kanji 事
|1CC289| db $15 ; が
|1CC28A| db $F6 ; scroll
|1CC28B| db $FD, $2E ; kanji 伝
|1CC28D| db $FD, $2F ; kanji 説
|1CC28F| db $1C, $20, $4A, $18, $0C, $3C, $CC, $FF ; となったころ⋯␣
|1CC297| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CC29B| db $F6 ; scroll
|1CC29C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC2A4| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC2AA| db $FB ; end of message

;===================================================================================================
; Attract mode
;===================================================================================================
; ここに,封印をとこうとたくら
; む,ナゾの司祭アグニムがいま
; した。彼は国王をほうむり⋯。
;===================================================================================================
Message_0111:
|1CC2AB| db $FE, $6B, $02 ; border: 2
|1CC2AE| db $FE, $77, $07 ; set color
|1CC2B1| db $FC, $03 ; text speed: 3
|1CC2B3| db $F7 ; row 1
|1CC2B4| db $0C, $0C, $21, $C8 ; ここに,
|1CC2B8| db $FD, $9E ; kanji 封
|1CC2BA| db $FD, $35 ; kanji 印
|1CC2BC| db $0E, $1C, $0C, $02, $1C, $18, $0A, $38 ; をとこうとたくら
|1CC2C4| db $F8 ; row 2
|1CC2C5| db $32, $C8, $70, $7D, $24 ; む,ナゾの
|1CC2CA| db $FD, $0D ; kanji 司
|1CC2CC| db $FD, $17 ; kanji 祭
|1CC2CE| db $50, $67, $71, $82, $15, $01, $30 ; アグニムがいま
|1CC2D5| db $F9 ; row 3
|1CC2D6| db $11, $18, $CD ; した。
|1CC2D9| db $FD, $14 ; kanji 彼
|1CC2DB| db $28 ; は
|1CC2DC| db $FD, $2B ; kanji 国
|1CC2DE| db $FD, $44 ; kanji 王
|1CC2E0| db $0E, $2C, $02, $32, $39, $CC, $CD ; をほうむり⋯。
|1CC2E7| db $FE, $78, $05 ; wait
|1CC2EA| db $FB ; end of message

;===================================================================================================
; Attract mode
;===================================================================================================
; 城の兵達をあやつって7賢者の
; 血をひく娘達を,つぎつぎイケ
; ニエにささげていったのです。
;===================================================================================================
Message_0112:
|1CC2EB| db $FE, $6B, $02 ; border: 2
|1CC2EE| db $FE, $77, $07 ; set color
|1CC2F1| db $FC, $03 ; text speed: 3
|1CC2F3| db $F7 ; row 1
|1CC2F4| db $FD, $01 ; kanji 城
|1CC2F6| db $24 ; の
|1CC2F7| db $FD, $3A ; kanji 兵
|1CC2F9| db $FD, $13 ; kanji 達
|1CC2FB| db $0E, $00, $05, $1A, $4A, $1B, $A7 ; をあやつって7
|1CC302| db $FD, $C4 ; kanji 賢
|1CC304| db $FD, $1E ; kanji 者
|1CC306| db $24 ; の
|1CC307| db $F8 ; row 2
|1CC308| db $FD, $B9 ; kanji 血
|1CC30A| db $0E, $29, $0A ; をひく
|1CC30D| db $FD, $00 ; kanji 娘
|1CC30F| db $FD, $13 ; kanji 達
|1CC311| db $0E, $C8, $1A, $16, $1A, $16, $51, $5B ; を,つぎつぎイケ
|1CC319| db $F9 ; row 3
|1CC31A| db $71, $53, $21, $10, $10, $1D, $1B, $01 ; ニエにささげてい
|1CC322| db $4A, $18, $24, $36, $12, $CD ; ったのです。
|1CC328| db $FE, $78, $05 ; wait
|1CC32B| db $FB ; end of message

;===================================================================================================
; Attract mode
;===================================================================================================
; そして,王女ゼルダがイケニエ
; にささげられる運命の時も,
; もうそこまでせまっていました
;===================================================================================================
Message_0113:
|1CC32C| db $FE, $6B, $02 ; border: 2
|1CC32F| db $FE, $77, $07 ; set color
|1CC332| db $FC, $03 ; text speed: 3
|1CC334| db $F7 ; row 1
|1CC335| db $14, $11, $1B, $C8 ; そして,
|1CC339| db $FD, $44 ; kanji 王
|1CC33B| db $FD, $15 ; kanji 女
|1CC33D| db $77, $8A, $7E, $15, $51, $5B, $71, $53 ; ゼルダがイケニエ
|1CC345| db $F8 ; row 2
|1CC346| db $21, $10, $10, $1D, $38, $3B, $3A ; にささげられる
|1CC34D| db $FD, $4F ; kanji 運
|1CC34F| db $FD, $E4 ; kanji 命
|1CC351| db $24 ; の
|1CC352| db $FD, $88 ; kanji 時
|1CC354| db $34, $C8, $FF ; も,␣
|1CC357| db $F9 ; row 3
|1CC358| db $34, $02, $14, $0C, $30, $36, $13, $30 ; もうそこまでせま
|1CC360| db $4A, $1B, $01, $30, $11, $18 ; っていました
|1CC366| db $FE, $78, $05 ; wait
|1CC369| db $FB ; end of message

;===================================================================================================
; Purple chest obtained
;===================================================================================================
; カギがかかっていて
; どうしても開かない。
; とりあえず 持っていこう。
;===================================================================================================
Message_0114:
|1CC36A| db $58, $66, $15, $08, $08, $4A, $1B, $01 ; カギがかかってい
|1CC372| db $1B ; て
|1CC373| db $F8 ; row 2
|1CC374| db $37, $02, $11, $1B, $34 ; どうしても
|1CC379| db $FD, $4B ; kanji 開
|1CC37B| db $08, $20, $01, $CD ; かない。
|1CC37F| db $F9 ; row 3
|1CC380| db $1C, $39, $00, $03, $26, $FF ; とりあえず␣
|1CC386| db $FD, $DB ; kanji 持
|1CC388| db $4A, $1B, $01, $0C, $02, $CD ; っていこう。
|1CC38E| db $FB ; end of message

;===================================================================================================
; Bomb Shop clerk before Big Bomb
;===================================================================================================
; バクダン30コで100ルピー
; 30コで100ルピーでござい
; ます。 かってやって下さい。
;===================================================================================================
Message_0115:
|1CC38F| db $8D, $5A, $7E, $5F, $A3, $A0, $5C, $36 ; バクダン30コで
|1CC397| db $A1, $A0, $A0, $8A, $93, $C9 ; 100ルピー
|1CC39D| db $F8 ; row 2
|1CC39E| db $A3, $A0, $5C, $36, $A1, $A0, $A0, $8A ; 30コで100ル
|1CC3A6| db $93, $C9, $36, $1E, $1F, $01 ; ピーでござい
|1CC3AC| db $F9 ; row 3
|1CC3AD| db $30, $12, $CD, $FF, $08, $4A, $1B, $05 ; ます。␣かってや
|1CC3B5| db $4A, $1B ; って
|1CC3B7| db $FD, $61 ; kanji 下
|1CC3B9| db $10, $01, $CD ; さい。
|1CC3BC| db $FB ; end of message

;===================================================================================================
; Bomb Shop clerk after Big Bomb
;===================================================================================================
; バクダン30コで100ルピー
; いまなら,新セイヒンも1コ
; 100ルピーでおわけしてます
;===================================================================================================
Message_0116:
|1CC3BD| db $8D, $5A, $7E, $5F, $A3, $A0, $5C, $36 ; バクダン30コで
|1CC3C5| db $A1, $A0, $A0, $8A, $93, $C9 ; 100ルピー
|1CC3CB| db $F8 ; row 2
|1CC3CC| db $01, $30, $20, $38, $C8 ; いまなら,
|1CC3D1| db $FD, $E7 ; kanji 新
|1CC3D3| db $63, $51, $79, $5F, $34, $A1, $5C ; セイヒンも1コ
|1CC3DA| db $F9 ; row 3
|1CC3DB| db $A1, $A0, $A0, $8A, $93, $C9, $36, $04 ; 100ルピーでお
|1CC3E3| db $0D, $0B, $11, $1B, $30, $12 ; わけしてます
|1CC3E9| db $FB ; end of message

;===================================================================================================
; Bomb Shop clerk after purchase
;===================================================================================================
; ありがとうございました。
; ありがとうございました。
;===================================================================================================
Message_0117:
|1CC3EA| db $00, $39, $15, $1C, $02, $1E, $1F, $01 ; ありがとうござい
|1CC3F2| db $30, $11, $18, $CD ; ました。
|1CC3F6| db $F8 ; row 2
|1CC3F7| db $00, $39, $15, $1C, $02, $1E, $1F, $01 ; ありがとうござい
|1CC3FF| db $30, $11, $18, $CD ; ました。
|1CC403| db $FB ; end of message

;===================================================================================================
; Big Bomb purchased
;===================================================================================================
; ありがとうございました。
; そのバクダンは,Aボタンで
; きりはなせます。お忘れなく⋯
;===================================================================================================
Message_0118:
|1CC404| db $00, $39, $15, $1C, $02, $1E, $1F, $01 ; ありがとうござい
|1CC40C| db $30, $11, $18, $CD ; ました。
|1CC410| db $F8 ; row 2
|1CC411| db $14, $24, $8D, $5A, $7E, $5F, $28, $C8 ; そのバクダンは,
|1CC419| db $AA, $91, $68, $5F, $36 ; Aボタンで
|1CC41E| db $F9 ; row 3
|1CC41F| db $09, $39, $28, $20, $13, $30, $12, $CD ; きりはなせます。
|1CC427| db $04 ; お
|1CC428| db $FD, $D8 ; kanji 忘
|1CC42A| db $3B, $20, $0A, $CC ; れなく⋯
|1CC42E| db $FB ; end of message

;===================================================================================================
; Kiki open Palace of Darkness offer
;===================================================================================================
; キキッ,100ルピーくれたら
; ここの入口を開けてやっても
; いいぜっ。キキッキキッ!
; どうする?
; ▶ 開けてもらう
;   じぶんでやってみる
;===================================================================================================
Message_0119:
|1CC42F| db $59, $59, $9A, $C8, $A1, $A0, $A0, $8A ; キキッ,100ル
|1CC437| db $93, $C9, $0A, $3B, $18, $38 ; ピーくれたら
|1CC43D| db $F8 ; row 2
|1CC43E| db $0C, $0C, $24 ; ここの
|1CC441| db $FD, $49 ; kanji 入
|1CC443| db $FD, $4A ; kanji 口
|1CC445| db $0E ; を
|1CC446| db $FD, $4B ; kanji 開
|1CC448| db $0B, $1B, $05, $4A, $1B, $34 ; けてやっても
|1CC44E| db $F9 ; row 3
|1CC44F| db $01, $01, $27, $4A, $CD, $59, $59, $9A ; いいぜっ。キキッ
|1CC457| db $59, $59, $9A, $C7 ; キキッ!
|1CC45B| db $FA ; wait for key
|1CC45C| db $F6 ; scroll
|1CC45D| db $37, $02, $12, $3A, $C6 ; どうする?
|1CC462| db $F6 ; scroll
|1CC463| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CC467| db $FD, $4B ; kanji 開
|1CC469| db $0B, $1B, $34, $38, $02 ; けてもらう
|1CC46E| db $F6 ; scroll
|1CC46F| db $FF, $FF, $FF, $FF, $25, $3F, $0F, $36 ; ␣␣␣␣じぶんで
|1CC477| db $05, $4A, $1B, $31, $3A ; やってみる
|1CC47C| db $FE, $68 ; choose 2 low
|1CC47E| db $FB ; end of message

;===================================================================================================
; Kiki bugger off then
;===================================================================================================
; キキッ! ふ〜ん。
; じゃあ,じぶんでやってみなっ
; キッキキー!
;===================================================================================================
Message_011A:
|1CC47F| db $59, $59, $9A, $C7, $FF, $2A, $CE, $0F ; キキッ!␣ふ〜ん
|1CC487| db $CD ; 。
|1CC488| db $F8 ; row 2
|1CC489| db $25, $47, $00, $C8, $25, $3F, $0F, $36 ; じゃあ,じぶんで
|1CC491| db $05, $4A, $1B, $31, $20, $4A ; やってみなっ
|1CC497| db $F9 ; row 3
|1CC498| db $59, $9A, $59, $59, $C9, $C7 ; キッキキー!
|1CC49E| db $FB ; end of message

;===================================================================================================
; Kiki 100 rupees taken
;===================================================================================================
; キキッ! そうこなくっちゃ。
; じゃあ100ルピーはいただい
; とくからなっ! キッキキー!
;===================================================================================================
Message_011B:
|1CC49F| db $59, $59, $9A, $C7, $FF, $14, $02, $0C ; キキッ!␣そうこ
|1CC4A7| db $20, $0A, $4A, $19, $47, $CD ; なくっちゃ。
|1CC4AD| db $F8 ; row 2
|1CC4AE| db $25, $47, $00, $A1, $A0, $A0, $8A, $93 ; じゃあ100ルピ
|1CC4B6| db $C9, $28, $01, $18, $2E, $01 ; ーはいただい
|1CC4BC| db $F9 ; row 3
|1CC4BD| db $1C, $0A, $08, $38, $20, $4A, $C7, $FF ; とくからなっ!␣
|1CC4C5| db $59, $9A, $59, $59, $C9, $C7 ; キッキキー!
|1CC4CB| db $FB ; end of message

;===================================================================================================
; Kiki ask for 10 rupees
;===================================================================================================
; おいら,サルキッキ!
; 何よりも,ルピーが大好き。
; あんた10ルピーくれるかい?
; どうする?
; ▶ 10ルピーあげる
;   ぜったいあげない
;===================================================================================================
Message_011C:
|1CC4CC| db $04, $01, $38, $C8, $60, $8A, $59, $9A ; おいら,サルキッ
|1CC4D4| db $59, $C7 ; キ!
|1CC4D6| db $F8 ; row 2
|1CC4D7| db $FD, $8B ; kanji 何
|1CC4D9| db $07, $39, $34, $C8, $8A, $93, $C9, $15 ; よりも,ルピーが
|1CC4E1| db $FD, $5F ; kanji 大
|1CC4E3| db $FD, $6D ; kanji 好
|1CC4E5| db $09, $CD ; き。
|1CC4E7| db $F9 ; row 3
|1CC4E8| db $00, $0F, $18, $A1, $A0, $8A, $93, $C9 ; あんた10ルピー
|1CC4F0| db $0A, $3B, $3A, $08, $01, $C6 ; くれるかい?
|1CC4F6| db $FA ; wait for key
|1CC4F7| db $F6 ; scroll
|1CC4F8| db $37, $02, $12, $3A, $C6 ; どうする?
|1CC4FD| db $F6 ; scroll
|1CC4FE| db $FF, $FF, $E4, $FF, $A1, $A0, $8A, $93 ; ␣␣▶␣10ルピ
|1CC506| db $C9, $00, $1D, $3A ; ーあげる
|1CC50A| db $F6 ; scroll
|1CC50B| db $FF, $FF, $FF, $FF, $27, $4A, $18, $01 ; ␣␣␣␣ぜったい
|1CC513| db $00, $1D, $20, $01 ; あげない
|1CC517| db $FE, $68 ; choose 2 low
|1CC519| db $FB ; end of message

;===================================================================================================
; Kiki takes 10 rupees
;===================================================================================================
; キキッ! そうこなくっちゃっ
; しばらく,あんたのおともを
; してやるぜっ キッキキ〜!
;===================================================================================================
Message_011D:
|1CC51A| db $59, $59, $9A, $C7, $FF, $14, $02, $0C ; キキッ!␣そうこ
|1CC522| db $20, $0A, $4A, $19, $47, $4A ; なくっちゃっ
|1CC528| db $F8 ; row 2
|1CC529| db $11, $3D, $38, $0A, $C8, $00, $0F, $18 ; しばらく,あんた
|1CC531| db $24, $04, $1C, $34, $0E ; のおともを
|1CC536| db $F9 ; row 3
|1CC537| db $11, $1B, $05, $3A, $27, $4A, $FF, $59 ; してやるぜっ␣キ
|1CC53F| db $9A, $59, $59, $CE, $C7 ; ッキキ〜!
|1CC544| db $FB ; end of message

;===================================================================================================
; Kiki: I hate you
;===================================================================================================
; キキッ,ふ〜ん⋯。
; じゃあ,あんたにようはないぜ
; バイバイッ キッキキ〜!
;===================================================================================================
Message_011E:
|1CC545| db $59, $59, $9A, $C8, $2A, $CE, $0F, $CC ; キキッ,ふ〜ん⋯
|1CC54D| db $CD ; 。
|1CC54E| db $F8 ; row 2
|1CC54F| db $25, $47, $00, $C8, $00, $0F, $18, $21 ; じゃあ,あんたに
|1CC557| db $07, $02, $28, $20, $01, $27 ; ようはないぜ
|1CC55D| db $F9 ; row 3
|1CC55E| db $8D, $51, $8D, $51, $9A, $FF, $59, $9A ; バイバイッ␣キッ
|1CC566| db $59, $59, $CE, $C7 ; キキ〜!
|1CC56A| db $FB ; end of message

;===================================================================================================
; Kiki refuses to follow
;===================================================================================================
; キキッ,何してやがるっ!
; おいらは,つきあわねーぜっ!
;===================================================================================================
Message_011F:
|1CC56B| db $59, $59, $9A, $C8 ; キキッ,
|1CC56F| db $FD, $8B ; kanji 何
|1CC571| db $11, $1B, $05, $15, $3A, $4A, $C7 ; してやがるっ!
|1CC578| db $F8 ; row 2
|1CC579| db $04, $01, $38, $28, $C8, $1A, $09, $00 ; おいらは,つきあ
|1CC581| db $0D, $23, $C9, $27, $4A, $C7 ; わねーぜっ!
|1CC587| db $FB ; end of message

;===================================================================================================
; Blind maiden greeting
;===================================================================================================
; ふう ありがとうございます。
; 助かりました。どうか
; そとまで連れていって下さい。
;===================================================================================================
Message_0120:
|1CC588| db $2A, $02, $FF, $00, $39, $15, $1C, $02 ; ふう␣ありがとう
|1CC590| db $1E, $1F, $01, $30, $12, $CD ; ございます。
|1CC596| db $F8 ; row 2
|1CC597| db $FD, $CA ; kanji 助
|1CC599| db $08, $39, $30, $11, $18, $CD, $37, $02 ; かりました。どう
|1CC5A1| db $08 ; か
|1CC5A2| db $F9 ; row 3
|1CC5A3| db $14, $1C, $30, $36 ; そとまで
|1CC5A7| db $FD, $40 ; kanji 連
|1CC5A9| db $3B, $1B, $01, $4A, $1B ; れていって
|1CC5AE| db $FD, $61 ; kanji 下
|1CC5B0| db $10, $01, $CD ; さい。
|1CC5B3| db $FB ; end of message

;===================================================================================================
; Blind blinded
;===================================================================================================
; ぎぃやぁぁぁ〜!
; ま,まぶしい〜っ!
;===================================================================================================
Message_0121:
|1CC5B4| db $16, $4C, $05, $4B, $4B, $4B, $CE, $C7 ; ぎぃやぁぁぁ〜!
|1CC5BC| db $F8 ; row 2
|1CC5BD| db $30, $C8, $30, $3F, $11, $01, $CE, $4A ; ま,まぶしい〜っ
|1CC5C5| db $C7 ; !
|1CC5C6| db $FB ; end of message

;===================================================================================================
; Blind maiden wrong way
;===================================================================================================
; あっ,⋯ まって下さい。
; そっちへ行かないで⋯。
;===================================================================================================
Message_0122:
|1CC5C7| db $00, $4A, $C8, $CC, $FF, $30, $4A, $1B ; あっ,⋯␣まって
|1CC5CF| db $FD, $61 ; kanji 下
|1CC5D1| db $10, $01, $CD ; さい。
|1CC5D4| db $F8 ; row 2
|1CC5D5| db $14, $4A, $19, $2B ; そっちへ
|1CC5D9| db $FD, $02 ; kanji 行
|1CC5DB| db $08, $20, $01, $36, $CC, $CD ; かないで⋯。
|1CC5E1| db $FB ; end of message

;===================================================================================================
; Aginah greeting
;===================================================================================================
; ワシの名はアジナーですじゃ。
; どうやら7賢者の封じた
; 聖地のなかで,何かが
; おこっているようす⋯。
; 7賢者をはじめハイリアの民の
; 血をひく者の間に伝わる予言
; 『オオイナル ワザワイ』の
; 前ぶれですじゃ。
; ⋯ ⋯ ⋯
; その予言で『勇者はムドラの書
; を持ってサバクにたつ』⋯
; と言われとりますじゃ。
; ムドラの書があれば,ハイリア
; の民のコトバが,わかると言う
; ことですじゃ。
; 村の書の家に,あるはず⋯。
; 必ず,手に入れなさるがよい。
; 『勇者』となる者ならばのう⋯
;===================================================================================================
Message_0123:
|1CC5E2| db $5D, $61, $24 ; ワシの
|1CC5E5| db $FD, $6F ; kanji 名
|1CC5E7| db $28, $50, $75, $70, $C9, $36, $12, $25 ; はアジナーですじ
|1CC5EF| db $47, $CD ; ゃ。
|1CC5F1| db $F8 ; row 2
|1CC5F2| db $37, $02, $05, $38, $A7 ; どうやら7
|1CC5F7| db $FD, $C4 ; kanji 賢
|1CC5F9| db $FD, $1E ; kanji 者
|1CC5FB| db $24 ; の
|1CC5FC| db $FD, $9E ; kanji 封
|1CC5FE| db $25, $18 ; じた
|1CC600| db $F9 ; row 3
|1CC601| db $FD, $F6 ; kanji 聖
|1CC603| db $FD, $33 ; kanji 地
|1CC605| db $24, $20, $08, $36, $C8 ; のなかで,
|1CC60A| db $FD, $8B ; kanji 何
|1CC60C| db $08, $15 ; かが
|1CC60E| db $FA ; wait for key
|1CC60F| db $F6 ; scroll
|1CC610| db $04, $0C, $4A, $1B, $01, $3A, $07, $02 ; おこっているよう
|1CC618| db $12, $CC, $CD ; す⋯。
|1CC61B| db $F6 ; scroll
|1CC61C| db $A7 ; 7
|1CC61D| db $FD, $C4 ; kanji 賢
|1CC61F| db $FD, $1E ; kanji 者
|1CC621| db $0E, $28, $25, $33, $78, $51, $89, $50 ; をはじめハイリア
|1CC629| db $24 ; の
|1CC62A| db $FD, $F8 ; kanji 民
|1CC62C| db $24 ; の
|1CC62D| db $F6 ; scroll
|1CC62E| db $FD, $B9 ; kanji 血
|1CC630| db $0E, $29, $0A ; をひく
|1CC633| db $FD, $1E ; kanji 者
|1CC635| db $24 ; の
|1CC636| db $FD, $39 ; kanji 間
|1CC638| db $21 ; に
|1CC639| db $FD, $2E ; kanji 伝
|1CC63B| db $0D, $3A ; わる
|1CC63D| db $FD, $F9 ; kanji 予
|1CC63F| db $FD, $16 ; kanji 言
|1CC641| db $FA ; wait for key
|1CC642| db $F6 ; scroll
|1CC643| db $C4, $54, $54, $51, $70, $8A, $FF, $5D ; 『オオイナル␣ワ
|1CC64B| db $6F, $5D, $51, $C5, $24 ; ザワイ』の
|1CC650| db $F6 ; scroll
|1CC651| db $FD, $78 ; kanji 前
|1CC653| db $3F, $3B, $36, $12, $25, $47, $CD ; ぶれですじゃ。
|1CC65A| db $F6 ; scroll
|1CC65B| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CC661| db $FA ; wait for key
|1CC662| db $F6 ; scroll
|1CC663| db $14, $24 ; その
|1CC665| db $FD, $F9 ; kanji 予
|1CC667| db $FD, $16 ; kanji 言
|1CC669| db $36, $C4 ; で『
|1CC66B| db $FD, $A0 ; kanji 勇
|1CC66D| db $FD, $1E ; kanji 者
|1CC66F| db $28, $82, $87, $88, $24 ; はムドラの
|1CC674| db $FD, $0E ; kanji 書
|1CC676| db $F6 ; scroll
|1CC677| db $0E ; を
|1CC678| db $FD, $DB ; kanji 持
|1CC67A| db $4A, $1B, $60, $8D, $5A, $21, $18, $1A ; ってサバクにたつ
|1CC682| db $C5, $CC ; 』⋯
|1CC684| db $F6 ; scroll
|1CC685| db $1C ; と
|1CC686| db $FD, $16 ; kanji 言
|1CC688| db $0D, $3B, $1C, $39, $30, $12, $25, $47 ; われとりますじゃ
|1CC690| db $CD ; 。
|1CC691| db $FA ; wait for key
|1CC692| db $F6 ; scroll
|1CC693| db $82, $87, $88, $24 ; ムドラの
|1CC697| db $FD, $0E ; kanji 書
|1CC699| db $15, $00, $3B, $3D, $C8, $78, $51, $89 ; があれば,ハイリ
|1CC6A1| db $50 ; ア
|1CC6A2| db $F6 ; scroll
|1CC6A3| db $24 ; の
|1CC6A4| db $FD, $F8 ; kanji 民
|1CC6A6| db $24, $5C, $6C, $8D, $15, $C8, $0D, $08 ; のコトバが,わか
|1CC6AE| db $3A, $1C ; ると
|1CC6B0| db $FD, $16 ; kanji 言
|1CC6B2| db $02 ; う
|1CC6B3| db $F6 ; scroll
|1CC6B4| db $0C, $1C, $36, $12, $25, $47, $CD ; ことですじゃ。
|1CC6BB| db $FA ; wait for key
|1CC6BC| db $F6 ; scroll
|1CC6BD| db $FD, $8C ; kanji 村
|1CC6BF| db $24 ; の
|1CC6C0| db $FD, $0E ; kanji 書
|1CC6C2| db $24 ; の
|1CC6C3| db $FD, $56 ; kanji 家
|1CC6C5| db $21, $C8, $00, $3A, $28, $26, $CC, $CD ; に,あるはず⋯。
|1CC6CD| db $F6 ; scroll
|1CC6CE| db $FD, $30 ; kanji 必
|1CC6D0| db $26, $C8 ; ず,
|1CC6D2| db $FD, $3E ; kanji 手
|1CC6D4| db $21 ; に
|1CC6D5| db $FD, $49 ; kanji 入
|1CC6D7| db $3B, $20, $10, $3A, $15, $07, $01, $CD ; れなさるがよい。
|1CC6DF| db $F6 ; scroll
|1CC6E0| db $C4 ; 『
|1CC6E1| db $FD, $A0 ; kanji 勇
|1CC6E3| db $FD, $1E ; kanji 者
|1CC6E5| db $C5, $1C, $20, $3A ; 』となる
|1CC6E9| db $FD, $1E ; kanji 者
|1CC6EB| db $20, $38, $3D, $24, $02, $CC ; ならばのう⋯
|1CC6F1| db $FB ; end of message

;===================================================================================================
; Aginah when every pendant
;===================================================================================================
; 3つの紋章が,そろいましたな
; そなたが,『知恵』『勇気』
; 『力』をかねそなえる,
; まことの『勇者』ならば,
; 森にねむるマスターソードも
; そなたの物となるですじゃ。
;===================================================================================================
Message_0124:
|1CC6F2| db $A3, $1A, $24 ; 3つの
|1CC6F5| db $FD, $53 ; kanji 紋
|1CC6F7| db $FD, $54 ; kanji 章
|1CC6F9| db $15, $C8, $14, $3C, $01, $30, $11, $18 ; が,そろいました
|1CC701| db $20 ; な
|1CC702| db $F8 ; row 2
|1CC703| db $14, $20, $18, $15, $C8, $C4 ; そなたが,『
|1CC709| db $FD, $93 ; kanji 知
|1CC70B| db $FD, $41 ; kanji 恵
|1CC70D| db $C5, $C4 ; 』『
|1CC70F| db $FD, $A0 ; kanji 勇
|1CC711| db $FD, $37 ; kanji 気
|1CC713| db $C5 ; 』
|1CC714| db $F9 ; row 3
|1CC715| db $C4 ; 『
|1CC716| db $FD, $99 ; kanji 力
|1CC718| db $C5, $0E, $08, $23, $14, $20, $03, $3A ; 』をかねそなえる
|1CC720| db $C8 ; ,
|1CC721| db $FA ; wait for key
|1CC722| db $F6 ; scroll
|1CC723| db $30, $0C, $1C, $24, $C4 ; まことの『
|1CC728| db $FD, $A0 ; kanji 勇
|1CC72A| db $FD, $1E ; kanji 者
|1CC72C| db $C5, $20, $38, $3D, $C8 ; 』ならば,
|1CC731| db $F6 ; scroll
|1CC732| db $FD, $65 ; kanji 森
|1CC734| db $21, $23, $32, $3A, $80, $62, $68, $C9 ; にねむるマスター
|1CC73C| db $64, $C9, $87, $34 ; ソードも
|1CC740| db $F6 ; scroll
|1CC741| db $14, $20, $18, $24 ; そなたの
|1CC745| db $FD, $51 ; kanji 物
|1CC747| db $1C, $20, $3A, $36, $12, $25, $47, $CD ; となるですじゃ。
|1CC74F| db $FB ; end of message

;===================================================================================================
; Aginah when book is had
;===================================================================================================
; おお,それはムドラの書!
; それがあれば,ハイリアの民の
; コトバがわかるはずですじゃ。
;===================================================================================================
Message_0125:
|1CC750| db $04, $04, $C8, $14, $3B, $28, $82, $87 ; おお,それはムド
|1CC758| db $88, $24 ; ラの
|1CC75A| db $FD, $0E ; kanji 書
|1CC75C| db $C7 ; !
|1CC75D| db $F8 ; row 2
|1CC75E| db $14, $3B, $15, $00, $3B, $3D, $C8, $78 ; それがあれば,ハ
|1CC766| db $51, $89, $50, $24 ; イリアの
|1CC76A| db $FD, $F8 ; kanji 民
|1CC76C| db $24 ; の
|1CC76D| db $F9 ; row 3
|1CC76E| db $5C, $6C, $8D, $15, $0D, $08, $3A, $28 ; コトバがわかるは
|1CC776| db $26, $36, $12, $25, $47, $CD ; ずですじゃ。
|1CC77C| db $FB ; end of message

;===================================================================================================
; Aginah when Master Sword is had
;===================================================================================================
; まことの『勇者』よ⋯。
; 今ー度,この国の平和をとり
; 戻す事,信じとりますじゃ⋯。
;===================================================================================================
Message_0126:
|1CC77D| db $30, $0C, $1C, $24, $C4 ; まことの『
|1CC782| db $FD, $A0 ; kanji 勇
|1CC784| db $FD, $1E ; kanji 者
|1CC786| db $C5, $07, $CC, $CD ; 』よ⋯。
|1CC78A| db $F8 ; row 2
|1CC78B| db $FD, $6A ; kanji 今
|1CC78D| db $C9 ; ー
|1CC78E| db $FD, $2A ; kanji 度
|1CC790| db $C8, $0C, $24 ; ,この
|1CC793| db $FD, $2B ; kanji 国
|1CC795| db $24 ; の
|1CC796| db $FD, $0B ; kanji 平
|1CC798| db $FD, $0C ; kanji 和
|1CC79A| db $0E, $1C, $39 ; をとり
|1CC79D| db $F9 ; row 3
|1CC79E| db $FD, $0F ; kanji 戻
|1CC7A0| db $12 ; す
|1CC7A1| db $FD, $22 ; kanji 事
|1CC7A3| db $C8 ; ,
|1CC7A4| db $FD, $45 ; kanji 信
|1CC7A6| db $25, $1C, $39, $30, $12, $25, $47, $CC ; じとりますじゃ⋯
|1CC7AE| db $CD ; 。
|1CC7AF| db $FB ; end of message

;===================================================================================================
; Aginah when blue pendant is had
;===================================================================================================
; 1つ,しれんをのりこえて
; 大きくなられた様ですな。
; 頼もしいかぎりですじゃ。
;===================================================================================================
Message_0127:
|1CC7B0| db $A1, $1A, $C8, $11, $3B, $0F, $0E, $24 ; 1つ,しれんをの
|1CC7B8| db $39, $0C, $03, $1B ; りこえて
|1CC7BC| db $F8 ; row 2
|1CC7BD| db $FD, $5F ; kanji 大
|1CC7BF| db $09, $0A, $20, $38, $3B, $18 ; きくなられた
|1CC7C5| db $FD, $10 ; kanji 様
|1CC7C7| db $36, $12, $20, $CD ; ですな。
|1CC7CB| db $F9 ; row 3
|1CC7CC| db $FD, $08 ; kanji 頼
|1CC7CE| db $34, $11, $01, $08, $16, $39, $36, $12 ; もしいかぎりです
|1CC7D6| db $25, $47, $CD ; じゃ。
|1CC7D9| db $FB ; end of message

;===================================================================================================
; Catfish gifting quake
;===================================================================================================
; ワシのおひるねのジャマをする
; のは,お前か? これをやるか
; ら,あっちへ行ってくれ!
;===================================================================================================
Message_0128:
|1CC7DA| db $5D, $61, $24, $04, $29, $3A, $23, $24 ; ワシのおひるねの
|1CC7E2| db $75, $97, $80, $0E, $12, $3A ; ジャマをする
|1CC7E8| db $F8 ; row 2
|1CC7E9| db $24, $28, $C8, $04 ; のは,お
|1CC7ED| db $FD, $78 ; kanji 前
|1CC7EF| db $08, $C6, $FF, $0C, $3B, $0E, $05, $3A ; か?␣これをやる
|1CC7F7| db $08 ; か
|1CC7F8| db $F9 ; row 3
|1CC7F9| db $38, $C8, $00, $4A, $19, $2B ; ら,あっちへ
|1CC7FF| db $FD, $02 ; kanji 行
|1CC801| db $4A, $1B, $0A, $3B, $C7 ; ってくれ!
|1CC806| db $FB ; end of message

;===================================================================================================
; Catfish angry
;===================================================================================================
; もう,やる物はねえぞ!
; これでも,持ってけ!
;===================================================================================================
Message_0129:
|1CC807| db $34, $02, $C8, $05, $3A ; もう,やる
|1CC80C| db $FD, $51 ; kanji 物
|1CC80E| db $28, $23, $03, $2D, $C7 ; はねえぞ!
|1CC813| db $F8 ; row 2
|1CC814| db $0C, $3B, $36, $34, $C8 ; これでも,
|1CC819| db $FD, $DB ; kanji 持
|1CC81B| db $4A, $1B, $0B, $C7 ; ってけ!
|1CC81F| db $FB ; end of message

;===================================================================================================
; Left Bumpkin when no Master Sword
;===================================================================================================
; よう,[LINK]! このごろ
; 森にもあやしいキリがかかって
; うかつに入れもしねェーや。
;===================================================================================================
Message_012A:
|1CC820| db $07, $02, $C8 ; よう,
|1CC823| db $FE, $6A ; write player name
|1CC825| db $C7, $FF, $0C, $24, $1E, $3C ; !␣このごろ
|1CC82B| db $F8 ; row 2
|1CC82C| db $FD, $65 ; kanji 森
|1CC82E| db $21, $34, $00, $05, $11, $01, $59, $89 ; にもあやしいキリ
|1CC836| db $15, $08, $08, $4A, $1B ; がかかって
|1CC83B| db $F9 ; row 3
|1CC83C| db $02, $08, $1A, $21 ; うかつに
|1CC840| db $FD, $49 ; kanji 入
|1CC842| db $3B, $34, $11, $23, $9E, $C9, $05, $CD ; れもしねェーや。
|1CC84A| db $FB ; end of message

;===================================================================================================
; Right Bumpkin
;===================================================================================================
; どうでもいいけど,この木は,
; きりごたえがおかしいなあ。
; それっ ギ〜コ ギ〜コ
;===================================================================================================
Message_012B:
|1CC84B| db $37, $02, $36, $34, $01, $01, $0B, $37 ; どうでもいいけど
|1CC853| db $C8, $0C, $24 ; ,この
|1CC856| db $FD, $EB ; kanji 木
|1CC858| db $28, $C8 ; は,
|1CC85A| db $F8 ; row 2
|1CC85B| db $09, $39, $1E, $18, $03, $15, $04, $08 ; きりごたえがおか
|1CC863| db $11, $01, $20, $00, $CD ; しいなあ。
|1CC868| db $F9 ; row 3
|1CC869| db $14, $3B, $4A, $FF, $66, $CE, $5C, $FF ; それっ␣ギ〜コ␣
|1CC871| db $66, $CE, $5C ; ギ〜コ
|1CC874| db $FB ; end of message

;===================================================================================================
; Left Bumpkin when Master Sword is had
;===================================================================================================
; よう,森のキリがはれた様だな
; ありがてえことだ。また,でか
; けてみるよ。なあ,キョウダイ
;===================================================================================================
Message_012C:
|1CC875| db $07, $02, $C8 ; よう,
|1CC878| db $FD, $65 ; kanji 森
|1CC87A| db $24, $59, $89, $15, $28, $3B, $18 ; のキリがはれた
|1CC881| db $FD, $10 ; kanji 様
|1CC883| db $2E, $20 ; だな
|1CC885| db $F8 ; row 2
|1CC886| db $00, $39, $15, $1B, $03, $0C, $1C, $2E ; ありがてえことだ
|1CC88E| db $CD, $30, $18, $C8, $36, $08 ; 。また,でか
|1CC894| db $F9 ; row 3
|1CC895| db $0B, $1B, $31, $3A, $07, $CD, $20, $00 ; けてみるよ。なあ
|1CC89D| db $C8, $59, $99, $52, $7E, $51 ; ,キョウダイ
|1CC8A3| db $FB ; end of message

;===================================================================================================
; Angry brother east when door is closed
;===================================================================================================
; やあ,[LINK],今おとうとと
; ケンカしてんだ。 カベの
; 通路も,ふさいでやったい!
;===================================================================================================
Message_012D:
|1CC8A4| db $05, $00, $C8 ; やあ,
|1CC8A7| db $FE, $6A ; write player name
|1CC8A9| db $C8 ; ,
|1CC8AA| db $FD, $6A ; kanji 今
|1CC8AC| db $04, $1C, $02, $1C, $1C ; おとうとと
|1CC8B1| db $F8 ; row 2
|1CC8B2| db $5B, $5F, $58, $11, $1B, $0F, $2E, $CD ; ケンカしてんだ。
|1CC8BA| db $FF, $58, $90, $24 ; ␣カベの
|1CC8BE| db $F9 ; row 3
|1CC8BF| db $FD, $09 ; kanji 通
|1CC8C1| db $FD, $B6 ; kanji 路
|1CC8C3| db $34, $C8, $2A, $10, $01, $36, $05, $4A ; も,ふさいでやっ
|1CC8CB| db $18, $01, $C7 ; たい!
|1CC8CE| db $FB ; end of message

;===================================================================================================
; Angry brother east when door is opened
;===================================================================================================
; カベをこわしちまったな⋯。
; しかたない,なかなおり
; しようかな⋯。
;===================================================================================================
Message_012E:
|1CC8CF| db $58, $90, $0E, $0C, $0D, $11, $19, $30 ; カベをこわしちま
|1CC8D7| db $4A, $18, $20, $CC, $CD ; ったな⋯。
|1CC8DC| db $F8 ; row 2
|1CC8DD| db $11, $08, $18, $20, $01, $C8, $20, $08 ; しかたない,なか
|1CC8E5| db $20, $04, $39 ; なおり
|1CC8E8| db $F9 ; row 3
|1CC8E9| db $11, $07, $02, $08, $20, $CC, $CD ; しようかな⋯。
|1CC8F0| db $FB ; end of message

;===================================================================================================
; Angry brother west
;===================================================================================================
; ねえ,[LINK],にいちゃんの
; 部屋から来たの? にいちゃん
; まだ,おこってたかい?
;===================================================================================================
Message_012F:
|1CC8F1| db $23, $03, $C8 ; ねえ,
|1CC8F4| db $FE, $6A ; write player name
|1CC8F6| db $C8, $21, $01, $19, $47, $0F, $24 ; ,にいちゃんの
|1CC8FD| db $F8 ; row 2
|1CC8FE| db $FD, $B7 ; kanji 部
|1CC900| db $FD, $3D ; kanji 屋
|1CC902| db $08, $38 ; から
|1CC904| db $FD, $D6 ; kanji 来
|1CC906| db $18, $24, $C6, $FF, $21, $01, $19, $47 ; たの?␣にいちゃ
|1CC90E| db $0F ; ん
|1CC90F| db $F9 ; row 3
|1CC910| db $30, $2E, $C8, $04, $0C, $4A, $1B, $18 ; まだ,おこってた
|1CC918| db $08, $01, $C6 ; かい?
|1CC91B| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Palace of Darkness
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; ⋯この世界も,もともとは,
; 『トライフォース』のおかれた
; 聖地だったの。
; でも,それを手に入れた男⋯
; 盗賊のボス『ガノン』の悪しき
; 願いにより,こんな世界に⋯。
; 彼は,力をたくわえると私達の
; 光の世界をも支配しようと
; たくらんでいたようだわ。
; そして,私達賢者の力をうけつ
; ぐ7人の娘をカギに使い,封印
; を解き,さらにお城のあたりに
; もっと大きな力の通り道を開く
; つもりなの。でも,その道は
; まだ開ききっていないわ。
; まだ,まにあうわ。私達が,
; 7人そろえば,ガノンのひそむ
; 結界もやぶれるはずよ。
; 他の娘達の場所は,私の力で
; 知らせましょう。あなたが,ガ
; ノンを倒す事を信じています。
; その時私達も,もとの姿に
; 戻れるでしょう。
; ⋯ ⋯ ⋯ ⋯ ⋯
;===================================================================================================
Message_0130:
|1CC91C| db $FC, $02 ; text speed: 2
|1CC91E| db $FE, $6D, $01 ; position: low
|1CC921| db $FE, $6B, $02 ; border: 2
|1CC924| db $FE, $6A ; write player name
|1CC926| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CC92E| db $36 ; で
|1CC92F| db $F8 ; row 2
|1CC930| db $FD, $2D ; kanji 魔
|1CC932| db $FD, $F2 ; kanji 族
|1CC934| db $24 ; の
|1CC935| db $FD, $3E ; kanji 手
|1CC937| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CC93E| db $FD, $22 ; kanji 事
|1CC940| db $15 ; が
|1CC941| db $F9 ; row 3
|1CC942| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CC94A| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CC94F| db $FC, $01 ; text speed: 1
|1CC951| db $FA ; wait for key
|1CC952| db $F7 ; row 1
|1CC953| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC95B| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CC960| db $F8 ; row 2
|1CC961| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC969| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CC96E| db $F9 ; row 3
|1CC96F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC977| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CC97C| db $FC, $02 ; text speed: 2
|1CC97E| db $F7 ; row 1
|1CC97F| db $CC, $0C, $24 ; ⋯この
|1CC982| db $FD, $E8 ; kanji 世
|1CC984| db $FD, $E9 ; kanji 界
|1CC986| db $34, $C8, $34, $1C, $34, $1C, $28, $C8 ; も,もともとは,
|1CC98E| db $F8 ; row 2
|1CC98F| db $C4, $6C, $88, $51, $7A, $9F, $C9, $62 ; 『トライフォース
|1CC997| db $C5, $24, $04, $08, $3B, $18 ; 』のおかれた
|1CC99D| db $F9 ; row 3
|1CC99E| db $FD, $F6 ; kanji 聖
|1CC9A0| db $FD, $33 ; kanji 地
|1CC9A2| db $2E, $4A, $18, $24, $CD ; だったの。
|1CC9A7| db $FC, $01 ; text speed: 1
|1CC9A9| db $FA ; wait for key
|1CC9AA| db $F7 ; row 1
|1CC9AB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC9B3| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CC9B8| db $F8 ; row 2
|1CC9B9| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CC9C1| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CC9C7| db $F9 ; row 3
|1CC9C8| db $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣
|1CC9CF| db $FC, $02 ; text speed: 2
|1CC9D1| db $F7 ; row 1
|1CC9D2| db $36, $34, $C8, $14, $3B, $0E ; でも,それを
|1CC9D8| db $FD, $3E ; kanji 手
|1CC9DA| db $21 ; に
|1CC9DB| db $FD, $49 ; kanji 入
|1CC9DD| db $3B, $18 ; れた
|1CC9DF| db $FD, $5E ; kanji 男
|1CC9E1| db $CC ; ⋯
|1CC9E2| db $F8 ; row 2
|1CC9E3| db $FD, $F1 ; kanji 盗
|1CC9E5| db $FD, $EE ; kanji 賊
|1CC9E7| db $24, $91, $62, $C4, $65, $74, $5F, $C5 ; のボス『ガノン』
|1CC9EF| db $24 ; の
|1CC9F0| db $FD, $85 ; kanji 悪
|1CC9F2| db $11, $09 ; しき
|1CC9F4| db $F9 ; row 3
|1CC9F5| db $FD, $0A ; kanji 願
|1CC9F7| db $01, $21, $07, $39, $C8, $0C, $0F, $20 ; いにより,こんな
|1CC9FF| db $FD, $E8 ; kanji 世
|1CCA01| db $FD, $E9 ; kanji 界
|1CCA03| db $21, $CC, $CD ; に⋯。
|1CCA06| db $FC, $01 ; text speed: 1
|1CCA08| db $FA ; wait for key
|1CCA09| db $F7 ; row 1
|1CCA0A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA12| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCA17| db $F8 ; row 2
|1CCA18| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA20| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCA26| db $F9 ; row 3
|1CCA27| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA2F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCA35| db $FC, $02 ; text speed: 2
|1CCA37| db $F7 ; row 1
|1CCA38| db $FD, $14 ; kanji 彼
|1CCA3A| db $28, $C8 ; は,
|1CCA3C| db $FD, $99 ; kanji 力
|1CCA3E| db $0E, $18, $0A, $0D, $03, $3A, $1C ; をたくわえると
|1CCA45| db $FD, $26 ; kanji 私
|1CCA47| db $FD, $13 ; kanji 達
|1CCA49| db $24 ; の
|1CCA4A| db $F8 ; row 2
|1CCA4B| db $FD, $73 ; kanji 光
|1CCA4D| db $24 ; の
|1CCA4E| db $FD, $E8 ; kanji 世
|1CCA50| db $FD, $E9 ; kanji 界
|1CCA52| db $0E, $34 ; をも
|1CCA54| db $FD, $F0 ; kanji 支
|1CCA56| db $FD, $8E ; kanji 配
|1CCA58| db $11, $07, $02, $1C ; しようと
|1CCA5C| db $F9 ; row 3
|1CCA5D| db $18, $0A, $38, $0F, $36, $01, $18, $07 ; たくらんでいたよ
|1CCA65| db $02, $2E, $0D, $CD ; うだわ。
|1CCA69| db $FC, $01 ; text speed: 1
|1CCA6B| db $FA ; wait for key
|1CCA6C| db $F7 ; row 1
|1CCA6D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA75| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCA7B| db $F8 ; row 2
|1CCA7C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA84| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CCA88| db $F9 ; row 3
|1CCA89| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCA91| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CCA95| db $FC, $02 ; text speed: 2
|1CCA97| db $F7 ; row 1
|1CCA98| db $14, $11, $1B, $C8 ; そして,
|1CCA9C| db $FD, $26 ; kanji 私
|1CCA9E| db $FD, $13 ; kanji 達
|1CCAA0| db $FD, $C4 ; kanji 賢
|1CCAA2| db $FD, $1E ; kanji 者
|1CCAA4| db $24 ; の
|1CCAA5| db $FD, $99 ; kanji 力
|1CCAA7| db $0E, $02, $0B, $1A ; をうけつ
|1CCAAB| db $F8 ; row 2
|1CCAAC| db $17, $A7 ; ぐ7
|1CCAAE| db $FD, $38 ; kanji 人
|1CCAB0| db $24 ; の
|1CCAB1| db $FD, $00 ; kanji 娘
|1CCAB3| db $0E, $58, $66, $21 ; をカギに
|1CCAB7| db $FD, $89 ; kanji 使
|1CCAB9| db $01, $C8 ; い,
|1CCABB| db $FD, $9E ; kanji 封
|1CCABD| db $FD, $35 ; kanji 印
|1CCABF| db $F9 ; row 3
|1CCAC0| db $0E ; を
|1CCAC1| db $FD, $1C ; kanji 解
|1CCAC3| db $09, $C8, $10, $38, $21, $04 ; き,さらにお
|1CCAC9| db $FD, $01 ; kanji 城
|1CCACB| db $24, $00, $18, $39, $21 ; のあたりに
|1CCAD0| db $FC, $01 ; text speed: 1
|1CCAD2| db $FA ; wait for key
|1CCAD3| db $F7 ; row 1
|1CCAD4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCADC| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCAE2| db $F8 ; row 2
|1CCAE3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCAEB| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCAF1| db $F9 ; row 3
|1CCAF2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCAFA| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCB00| db $FC, $02 ; text speed: 2
|1CCB02| db $F7 ; row 1
|1CCB03| db $34, $4A, $1C ; もっと
|1CCB06| db $FD, $5F ; kanji 大
|1CCB08| db $09, $20 ; きな
|1CCB0A| db $FD, $99 ; kanji 力
|1CCB0C| db $24 ; の
|1CCB0D| db $FD, $09 ; kanji 通
|1CCB0F| db $39 ; り
|1CCB10| db $FD, $5D ; kanji 道
|1CCB12| db $0E ; を
|1CCB13| db $FD, $4B ; kanji 開
|1CCB15| db $0A ; く
|1CCB16| db $F8 ; row 2
|1CCB17| db $1A, $34, $39, $20, $24, $CD, $36, $34 ; つもりなの。でも
|1CCB1F| db $C8, $14, $24 ; ,その
|1CCB22| db $FD, $5D ; kanji 道
|1CCB24| db $28 ; は
|1CCB25| db $F9 ; row 3
|1CCB26| db $30, $2E ; まだ
|1CCB28| db $FD, $4B ; kanji 開
|1CCB2A| db $09, $09, $4A, $1B, $01, $20, $01, $0D ; ききっていないわ
|1CCB32| db $CD ; 。
|1CCB33| db $FC, $01 ; text speed: 1
|1CCB35| db $FA ; wait for key
|1CCB36| db $F7 ; row 1
|1CCB37| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCB3F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCB45| db $F8 ; row 2
|1CCB46| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCB4E| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCB53| db $F9 ; row 3
|1CCB54| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCB5C| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CCB60| db $FC, $02 ; text speed: 2
|1CCB62| db $F7 ; row 1
|1CCB63| db $30, $2E, $C8, $30, $21, $00, $02, $0D ; まだ,まにあうわ
|1CCB6B| db $CD ; 。
|1CCB6C| db $FD, $26 ; kanji 私
|1CCB6E| db $FD, $13 ; kanji 達
|1CCB70| db $15, $C8 ; が,
|1CCB72| db $F8 ; row 2
|1CCB73| db $A7 ; 7
|1CCB74| db $FD, $38 ; kanji 人
|1CCB76| db $14, $3C, $03, $3D, $C8, $65, $74, $5F ; そろえば,ガノン
|1CCB7E| db $24, $29, $14, $32 ; のひそむ
|1CCB82| db $F9 ; row 3
|1CCB83| db $FD, $83 ; kanji 結
|1CCB85| db $FD, $E9 ; kanji 界
|1CCB87| db $34, $05, $3F, $3B, $3A, $28, $26, $07 ; もやぶれるはずよ
|1CCB8F| db $CD ; 。
|1CCB90| db $FC, $01 ; text speed: 1
|1CCB92| db $FA ; wait for key
|1CCB93| db $F7 ; row 1
|1CCB94| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCB9C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCBA2| db $F8 ; row 2
|1CCBA3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCBAB| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCBB1| db $F9 ; row 3
|1CCBB2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCBBA| db $FF, $FF, $FF ; ␣␣␣
|1CCBBD| db $FC, $02 ; text speed: 2
|1CCBBF| db $F7 ; row 1
|1CCBC0| db $FD, $27 ; kanji 他
|1CCBC2| db $24 ; の
|1CCBC3| db $FD, $00 ; kanji 娘
|1CCBC5| db $FD, $13 ; kanji 達
|1CCBC7| db $24 ; の
|1CCBC8| db $FD, $A8 ; kanji 場
|1CCBCA| db $FD, $55 ; kanji 所
|1CCBCC| db $28, $C8 ; は,
|1CCBCE| db $FD, $26 ; kanji 私
|1CCBD0| db $24 ; の
|1CCBD1| db $FD, $99 ; kanji 力
|1CCBD3| db $36 ; で
|1CCBD4| db $FE, $79, $2D ; SFX3.2D
|1CCBD7| db $F8 ; row 2
|1CCBD8| db $FD, $93 ; kanji 知
|1CCBDA| db $38, $13, $30, $11, $49, $02, $CD, $00 ; らせましょう。あ
|1CCBE2| db $20, $18, $15, $C8, $65 ; なたが,ガ
|1CCBE7| db $F9 ; row 3
|1CCBE8| db $74, $5F, $0E ; ノンを
|1CCBEB| db $FD, $29 ; kanji 倒
|1CCBED| db $12 ; す
|1CCBEE| db $FD, $22 ; kanji 事
|1CCBF0| db $0E ; を
|1CCBF1| db $FD, $45 ; kanji 信
|1CCBF3| db $25, $1B, $01, $30, $12, $CD ; じています。
|1CCBF9| db $FC, $01 ; text speed: 1
|1CCBFB| db $FA ; wait for key
|1CCBFC| db $F7 ; row 1
|1CCBFD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCC05| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCC0A| db $F8 ; row 2
|1CCC0B| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCC13| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCC19| db $F9 ; row 3
|1CCC1A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCC22| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCC28| db $FC, $02 ; text speed: 2
|1CCC2A| db $F7 ; row 1
|1CCC2B| db $14, $24 ; その
|1CCC2D| db $FD, $88 ; kanji 時
|1CCC2F| db $FD, $26 ; kanji 私
|1CCC31| db $FD, $13 ; kanji 達
|1CCC33| db $34, $C8, $34, $1C, $24 ; も,もとの
|1CCC38| db $FD, $A2 ; kanji 姿
|1CCC3A| db $21 ; に
|1CCC3B| db $F8 ; row 2
|1CCC3C| db $FD, $0F ; kanji 戻
|1CCC3E| db $3B, $3A, $36, $11, $49, $02, $CD ; れるでしょう。
|1CCC45| db $F9 ; row 3
|1CCC46| db $FF, $CC, $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯␣⋯
|1CCC4E| db $FF, $CC ; ␣⋯
|1CCC50| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Swamp Palace
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; ⋯トライフォースは,それに
; ふれた者の願いをかなえます。
; その者が生きているかぎり⋯。
; だからこそ,聖地におかれ
; 選ばれた者だけにその場所が
; 伝えられてきたの。
; ところが,それがどこかで
; とぎれてしまったみたい⋯。
; そして,再び聖地をみつけた
; のが,ガノンドロフと言う
; 盗賊だったのよ。
; でも,幸いな事に彼は光の世界
; へ帰る方法がわからなかったの
; ⋯そう,思い出して。
; あなたは,勇者だけが使いこな
; せるマジカルミラーをもってい
; るじゃない!
; ヘブラ山にあった魔法陣が,
; 他にもいくつかあるの。
; それを使って2つの世界を行き
; 来すれば,闇の世界にひそむ
; 魔物達も探しだせるわ!
; 盗賊ガノンドロフ⋯いいえ,
; 闇の魔王ガノンを倒せるのは
; あなただけ⋯祈っています。
;===================================================================================================
Message_0131:
|1CCC51| db $FC, $02 ; text speed: 2
|1CCC53| db $FE, $6D, $01 ; position: low
|1CCC56| db $FE, $6B, $02 ; border: 2
|1CCC59| db $FE, $6A ; write player name
|1CCC5B| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CCC63| db $36 ; で
|1CCC64| db $F8 ; row 2
|1CCC65| db $FD, $2D ; kanji 魔
|1CCC67| db $FD, $F2 ; kanji 族
|1CCC69| db $24 ; の
|1CCC6A| db $FD, $3E ; kanji 手
|1CCC6C| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CCC73| db $FD, $22 ; kanji 事
|1CCC75| db $15 ; が
|1CCC76| db $F9 ; row 3
|1CCC77| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CCC7F| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CCC84| db $FC, $01 ; text speed: 1
|1CCC86| db $FA ; wait for key
|1CCC87| db $F7 ; row 1
|1CCC88| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCC90| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCC95| db $F8 ; row 2
|1CCC96| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCC9E| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCCA3| db $F9 ; row 3
|1CCCA4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCCAC| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCCB1| db $FC, $02 ; text speed: 2
|1CCCB3| db $F7 ; row 1
|1CCCB4| db $CC, $6C, $88, $51, $7A, $9F, $C9, $62 ; ⋯トライフォース
|1CCCBC| db $28, $C8, $14, $3B, $21 ; は,それに
|1CCCC1| db $F8 ; row 2
|1CCCC2| db $2A, $3B, $18 ; ふれた
|1CCCC5| db $FD, $1E ; kanji 者
|1CCCC7| db $24 ; の
|1CCCC8| db $FD, $0A ; kanji 願
|1CCCCA| db $01, $0E, $08, $20, $03, $30, $12, $CD ; いをかなえます。
|1CCCD2| db $F9 ; row 3
|1CCCD3| db $14, $24 ; その
|1CCCD5| db $FD, $1E ; kanji 者
|1CCCD7| db $15 ; が
|1CCCD8| db $FD, $B4 ; kanji 生
|1CCCDA| db $09, $1B, $01, $3A, $08, $16, $39, $CC ; きているかぎり⋯
|1CCCE2| db $CD ; 。
|1CCCE3| db $FC, $01 ; text speed: 1
|1CCCE5| db $FA ; wait for key
|1CCCE6| db $F7 ; row 1
|1CCCE7| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCCEF| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCCF4| db $F8 ; row 2
|1CCCF5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCCFD| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCD03| db $F9 ; row 3
|1CCD04| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD0C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCD12| db $FC, $02 ; text speed: 2
|1CCD14| db $F7 ; row 1
|1CCD15| db $2E, $08, $38, $0C, $14, $C8 ; だからこそ,
|1CCD1B| db $FD, $F6 ; kanji 聖
|1CCD1D| db $FD, $33 ; kanji 地
|1CCD1F| db $21, $04, $08, $3B ; におかれ
|1CCD23| db $F8 ; row 2
|1CCD24| db $FD, $81 ; kanji 選
|1CCD26| db $3D, $3B, $18 ; ばれた
|1CCD29| db $FD, $1E ; kanji 者
|1CCD2B| db $2E, $0B, $21, $14, $24 ; だけにその
|1CCD30| db $FD, $A8 ; kanji 場
|1CCD32| db $FD, $55 ; kanji 所
|1CCD34| db $15 ; が
|1CCD35| db $F9 ; row 3
|1CCD36| db $FD, $2E ; kanji 伝
|1CCD38| db $03, $38, $3B, $1B, $09, $18, $24, $CD ; えられてきたの。
|1CCD40| db $FC, $01 ; text speed: 1
|1CCD42| db $FA ; wait for key
|1CCD43| db $F7 ; row 1
|1CCD44| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD4C| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CCD50| db $F8 ; row 2
|1CCD51| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD59| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCD5F| db $F9 ; row 3
|1CCD60| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD68| db $FF ; ␣
|1CCD69| db $FC, $02 ; text speed: 2
|1CCD6B| db $F7 ; row 1
|1CCD6C| db $1C, $0C, $3C, $15, $C8, $14, $3B, $15 ; ところが,それが
|1CCD74| db $37, $0C, $08, $36 ; どこかで
|1CCD78| db $F8 ; row 2
|1CCD79| db $1C, $16, $3B, $1B, $11, $30, $4A, $18 ; とぎれてしまった
|1CCD81| db $31, $18, $01, $CC, $CD ; みたい⋯。
|1CCD86| db $FC, $01 ; text speed: 1
|1CCD88| db $FA ; wait for key
|1CCD89| db $F7 ; row 1
|1CCD8A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD92| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CCD96| db $F8 ; row 2
|1CCD97| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCD9F| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCDA4| db $FC, $02 ; text speed: 2
|1CCDA6| db $F7 ; row 1
|1CCDA7| db $14, $11, $1B, $C8 ; そして,
|1CCDAB| db $FD, $B3 ; kanji 再
|1CCDAD| db $3E ; び
|1CCDAE| db $FD, $F6 ; kanji 聖
|1CCDB0| db $FD, $33 ; kanji 地
|1CCDB2| db $0E, $31, $1A, $0B, $18 ; をみつけた
|1CCDB7| db $F8 ; row 2
|1CCDB8| db $24, $15, $C8, $65, $74, $5F, $87, $8C ; のが,ガノンドロ
|1CCDC0| db $7A, $1C ; フと
|1CCDC2| db $FD, $16 ; kanji 言
|1CCDC4| db $02 ; う
|1CCDC5| db $F9 ; row 3
|1CCDC6| db $FD, $F1 ; kanji 盗
|1CCDC8| db $FD, $EE ; kanji 賊
|1CCDCA| db $2E, $4A, $18, $24, $07, $CD ; だったのよ。
|1CCDD0| db $FC, $01 ; text speed: 1
|1CCDD2| db $FA ; wait for key
|1CCDD3| db $F7 ; row 1
|1CCDD4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCDDC| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCDE1| db $F8 ; row 2
|1CCDE2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCDEA| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCDEF| db $F9 ; row 3
|1CCDF0| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCDF8| db $FF, $FF ; ␣␣
|1CCDFA| db $FC, $02 ; text speed: 2
|1CCDFC| db $F7 ; row 1
|1CCDFD| db $36, $34, $C8 ; でも,
|1CCE00| db $FD, $4E ; kanji 幸
|1CCE02| db $01, $20 ; いな
|1CCE04| db $FD, $22 ; kanji 事
|1CCE06| db $21 ; に
|1CCE07| db $FD, $14 ; kanji 彼
|1CCE09| db $28 ; は
|1CCE0A| db $FD, $73 ; kanji 光
|1CCE0C| db $24 ; の
|1CCE0D| db $FD, $E8 ; kanji 世
|1CCE0F| db $FD, $E9 ; kanji 界
|1CCE11| db $F8 ; row 2
|1CCE12| db $2B ; へ
|1CCE13| db $FD, $D7 ; kanji 帰
|1CCE15| db $3A ; る
|1CCE16| db $FD, $20 ; kanji 方
|1CCE18| db $FD, $3C ; kanji 法
|1CCE1A| db $15, $0D, $08, $38, $20, $08, $4A, $18 ; がわからなかった
|1CCE22| db $24 ; の
|1CCE23| db $F9 ; row 3
|1CCE24| db $CC, $14, $02, $C8 ; ⋯そう,
|1CCE28| db $FD, $36 ; kanji 思
|1CCE2A| db $01 ; い
|1CCE2B| db $FD, $23 ; kanji 出
|1CCE2D| db $11, $1B, $CD ; して。
|1CCE30| db $FC, $01 ; text speed: 1
|1CCE32| db $FA ; wait for key
|1CCE33| db $F7 ; row 1
|1CCE34| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCE3C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCE42| db $F8 ; row 2
|1CCE43| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCE4B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCE51| db $F9 ; row 3
|1CCE52| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCE5A| db $FF, $FF ; ␣␣
|1CCE5C| db $FC, $02 ; text speed: 2
|1CCE5E| db $F7 ; row 1
|1CCE5F| db $00, $20, $18, $28, $C8 ; あなたは,
|1CCE64| db $FD, $A0 ; kanji 勇
|1CCE66| db $FD, $1E ; kanji 者
|1CCE68| db $2E, $0B, $15 ; だけが
|1CCE6B| db $FD, $89 ; kanji 使
|1CCE6D| db $01, $0C, $20 ; いこな
|1CCE70| db $F8 ; row 2
|1CCE71| db $13, $3A, $80, $75, $58, $8A, $81, $88 ; せるマジカルミラ
|1CCE79| db $C9, $0E, $34, $4A, $1B, $01 ; ーをもってい
|1CCE7F| db $F9 ; row 3
|1CCE80| db $3A, $25, $47, $20, $01, $C7 ; るじゃない!
|1CCE86| db $FC, $01 ; text speed: 1
|1CCE88| db $FA ; wait for key
|1CCE89| db $F7 ; row 1
|1CCE8A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCE92| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCE98| db $F8 ; row 2
|1CCE99| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCEA1| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCEA7| db $F9 ; row 3
|1CCEA8| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCEAE| db $FC, $02 ; text speed: 2
|1CCEB0| db $F7 ; row 1
|1CCEB1| db $7B, $8F, $88 ; ヘブラ
|1CCEB4| db $FD, $94 ; kanji 山
|1CCEB6| db $21, $00, $4A, $18 ; にあった
|1CCEBA| db $FD, $2D ; kanji 魔
|1CCEBC| db $FD, $3C ; kanji 法
|1CCEBE| db $FD, $C5 ; kanji 陣
|1CCEC0| db $15, $C8 ; が,
|1CCEC2| db $F8 ; row 2
|1CCEC3| db $FD, $27 ; kanji 他
|1CCEC5| db $21, $34, $01, $0A, $1A, $08, $00, $3A ; にもいくつかある
|1CCECD| db $24, $CD ; の。
|1CCECF| db $FC, $01 ; text speed: 1
|1CCED1| db $FA ; wait for key
|1CCED2| db $F7 ; row 1
|1CCED3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCEDB| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCEE0| db $F8 ; row 2
|1CCEE1| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCEE9| db $FF, $FF, $FF ; ␣␣␣
|1CCEEC| db $FC, $02 ; text speed: 2
|1CCEEE| db $F7 ; row 1
|1CCEEF| db $14, $3B, $0E ; それを
|1CCEF2| db $FD, $89 ; kanji 使
|1CCEF4| db $4A, $1B, $A2, $1A, $24 ; って2つの
|1CCEF9| db $FD, $E8 ; kanji 世
|1CCEFB| db $FD, $E9 ; kanji 界
|1CCEFD| db $0E ; を
|1CCEFE| db $FD, $02 ; kanji 行
|1CCF00| db $09 ; き
|1CCF01| db $F8 ; row 2
|1CCF02| db $FD, $D6 ; kanji 来
|1CCF04| db $12, $3B, $3D, $C8 ; すれば,
|1CCF08| db $FD, $57 ; kanji 闇
|1CCF0A| db $24 ; の
|1CCF0B| db $FD, $E8 ; kanji 世
|1CCF0D| db $FD, $E9 ; kanji 界
|1CCF0F| db $21, $29, $14, $32 ; にひそむ
|1CCF13| db $F9 ; row 3
|1CCF14| db $FD, $2D ; kanji 魔
|1CCF16| db $FD, $51 ; kanji 物
|1CCF18| db $FD, $13 ; kanji 達
|1CCF1A| db $34 ; も
|1CCF1B| db $FD, $69 ; kanji 探
|1CCF1D| db $11, $2E, $13, $3A, $0D, $C7 ; しだせるわ!
|1CCF23| db $FC, $01 ; text speed: 1
|1CCF25| db $FA ; wait for key
|1CCF26| db $F7 ; row 1
|1CCF27| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCF2F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CCF35| db $F8 ; row 2
|1CCF36| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCF3E| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCF43| db $F9 ; row 3
|1CCF44| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCF4C| db $FF, $FF, $FF ; ␣␣␣
|1CCF4F| db $FC, $02 ; text speed: 2
|1CCF51| db $F7 ; row 1
|1CCF52| db $FD, $F1 ; kanji 盗
|1CCF54| db $FD, $EE ; kanji 賊
|1CCF56| db $65, $74, $5F, $87, $8C, $7A, $CC, $01 ; ガノンドロフ⋯い
|1CCF5E| db $01, $03, $C8 ; いえ,
|1CCF61| db $F8 ; row 2
|1CCF62| db $FD, $57 ; kanji 闇
|1CCF64| db $24 ; の
|1CCF65| db $FD, $2D ; kanji 魔
|1CCF67| db $FD, $44 ; kanji 王
|1CCF69| db $65, $74, $5F, $0E ; ガノンを
|1CCF6D| db $FD, $29 ; kanji 倒
|1CCF6F| db $13, $3A, $24, $28 ; せるのは
|1CCF73| db $F9 ; row 3
|1CCF74| db $00, $20, $18, $2E, $0B, $CC ; あなただけ⋯
|1CCF7A| db $FD, $AF ; kanji 祈
|1CCF7C| db $4A, $1B, $01, $30, $12, $CD ; っています。
|1CCF82| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Skull Woods
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; ⋯『オオイナル ワザワイ』の
; 予言は知っていますか?
; 私は,こうきいています⋯。
; もしも,悪しき心をもつ者が,
; トライフォースを手にするなら
; ば,『勇者』が必ず現れ,
; この『オオイナル ワザワイ』
; のもととなる者をうつであろう
; しかし,『勇者』が倒れた時は
; 悪しき心の者に世界は,おおわ
; れてしまうであろう,と⋯。
; そう,『勇者』になれるのは,
; ハイリアの王家を守っていた
; ナイトのー族の者だけのはず⋯
; あなたは,その血をひいていた
; のね。 ゼルダ姫を必ず救って
; あげてね。
;===================================================================================================
Message_0132:
|1CCF83| db $FC, $02 ; text speed: 2
|1CCF85| db $FE, $6D, $01 ; position: low
|1CCF88| db $FE, $6B, $02 ; border: 2
|1CCF8B| db $FE, $6A ; write player name
|1CCF8D| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CCF95| db $36 ; で
|1CCF96| db $F8 ; row 2
|1CCF97| db $FD, $2D ; kanji 魔
|1CCF99| db $FD, $F2 ; kanji 族
|1CCF9B| db $24 ; の
|1CCF9C| db $FD, $3E ; kanji 手
|1CCF9E| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CCFA5| db $FD, $22 ; kanji 事
|1CCFA7| db $15 ; が
|1CCFA8| db $F9 ; row 3
|1CCFA9| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CCFB1| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CCFB6| db $FC, $01 ; text speed: 1
|1CCFB8| db $FA ; wait for key
|1CCFB9| db $F7 ; row 1
|1CCFBA| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCFC2| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCFC7| db $F8 ; row 2
|1CCFC8| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCFD0| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCFD5| db $F9 ; row 3
|1CCFD6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CCFDE| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CCFE3| db $FC, $02 ; text speed: 2
|1CCFE5| db $F7 ; row 1
|1CCFE6| db $CC, $C4, $54, $54, $51, $70, $8A, $FF ; ⋯『オオイナル␣
|1CCFEE| db $5D, $6F, $5D, $51, $C5, $24 ; ワザワイ』の
|1CCFF4| db $F8 ; row 2
|1CCFF5| db $FD, $F9 ; kanji 予
|1CCFF7| db $FD, $16 ; kanji 言
|1CCFF9| db $28 ; は
|1CCFFA| db $FD, $93 ; kanji 知
|1CCFFC| db $4A, $1B, $01, $30, $12, $08, $C6 ; っていますか?
|1CD003| db $F9 ; row 3
|1CD004| db $FD, $26 ; kanji 私
|1CD006| db $28, $C8, $0C, $02, $09, $01, $1B, $01 ; は,こうきいてい
|1CD00E| db $30, $12, $CC, $CD ; ます⋯。
|1CD012| db $FC, $01 ; text speed: 1
|1CD014| db $FA ; wait for key
|1CD015| db $F7 ; row 1
|1CD016| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD01E| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD024| db $F8 ; row 2
|1CD025| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD02D| db $FF, $FF, $FF ; ␣␣␣
|1CD030| db $F9 ; row 3
|1CD031| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD039| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD03E| db $FC, $02 ; text speed: 2
|1CD040| db $F7 ; row 1
|1CD041| db $34, $11, $34, $C8 ; もしも,
|1CD045| db $FD, $85 ; kanji 悪
|1CD047| db $11, $09 ; しき
|1CD049| db $FD, $E6 ; kanji 心
|1CD04B| db $0E, $34, $1A ; をもつ
|1CD04E| db $FD, $1E ; kanji 者
|1CD050| db $15, $C8 ; が,
|1CD052| db $F8 ; row 2
|1CD053| db $6C, $88, $51, $7A, $9F, $C9, $62, $0E ; トライフォースを
|1CD05B| db $FD, $3E ; kanji 手
|1CD05D| db $21, $12, $3A, $20, $38 ; にするなら
|1CD062| db $F9 ; row 3
|1CD063| db $3D, $C8, $C4 ; ば,『
|1CD066| db $FD, $A0 ; kanji 勇
|1CD068| db $FD, $1E ; kanji 者
|1CD06A| db $C5, $15 ; 』が
|1CD06C| db $FD, $30 ; kanji 必
|1CD06E| db $26 ; ず
|1CD06F| db $FD, $BC ; kanji 現
|1CD071| db $3B, $C8 ; れ,
|1CD073| db $FC, $01 ; text speed: 1
|1CD075| db $FA ; wait for key
|1CD076| db $F7 ; row 1
|1CD077| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD07F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD085| db $F8 ; row 2
|1CD086| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD08E| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD094| db $F9 ; row 3
|1CD095| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD09D| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CD0A1| db $FC, $02 ; text speed: 2
|1CD0A3| db $F7 ; row 1
|1CD0A4| db $0C, $24, $C4, $54, $54, $51, $70, $8A ; この『オオイナル
|1CD0AC| db $FF, $5D, $6F, $5D, $51, $C5 ; ␣ワザワイ』
|1CD0B2| db $F8 ; row 2
|1CD0B3| db $24, $34, $1C, $1C, $20, $3A ; のもととなる
|1CD0B9| db $FD, $1E ; kanji 者
|1CD0BB| db $0E, $02, $1A, $36, $00, $3C, $02 ; をうつであろう
|1CD0C2| db $FC, $01 ; text speed: 1
|1CD0C4| db $FA ; wait for key
|1CD0C5| db $F7 ; row 1
|1CD0C6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD0CE| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD0D4| db $F8 ; row 2
|1CD0D5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD0DD| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD0E3| db $FC, $02 ; text speed: 2
|1CD0E5| db $F7 ; row 1
|1CD0E6| db $11, $08, $11, $C8, $C4 ; しかし,『
|1CD0EB| db $FD, $A0 ; kanji 勇
|1CD0ED| db $FD, $1E ; kanji 者
|1CD0EF| db $C5, $15 ; 』が
|1CD0F1| db $FD, $29 ; kanji 倒
|1CD0F3| db $3B, $18 ; れた
|1CD0F5| db $FD, $88 ; kanji 時
|1CD0F7| db $28 ; は
|1CD0F8| db $F8 ; row 2
|1CD0F9| db $FD, $85 ; kanji 悪
|1CD0FB| db $11, $09 ; しき
|1CD0FD| db $FD, $E6 ; kanji 心
|1CD0FF| db $24 ; の
|1CD100| db $FD, $1E ; kanji 者
|1CD102| db $21 ; に
|1CD103| db $FD, $E8 ; kanji 世
|1CD105| db $FD, $E9 ; kanji 界
|1CD107| db $28, $C8, $04, $04, $0D ; は,おおわ
|1CD10C| db $F9 ; row 3
|1CD10D| db $3B, $1B, $11, $30, $02, $36, $00, $3C ; れてしまうであろ
|1CD115| db $02, $C8, $1C, $CC, $CD ; う,と⋯。
|1CD11A| db $FC, $01 ; text speed: 1
|1CD11C| db $FA ; wait for key
|1CD11D| db $F7 ; row 1
|1CD11E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD126| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD12C| db $F8 ; row 2
|1CD12D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD135| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD13B| db $F9 ; row 3
|1CD13C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD144| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD14A| db $FC, $02 ; text speed: 2
|1CD14C| db $F7 ; row 1
|1CD14D| db $14, $02, $C8, $C4 ; そう,『
|1CD151| db $FD, $A0 ; kanji 勇
|1CD153| db $FD, $1E ; kanji 者
|1CD155| db $C5, $21, $20, $3B, $3A, $24, $28, $C8 ; 』になれるのは,
|1CD15D| db $F8 ; row 2
|1CD15E| db $78, $51, $89, $50, $24 ; ハイリアの
|1CD163| db $FD, $44 ; kanji 王
|1CD165| db $FD, $56 ; kanji 家
|1CD167| db $0E ; を
|1CD168| db $FD, $91 ; kanji 守
|1CD16A| db $4A, $1B, $01, $18 ; っていた
|1CD16E| db $F9 ; row 3
|1CD16F| db $70, $51, $6C, $24, $C9 ; ナイトのー
|1CD174| db $FD, $F2 ; kanji 族
|1CD176| db $24 ; の
|1CD177| db $FD, $1E ; kanji 者
|1CD179| db $2E, $0B, $24, $28, $26, $CC ; だけのはず⋯
|1CD17F| db $FC, $01 ; text speed: 1
|1CD181| db $FA ; wait for key
|1CD182| db $F7 ; row 1
|1CD183| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD18B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD191| db $F8 ; row 2
|1CD192| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD19A| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD19F| db $F9 ; row 3
|1CD1A0| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD1A8| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD1AE| db $FC, $02 ; text speed: 2
|1CD1B0| db $F7 ; row 1
|1CD1B1| db $00, $20, $18, $28, $C8, $14, $24 ; あなたは,その
|1CD1B8| db $FD, $B9 ; kanji 血
|1CD1BA| db $0E, $29, $01, $1B, $01, $18 ; をひいていた
|1CD1C0| db $F8 ; row 2
|1CD1C1| db $24, $23, $CD, $FF, $77, $8A, $7E ; のね。␣ゼルダ
|1CD1C8| db $FD, $FF ; kanji 姫
|1CD1CA| db $0E ; を
|1CD1CB| db $FD, $30 ; kanji 必
|1CD1CD| db $26 ; ず
|1CD1CE| db $FD, $28 ; kanji 救
|1CD1D0| db $4A, $1B ; って
|1CD1D2| db $F9 ; row 3
|1CD1D3| db $00, $1D, $1B, $23, $CD ; あげてね。
|1CD1D8| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Thieves' Town
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; 7賢者が,闇世界との通路を
; 封印する時,魔族の攻撃から
; 賢者達を守ってくれたのが,
; ナイトのー族でした。その時の
; たたかいで,ナイトの血すじは
; ほとんどたえてしまったと,
; きいていたんだけど⋯。
; たぶん,あなたはナイトの血を
; ひくさいごの1人⋯。
; そのさいごの1人が『勇者』と
; なる力を秘めていたなんて,
; ふしぎな事ね。
; あなたなら,きっとガノンを
; 倒せるわ!
;===================================================================================================
Message_0133:
|1CD1D9| db $FC, $02 ; text speed: 2
|1CD1DB| db $FE, $6D, $01 ; position: low
|1CD1DE| db $FE, $6B, $02 ; border: 2
|1CD1E1| db $FE, $6A ; write player name
|1CD1E3| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CD1EB| db $36 ; で
|1CD1EC| db $F8 ; row 2
|1CD1ED| db $FD, $2D ; kanji 魔
|1CD1EF| db $FD, $F2 ; kanji 族
|1CD1F1| db $24 ; の
|1CD1F2| db $FD, $3E ; kanji 手
|1CD1F4| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CD1FB| db $FD, $22 ; kanji 事
|1CD1FD| db $15 ; が
|1CD1FE| db $F9 ; row 3
|1CD1FF| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CD207| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CD20C| db $FC, $01 ; text speed: 1
|1CD20E| db $FA ; wait for key
|1CD20F| db $F7 ; row 1
|1CD210| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD218| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD21D| db $F8 ; row 2
|1CD21E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD226| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD22B| db $F9 ; row 3
|1CD22C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD234| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD239| db $FC, $02 ; text speed: 2
|1CD23B| db $F7 ; row 1
|1CD23C| db $A7 ; 7
|1CD23D| db $FD, $C4 ; kanji 賢
|1CD23F| db $FD, $1E ; kanji 者
|1CD241| db $15, $C8 ; が,
|1CD243| db $FD, $57 ; kanji 闇
|1CD245| db $FD, $E8 ; kanji 世
|1CD247| db $FD, $E9 ; kanji 界
|1CD249| db $1C, $24 ; との
|1CD24B| db $FD, $09 ; kanji 通
|1CD24D| db $FD, $B6 ; kanji 路
|1CD24F| db $0E ; を
|1CD250| db $F8 ; row 2
|1CD251| db $FD, $9E ; kanji 封
|1CD253| db $FD, $35 ; kanji 印
|1CD255| db $12, $3A ; する
|1CD257| db $FD, $88 ; kanji 時
|1CD259| db $C8 ; ,
|1CD25A| db $FD, $2D ; kanji 魔
|1CD25C| db $FD, $F2 ; kanji 族
|1CD25E| db $24 ; の
|1CD25F| db $FD, $E2 ; kanji 攻
|1CD261| db $FD, $E3 ; kanji 撃
|1CD263| db $08, $38 ; から
|1CD265| db $F9 ; row 3
|1CD266| db $FD, $C4 ; kanji 賢
|1CD268| db $FD, $1E ; kanji 者
|1CD26A| db $FD, $13 ; kanji 達
|1CD26C| db $0E ; を
|1CD26D| db $FD, $91 ; kanji 守
|1CD26F| db $4A, $1B, $0A, $3B, $18, $24, $15, $C8 ; ってくれたのが,
|1CD277| db $FC, $01 ; text speed: 1
|1CD279| db $FA ; wait for key
|1CD27A| db $F7 ; row 1
|1CD27B| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD283| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD288| db $F8 ; row 2
|1CD289| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD291| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD296| db $F9 ; row 3
|1CD297| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD29F| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD2A4| db $FC, $02 ; text speed: 2
|1CD2A6| db $F7 ; row 1
|1CD2A7| db $70, $51, $6C, $24, $C9 ; ナイトのー
|1CD2AC| db $FD, $F2 ; kanji 族
|1CD2AE| db $36, $11, $18, $CD, $14, $24 ; でした。その
|1CD2B4| db $FD, $88 ; kanji 時
|1CD2B6| db $24 ; の
|1CD2B7| db $F8 ; row 2
|1CD2B8| db $18, $18, $08, $01, $36, $C8, $70, $51 ; たたかいで,ナイ
|1CD2C0| db $6C, $24 ; トの
|1CD2C2| db $FD, $B9 ; kanji 血
|1CD2C4| db $12, $25, $28 ; すじは
|1CD2C7| db $F9 ; row 3
|1CD2C8| db $2C, $1C, $0F, $37, $18, $03, $1B, $11 ; ほとんどたえてし
|1CD2D0| db $30, $4A, $18, $1C, $C8 ; まったと,
|1CD2D5| db $FC, $01 ; text speed: 1
|1CD2D7| db $FA ; wait for key
|1CD2D8| db $F7 ; row 1
|1CD2D9| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD2E1| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD2E7| db $F8 ; row 2
|1CD2E8| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD2F0| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD2F6| db $F9 ; row 3
|1CD2F7| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD2FF| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD304| db $FC, $02 ; text speed: 2
|1CD306| db $F7 ; row 1
|1CD307| db $09, $01, $1B, $01, $18, $0F, $2E, $0B ; きいていたんだけ
|1CD30F| db $37, $CC, $CD ; ど⋯。
|1CD312| db $F8 ; row 2
|1CD313| db $18, $3F, $0F, $C8, $00, $20, $18, $28 ; たぶん,あなたは
|1CD31B| db $70, $51, $6C, $24 ; ナイトの
|1CD31F| db $FD, $B9 ; kanji 血
|1CD321| db $0E ; を
|1CD322| db $F9 ; row 3
|1CD323| db $29, $0A, $10, $01, $1E, $24, $A1 ; ひくさいごの1
|1CD32A| db $FD, $38 ; kanji 人
|1CD32C| db $CC, $CD ; ⋯。
|1CD32E| db $FC, $01 ; text speed: 1
|1CD330| db $FA ; wait for key
|1CD331| db $F7 ; row 1
|1CD332| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD33A| db $FF, $FF, $FF ; ␣␣␣
|1CD33D| db $F8 ; row 2
|1CD33E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD346| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD34C| db $F9 ; row 3
|1CD34D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD355| db $FF, $FF ; ␣␣
|1CD357| db $FC, $02 ; text speed: 2
|1CD359| db $F7 ; row 1
|1CD35A| db $14, $24, $10, $01, $1E, $24, $A1 ; そのさいごの1
|1CD361| db $FD, $38 ; kanji 人
|1CD363| db $15, $C4 ; が『
|1CD365| db $FD, $A0 ; kanji 勇
|1CD367| db $FD, $1E ; kanji 者
|1CD369| db $C5, $1C ; 』と
|1CD36B| db $F8 ; row 2
|1CD36C| db $20, $3A ; なる
|1CD36E| db $FD, $99 ; kanji 力
|1CD370| db $0E ; を
|1CD371| db $FD, $C1 ; kanji 秘
|1CD373| db $33, $1B, $01, $18, $20, $0F, $1B, $C8 ; めていたなんて,
|1CD37B| db $F9 ; row 3
|1CD37C| db $2A, $11, $16, $20 ; ふしぎな
|1CD380| db $FD, $22 ; kanji 事
|1CD382| db $23, $CD ; ね。
|1CD384| db $FC, $01 ; text speed: 1
|1CD386| db $FA ; wait for key
|1CD387| db $F7 ; row 1
|1CD388| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD390| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD396| db $F8 ; row 2
|1CD397| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD39F| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD3A4| db $F9 ; row 3
|1CD3A5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣
|1CD3AC| db $FC, $02 ; text speed: 2
|1CD3AE| db $F7 ; row 1
|1CD3AF| db $00, $20, $18, $20, $38, $C8, $09, $4A ; あなたなら,きっ
|1CD3B7| db $1C, $65, $74, $5F, $0E ; とガノンを
|1CD3BC| db $F8 ; row 2
|1CD3BD| db $FD, $29 ; kanji 倒
|1CD3BF| db $13, $3A, $0D, $C7 ; せるわ!
|1CD3C3| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Ice Palace
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; ハイリアの民は,ふしぎな力を
; あやつることが,できたと言い
; ます。7賢者もそうだったの。
; でも,長い年月の間にハイリア
; の血はうすれ,7賢者の血を
; ひく私達も強い力はありません
; ただ,勇気を司どるナイトの力
; があれば,知恵を司どる賢者の
; 力もより大きくなるはずよ!
; お城にできた,光と闇をつなぐ
; 道が,完全に開くまで
; もう,あまり時間がないわ。
; ガノンを倒せば,この闇の世界
; もなくなり,トライフォースは
; また,つぎの持ちぬしが,
; 現れるのをまっているはずです
; あなたを信じています。
; ⋯ がんばって⋯。
;===================================================================================================
Message_0134:
|1CD3C4| db $FC, $02 ; text speed: 2
|1CD3C6| db $FE, $6D, $01 ; position: low
|1CD3C9| db $FE, $6B, $02 ; border: 2
|1CD3CC| db $FE, $6A ; write player name
|1CD3CE| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CD3D6| db $36 ; で
|1CD3D7| db $F8 ; row 2
|1CD3D8| db $FD, $2D ; kanji 魔
|1CD3DA| db $FD, $F2 ; kanji 族
|1CD3DC| db $24 ; の
|1CD3DD| db $FD, $3E ; kanji 手
|1CD3DF| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CD3E6| db $FD, $22 ; kanji 事
|1CD3E8| db $15 ; が
|1CD3E9| db $F9 ; row 3
|1CD3EA| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CD3F2| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CD3F7| db $FC, $01 ; text speed: 1
|1CD3F9| db $FA ; wait for key
|1CD3FA| db $F7 ; row 1
|1CD3FB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD403| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD408| db $F8 ; row 2
|1CD409| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD411| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD416| db $F9 ; row 3
|1CD417| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD41F| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD424| db $FC, $02 ; text speed: 2
|1CD426| db $F7 ; row 1
|1CD427| db $78, $51, $89, $50, $24 ; ハイリアの
|1CD42C| db $FD, $F8 ; kanji 民
|1CD42E| db $28, $C8, $2A, $11, $16, $20 ; は,ふしぎな
|1CD434| db $FD, $99 ; kanji 力
|1CD436| db $0E ; を
|1CD437| db $F8 ; row 2
|1CD438| db $00, $05, $1A, $3A, $0C, $1C, $15, $C8 ; あやつることが,
|1CD440| db $36, $09, $18, $1C ; できたと
|1CD444| db $FD, $16 ; kanji 言
|1CD446| db $01 ; い
|1CD447| db $F9 ; row 3
|1CD448| db $30, $12, $CD, $A7 ; ます。7
|1CD44C| db $FD, $C4 ; kanji 賢
|1CD44E| db $FD, $1E ; kanji 者
|1CD450| db $34, $14, $02, $2E, $4A, $18, $24, $CD ; もそうだったの。
|1CD458| db $FC, $01 ; text speed: 1
|1CD45A| db $FA ; wait for key
|1CD45B| db $F7 ; row 1
|1CD45C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD464| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD46A| db $F8 ; row 2
|1CD46B| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD473| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD479| db $F9 ; row 3
|1CD47A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD482| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD488| db $FC, $02 ; text speed: 2
|1CD48A| db $F7 ; row 1
|1CD48B| db $36, $34, $C8 ; でも,
|1CD48E| db $FD, $8D ; kanji 長
|1CD490| db $01 ; い
|1CD491| db $FD, $A1 ; kanji 年
|1CD493| db $FD, $FE ; kanji 月
|1CD495| db $24 ; の
|1CD496| db $FD, $39 ; kanji 間
|1CD498| db $21, $78, $51, $89, $50 ; にハイリア
|1CD49D| db $F8 ; row 2
|1CD49E| db $24 ; の
|1CD49F| db $FD, $B9 ; kanji 血
|1CD4A1| db $28, $02, $12, $3B, $C8, $A7 ; はうすれ,7
|1CD4A7| db $FD, $C4 ; kanji 賢
|1CD4A9| db $FD, $1E ; kanji 者
|1CD4AB| db $24 ; の
|1CD4AC| db $FD, $B9 ; kanji 血
|1CD4AE| db $0E ; を
|1CD4AF| db $F9 ; row 3
|1CD4B0| db $29, $0A ; ひく
|1CD4B2| db $FD, $26 ; kanji 私
|1CD4B4| db $FD, $13 ; kanji 達
|1CD4B6| db $34 ; も
|1CD4B7| db $FD, $FB ; kanji 強
|1CD4B9| db $01 ; い
|1CD4BA| db $FD, $99 ; kanji 力
|1CD4BC| db $28, $00, $39, $30, $13, $0F ; はありません
|1CD4C2| db $FC, $01 ; text speed: 1
|1CD4C4| db $FA ; wait for key
|1CD4C5| db $F7 ; row 1
|1CD4C6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD4CE| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD4D4| db $F8 ; row 2
|1CD4D5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD4DD| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD4E2| db $F9 ; row 3
|1CD4E3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD4EB| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD4F1| db $FC, $02 ; text speed: 2
|1CD4F3| db $F7 ; row 1
|1CD4F4| db $18, $2E, $C8 ; ただ,
|1CD4F7| db $FD, $A0 ; kanji 勇
|1CD4F9| db $FD, $37 ; kanji 気
|1CD4FB| db $0E ; を
|1CD4FC| db $FD, $0D ; kanji 司
|1CD4FE| db $37, $3A, $70, $51, $6C, $24 ; どるナイトの
|1CD504| db $FD, $99 ; kanji 力
|1CD506| db $F8 ; row 2
|1CD507| db $15, $00, $3B, $3D, $C8 ; があれば,
|1CD50C| db $FD, $93 ; kanji 知
|1CD50E| db $FD, $41 ; kanji 恵
|1CD510| db $0E ; を
|1CD511| db $FD, $0D ; kanji 司
|1CD513| db $37, $3A ; どる
|1CD515| db $FD, $C4 ; kanji 賢
|1CD517| db $FD, $1E ; kanji 者
|1CD519| db $24 ; の
|1CD51A| db $F9 ; row 3
|1CD51B| db $FD, $99 ; kanji 力
|1CD51D| db $34, $07, $39 ; もより
|1CD520| db $FD, $5F ; kanji 大
|1CD522| db $09, $0A, $20, $3A, $28, $26, $07, $C7 ; きくなるはずよ!
|1CD52A| db $FC, $01 ; text speed: 1
|1CD52C| db $FA ; wait for key
|1CD52D| db $F7 ; row 1
|1CD52E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD536| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD53C| db $F8 ; row 2
|1CD53D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD545| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD54B| db $F9 ; row 3
|1CD54C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD554| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD55A| db $FC, $02 ; text speed: 2
|1CD55C| db $F7 ; row 1
|1CD55D| db $04 ; お
|1CD55E| db $FD, $01 ; kanji 城
|1CD560| db $21, $36, $09, $18, $C8 ; にできた,
|1CD565| db $FD, $73 ; kanji 光
|1CD567| db $1C ; と
|1CD568| db $FD, $57 ; kanji 闇
|1CD56A| db $0E, $1A, $20, $17 ; をつなぐ
|1CD56E| db $F8 ; row 2
|1CD56F| db $FD, $5D ; kanji 道
|1CD571| db $15, $C8 ; が,
|1CD573| db $FD, $BA ; kanji 完
|1CD575| db $FD, $BE ; kanji 全
|1CD577| db $21 ; に
|1CD578| db $FD, $4B ; kanji 開
|1CD57A| db $0A, $30, $36 ; くまで
|1CD57D| db $F9 ; row 3
|1CD57E| db $34, $02, $C8, $00, $30, $39 ; もう,あまり
|1CD584| db $FD, $88 ; kanji 時
|1CD586| db $FD, $39 ; kanji 間
|1CD588| db $15, $20, $01, $0D, $CD ; がないわ。
|1CD58D| db $FC, $01 ; text speed: 1
|1CD58F| db $FA ; wait for key
|1CD590| db $F7 ; row 1
|1CD591| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD599| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD59F| db $F8 ; row 2
|1CD5A0| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD5A8| db $FF, $FF ; ␣␣
|1CD5AA| db $F9 ; row 3
|1CD5AB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD5B3| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD5B8| db $FC, $02 ; text speed: 2
|1CD5BA| db $F7 ; row 1
|1CD5BB| db $65, $74, $5F, $0E ; ガノンを
|1CD5BF| db $FD, $29 ; kanji 倒
|1CD5C1| db $13, $3D, $C8, $0C, $24 ; せば,この
|1CD5C6| db $FD, $57 ; kanji 闇
|1CD5C8| db $24 ; の
|1CD5C9| db $FD, $E8 ; kanji 世
|1CD5CB| db $FD, $E9 ; kanji 界
|1CD5CD| db $F8 ; row 2
|1CD5CE| db $34, $20, $0A, $20, $39, $C8, $6C, $88 ; もなくなり,トラ
|1CD5D6| db $51, $7A, $9F, $C9, $62, $28 ; イフォースは
|1CD5DC| db $F9 ; row 3
|1CD5DD| db $30, $18, $C8, $1A, $16, $24 ; また,つぎの
|1CD5E3| db $FD, $DB ; kanji 持
|1CD5E5| db $19, $22, $11, $15, $C8 ; ちぬしが,
|1CD5EA| db $FC, $01 ; text speed: 1
|1CD5EC| db $FA ; wait for key
|1CD5ED| db $F7 ; row 1
|1CD5EE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD5F6| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD5FC| db $F8 ; row 2
|1CD5FD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD605| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD60B| db $F9 ; row 3
|1CD60C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD614| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CD618| db $FC, $02 ; text speed: 2
|1CD61A| db $F7 ; row 1
|1CD61B| db $FD, $BC ; kanji 現
|1CD61D| db $3B, $3A, $24, $0E, $30, $4A, $1B, $01 ; れるのをまってい
|1CD625| db $3A, $28, $26, $36, $12 ; るはずです
|1CD62A| db $F8 ; row 2
|1CD62B| db $00, $20, $18, $0E ; あなたを
|1CD62F| db $FD, $45 ; kanji 信
|1CD631| db $25, $1B, $01, $30, $12, $CD ; じています。
|1CD637| db $F9 ; row 3
|1CD638| db $FF, $CC, $FF, $15, $0F, $3D, $4A, $1B ; ␣⋯␣がんばって
|1CD640| db $CC, $CD ; ⋯。
|1CD642| db $FB ; end of message

;===================================================================================================
; Crystal maiden in Misery Mire
;===================================================================================================
; [LINK] あなたのおかげで
; 魔族の手から,のがれる事が
; できました。ありがとう⋯。
; ガノンが私達を集めたのは,
; ガノンの力では7賢者の封印を
; やぶれなかったからなの。
; そこで,司祭アグニムを使って
; 賢者の力をうけつぐ娘7人を
; 闇世界におくりこませたの。
; 7人の力をりようして,封印を
; やぶったあと,ようがすんだ
; 私達はクリスタルに封じられ,
; 魔物達にあたえられたわ。ただ
; あなたの事を知らなかったのは
; ガノンのミスだったわね。
; さあ,ゼルダ姫がカメイワで
; あなたをまっています。
; 急いで行ってあげて下さい。
;===================================================================================================
Message_0135:
|1CD643| db $FC, $02 ; text speed: 2
|1CD645| db $FE, $6D, $01 ; position: low
|1CD648| db $FE, $6B, $02 ; border: 2
|1CD64B| db $FE, $6A ; write player name
|1CD64D| db $FF, $00, $20, $18, $24, $04, $08, $1D ; ␣あなたのおかげ
|1CD655| db $36 ; で
|1CD656| db $F8 ; row 2
|1CD657| db $FD, $2D ; kanji 魔
|1CD659| db $FD, $F2 ; kanji 族
|1CD65B| db $24 ; の
|1CD65C| db $FD, $3E ; kanji 手
|1CD65E| db $08, $38, $C8, $24, $15, $3B, $3A ; から,のがれる
|1CD665| db $FD, $22 ; kanji 事
|1CD667| db $15 ; が
|1CD668| db $F9 ; row 3
|1CD669| db $36, $09, $30, $11, $18, $CD, $00, $39 ; できました。あり
|1CD671| db $15, $1C, $02, $CC, $CD ; がとう⋯。
|1CD676| db $FC, $01 ; text speed: 1
|1CD678| db $FA ; wait for key
|1CD679| db $F7 ; row 1
|1CD67A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD682| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD687| db $F8 ; row 2
|1CD688| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD690| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD695| db $F9 ; row 3
|1CD696| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD69E| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD6A3| db $FC, $02 ; text speed: 2
|1CD6A5| db $F7 ; row 1
|1CD6A6| db $65, $74, $5F, $15 ; ガノンが
|1CD6AA| db $FD, $26 ; kanji 私
|1CD6AC| db $FD, $13 ; kanji 達
|1CD6AE| db $0E ; を
|1CD6AF| db $FD, $E0 ; kanji 集
|1CD6B1| db $33, $18, $24, $28, $C8 ; めたのは,
|1CD6B6| db $F8 ; row 2
|1CD6B7| db $65, $74, $5F, $24 ; ガノンの
|1CD6BB| db $FD, $99 ; kanji 力
|1CD6BD| db $36, $28, $A7 ; では7
|1CD6C0| db $FD, $C4 ; kanji 賢
|1CD6C2| db $FD, $1E ; kanji 者
|1CD6C4| db $24 ; の
|1CD6C5| db $FD, $9E ; kanji 封
|1CD6C7| db $FD, $35 ; kanji 印
|1CD6C9| db $0E ; を
|1CD6CA| db $F9 ; row 3
|1CD6CB| db $05, $3F, $3B, $20, $08, $4A, $18, $08 ; やぶれなかったか
|1CD6D3| db $38, $20, $24, $CD ; らなの。
|1CD6D7| db $FC, $01 ; text speed: 1
|1CD6D9| db $FA ; wait for key
|1CD6DA| db $F7 ; row 1
|1CD6DB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD6E3| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD6E8| db $F8 ; row 2
|1CD6E9| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD6F1| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD6F7| db $F9 ; row 3
|1CD6F8| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD700| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CD704| db $FC, $02 ; text speed: 2
|1CD706| db $F7 ; row 1
|1CD707| db $14, $0C, $36, $C8 ; そこで,
|1CD70B| db $FD, $0D ; kanji 司
|1CD70D| db $FD, $17 ; kanji 祭
|1CD70F| db $50, $67, $71, $82, $0E ; アグニムを
|1CD714| db $FD, $89 ; kanji 使
|1CD716| db $4A, $1B ; って
|1CD718| db $F8 ; row 2
|1CD719| db $FD, $C4 ; kanji 賢
|1CD71B| db $FD, $1E ; kanji 者
|1CD71D| db $24 ; の
|1CD71E| db $FD, $99 ; kanji 力
|1CD720| db $0E, $02, $0B, $1A, $17 ; をうけつぐ
|1CD725| db $FD, $00 ; kanji 娘
|1CD727| db $A7 ; 7
|1CD728| db $FD, $38 ; kanji 人
|1CD72A| db $0E ; を
|1CD72B| db $F9 ; row 3
|1CD72C| db $FD, $57 ; kanji 闇
|1CD72E| db $FD, $E8 ; kanji 世
|1CD730| db $FD, $E9 ; kanji 界
|1CD732| db $21, $04, $0A, $39, $0C, $30, $13, $18 ; におくりこませた
|1CD73A| db $24, $CD ; の。
|1CD73C| db $FC, $01 ; text speed: 1
|1CD73E| db $FA ; wait for key
|1CD73F| db $F7 ; row 1
|1CD740| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD748| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD74E| db $F8 ; row 2
|1CD74F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD757| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD75C| db $F9 ; row 3
|1CD75D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD765| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD76A| db $FC, $02 ; text speed: 2
|1CD76C| db $F7 ; row 1
|1CD76D| db $A7 ; 7
|1CD76E| db $FD, $38 ; kanji 人
|1CD770| db $24 ; の
|1CD771| db $FD, $99 ; kanji 力
|1CD773| db $0E, $39, $07, $02, $11, $1B, $C8 ; をりようして,
|1CD77A| db $FD, $9E ; kanji 封
|1CD77C| db $FD, $35 ; kanji 印
|1CD77E| db $0E ; を
|1CD77F| db $F8 ; row 2
|1CD780| db $05, $3F, $4A, $18, $00, $1C, $C8, $07 ; やぶったあと,よ
|1CD788| db $02, $15, $12, $0F, $2E ; うがすんだ
|1CD78D| db $F9 ; row 3
|1CD78E| db $FD, $26 ; kanji 私
|1CD790| db $FD, $13 ; kanji 達
|1CD792| db $28, $5A, $89, $62, $68, $8A, $21 ; はクリスタルに
|1CD799| db $FD, $9E ; kanji 封
|1CD79B| db $25, $38, $3B, $C8 ; じられ,
|1CD79F| db $FC, $01 ; text speed: 1
|1CD7A1| db $FA ; wait for key
|1CD7A2| db $F7 ; row 1
|1CD7A3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD7AB| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD7B1| db $F8 ; row 2
|1CD7B2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD7BA| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD7BF| db $F9 ; row 3
|1CD7C0| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD7C8| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD7CE| db $FC, $02 ; text speed: 2
|1CD7D0| db $F7 ; row 1
|1CD7D1| db $FD, $2D ; kanji 魔
|1CD7D3| db $FD, $51 ; kanji 物
|1CD7D5| db $FD, $13 ; kanji 達
|1CD7D7| db $21, $00, $18, $03, $38, $3B, $18, $0D ; にあたえられたわ
|1CD7DF| db $CD, $18, $2E ; 。ただ
|1CD7E2| db $F8 ; row 2
|1CD7E3| db $00, $20, $18, $24 ; あなたの
|1CD7E7| db $FD, $22 ; kanji 事
|1CD7E9| db $0E ; を
|1CD7EA| db $FD, $93 ; kanji 知
|1CD7EC| db $38, $20, $08, $4A, $18, $24, $28 ; らなかったのは
|1CD7F3| db $F9 ; row 3
|1CD7F4| db $65, $74, $5F, $24, $81, $62, $2E, $4A ; ガノンのミスだっ
|1CD7FC| db $18, $0D, $23, $CD ; たわね。
|1CD800| db $FC, $01 ; text speed: 1
|1CD802| db $FA ; wait for key
|1CD803| db $F7 ; row 1
|1CD804| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD80C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD812| db $F8 ; row 2
|1CD813| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD81B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD821| db $F9 ; row 3
|1CD822| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD82A| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CD82E| db $FC, $02 ; text speed: 2
|1CD830| db $F7 ; row 1
|1CD831| db $10, $00, $C8, $77, $8A, $7E ; さあ,ゼルダ
|1CD837| db $FD, $FF ; kanji 姫
|1CD839| db $15, $58, $83, $51, $5D, $36 ; がカメイワで
|1CD83F| db $F8 ; row 2
|1CD840| db $00, $20, $18, $0E, $30, $4A, $1B, $01 ; あなたをまってい
|1CD848| db $30, $12, $CD ; ます。
|1CD84B| db $F9 ; row 3
|1CD84C| db $FD, $7D ; kanji 急
|1CD84E| db $01, $36 ; いで
|1CD850| db $FD, $02 ; kanji 行
|1CD852| db $4A, $1B, $00, $1D, $1B ; ってあげて
|1CD857| db $FD, $61 ; kanji 下
|1CD859| db $10, $01, $CD ; さい。
|1CD85C| db $FB ; end of message

;===================================================================================================
; Zelda in Turtle Rock
;===================================================================================================
; [LINK],よくここまで来てく
; れました。 やっぱりあなたが
; 伝説の『勇者』だったのね。
; はじめて会った時から,そんな
; 気がしていました。
; ⋯ ⋯ ⋯
; ガノンは,デスマウンテンの塔
; に結界をはり,2つの世界の通
; り道をぬける時をまっています
; ガノンが光の世界へ出てしまっ
; たら,もう捕える事はできない
; かも知れないわ。
; でも,このとじた空間のなかな
; ら,どこへ逃げても必ず見付け
; る事ができます。
; さあ,7つのクリスタルをもっ
; て,ガノンの塔へ急ぎましょう
; 結界は,私達の力でやぶります
; [LINK] ⋯
; 必ず平和な国を
; とり戻しましょうね ⋯ ⋯
;===================================================================================================
Message_0136:
|1CD85D| db $FC, $02 ; text speed: 2
|1CD85F| db $FE, $6D, $01 ; position: low
|1CD862| db $FE, $6B, $02 ; border: 2
|1CD865| db $FE, $6A ; write player name
|1CD867| db $C8, $07, $0A, $0C, $0C, $30, $36 ; ,よくここまで
|1CD86E| db $FD, $D6 ; kanji 来
|1CD870| db $1B, $0A ; てく
|1CD872| db $F8 ; row 2
|1CD873| db $3B, $30, $11, $18, $CD, $FF, $05, $4A ; れました。␣やっ
|1CD87B| db $42, $39, $00, $20, $18, $15 ; ぱりあなたが
|1CD881| db $F9 ; row 3
|1CD882| db $FD, $2E ; kanji 伝
|1CD884| db $FD, $2F ; kanji 説
|1CD886| db $24, $C4 ; の『
|1CD888| db $FD, $A0 ; kanji 勇
|1CD88A| db $FD, $1E ; kanji 者
|1CD88C| db $C5, $2E, $4A, $18, $24, $23, $CD ; 』だったのね。
|1CD893| db $FC, $01 ; text speed: 1
|1CD895| db $FA ; wait for key
|1CD896| db $F7 ; row 1
|1CD897| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD89F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD8A5| db $F8 ; row 2
|1CD8A6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD8AE| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD8B4| db $F9 ; row 3
|1CD8B5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD8BD| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CD8C2| db $FC, $02 ; text speed: 2
|1CD8C4| db $F7 ; row 1
|1CD8C5| db $28, $25, $33, $1B ; はじめて
|1CD8C9| db $FD, $04 ; kanji 会
|1CD8CB| db $4A, $18 ; った
|1CD8CD| db $FD, $88 ; kanji 時
|1CD8CF| db $08, $38, $C8, $14, $0F, $20 ; から,そんな
|1CD8D5| db $F8 ; row 2
|1CD8D6| db $FD, $37 ; kanji 気
|1CD8D8| db $15, $11, $1B, $01, $30, $11, $18, $CD ; がしていました。
|1CD8E0| db $F9 ; row 3
|1CD8E1| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CD8E7| db $FC, $01 ; text speed: 1
|1CD8E9| db $FA ; wait for key
|1CD8EA| db $F7 ; row 1
|1CD8EB| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD8F3| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD8F9| db $F8 ; row 2
|1CD8FA| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD902| db $FF ; ␣
|1CD903| db $F9 ; row 3
|1CD904| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD90A| db $FC, $02 ; text speed: 2
|1CD90C| db $F7 ; row 1
|1CD90D| db $65, $74, $5F, $28, $C8, $86, $62, $80 ; ガノンは,デスマ
|1CD915| db $52, $5F, $6B, $5F, $24 ; ウンテンの
|1CD91A| db $FD, $D5 ; kanji 塔
|1CD91C| db $F8 ; row 2
|1CD91D| db $21 ; に
|1CD91E| db $FD, $83 ; kanji 結
|1CD920| db $FD, $E9 ; kanji 界
|1CD922| db $0E, $28, $39, $C8, $A2, $1A, $24 ; をはり,2つの
|1CD929| db $FD, $E8 ; kanji 世
|1CD92B| db $FD, $E9 ; kanji 界
|1CD92D| db $24 ; の
|1CD92E| db $FD, $09 ; kanji 通
|1CD930| db $F9 ; row 3
|1CD931| db $39 ; り
|1CD932| db $FD, $5D ; kanji 道
|1CD934| db $0E, $22, $0B, $3A ; をぬける
|1CD938| db $FD, $88 ; kanji 時
|1CD93A| db $0E, $30, $4A, $1B, $01, $30, $12 ; をまっています
|1CD941| db $FC, $01 ; text speed: 1
|1CD943| db $FA ; wait for key
|1CD944| db $F7 ; row 1
|1CD945| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD94D| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD953| db $F8 ; row 2
|1CD954| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD95C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD962| db $F9 ; row 3
|1CD963| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD96B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD971| db $FC, $02 ; text speed: 2
|1CD973| db $F7 ; row 1
|1CD974| db $65, $74, $5F, $15 ; ガノンが
|1CD978| db $FD, $73 ; kanji 光
|1CD97A| db $24 ; の
|1CD97B| db $FD, $E8 ; kanji 世
|1CD97D| db $FD, $E9 ; kanji 界
|1CD97F| db $2B ; へ
|1CD980| db $FD, $23 ; kanji 出
|1CD982| db $1B, $11, $30, $4A ; てしまっ
|1CD986| db $F8 ; row 2
|1CD987| db $18, $38, $C8, $34, $02 ; たら,もう
|1CD98C| db $FD, $9F ; kanji 捕
|1CD98E| db $03, $3A ; える
|1CD990| db $FD, $22 ; kanji 事
|1CD992| db $28, $36, $09, $20, $01 ; はできない
|1CD997| db $F9 ; row 3
|1CD998| db $08, $34 ; かも
|1CD99A| db $FD, $93 ; kanji 知
|1CD99C| db $3B, $20, $01, $0D, $CD ; れないわ。
|1CD9A1| db $FC, $01 ; text speed: 1
|1CD9A3| db $FA ; wait for key
|1CD9A4| db $F7 ; row 1
|1CD9A5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD9AD| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD9B3| db $F8 ; row 2
|1CD9B4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD9BC| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CD9C2| db $F9 ; row 3
|1CD9C3| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CD9CB| db $FC, $02 ; text speed: 2
|1CD9CD| db $F7 ; row 1
|1CD9CE| db $36, $34, $C8, $0C, $24, $1C, $25, $18 ; でも,このとじた
|1CD9D6| db $FD, $AA ; kanji 空
|1CD9D8| db $FD, $39 ; kanji 間
|1CD9DA| db $24, $20, $08, $20 ; のなかな
|1CD9DE| db $F8 ; row 2
|1CD9DF| db $38, $C8, $37, $0C, $2B ; ら,どこへ
|1CD9E4| db $FD, $DD ; kanji 逃
|1CD9E6| db $1D, $1B, $34 ; げても
|1CD9E9| db $FD, $30 ; kanji 必
|1CD9EB| db $26 ; ず
|1CD9EC| db $FD, $4C ; kanji 見
|1CD9EE| db $FD, $52 ; kanji 付
|1CD9F0| db $0B ; け
|1CD9F1| db $F9 ; row 3
|1CD9F2| db $3A ; る
|1CD9F3| db $FD, $22 ; kanji 事
|1CD9F5| db $15, $36, $09, $30, $12, $CD ; ができます。
|1CD9FB| db $FC, $01 ; text speed: 1
|1CD9FD| db $FA ; wait for key
|1CD9FE| db $F7 ; row 1
|1CD9FF| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA07| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDA0D| db $F8 ; row 2
|1CDA0E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA16| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDA1C| db $F9 ; row 3
|1CDA1D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA25| db $FC, $02 ; text speed: 2
|1CDA27| db $F7 ; row 1
|1CDA28| db $10, $00, $C8, $A7, $1A, $24, $5A, $89 ; さあ,7つのクリ
|1CDA30| db $62, $68, $8A, $0E, $34, $4A ; スタルをもっ
|1CDA36| db $F8 ; row 2
|1CDA37| db $1B, $C8, $65, $74, $5F, $24 ; て,ガノンの
|1CDA3D| db $FD, $D5 ; kanji 塔
|1CDA3F| db $2B ; へ
|1CDA40| db $FD, $7D ; kanji 急
|1CDA42| db $16, $30, $11, $49, $02 ; ぎましょう
|1CDA47| db $F9 ; row 3
|1CDA48| db $FD, $83 ; kanji 結
|1CDA4A| db $FD, $E9 ; kanji 界
|1CDA4C| db $28, $C8 ; は,
|1CDA4E| db $FD, $26 ; kanji 私
|1CDA50| db $FD, $13 ; kanji 達
|1CDA52| db $24 ; の
|1CDA53| db $FD, $99 ; kanji 力
|1CDA55| db $36, $05, $3F, $39, $30, $12 ; でやぶります
|1CDA5B| db $FC, $01 ; text speed: 1
|1CDA5D| db $FA ; wait for key
|1CDA5E| db $F7 ; row 1
|1CDA5F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA67| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDA6D| db $F8 ; row 2
|1CDA6E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA76| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDA7C| db $F9 ; row 3
|1CDA7D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDA85| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDA8B| db $FC, $02 ; text speed: 2
|1CDA8D| db $F7 ; row 1
|1CDA8E| db $FF ; ␣
|1CDA8F| db $FE, $6A ; write player name
|1CDA91| db $FF, $CC ; ␣⋯
|1CDA93| db $F8 ; row 2
|1CDA94| db $FD, $30 ; kanji 必
|1CDA96| db $26 ; ず
|1CDA97| db $FD, $0B ; kanji 平
|1CDA99| db $FD, $0C ; kanji 和
|1CDA9B| db $20 ; な
|1CDA9C| db $FD, $2B ; kanji 国
|1CDA9E| db $0E ; を
|1CDA9F| db $F9 ; row 3
|1CDAA0| db $1C, $39 ; とり
|1CDAA2| db $FD, $0F ; kanji 戻
|1CDAA4| db $11, $30, $11, $49, $02, $23, $FF, $CC ; しましょうね␣⋯
|1CDAAC| db $FF, $CC ; ␣⋯
|1CDAAE| db $FE, $79, $2D ; SFX3.2D
|1CDAB1| db $FB ; end of message

;===================================================================================================
; Crystal maiden cheer
;===================================================================================================
; 勇者の行く道がトライフォース
; へと,みちびかれますように。
;===================================================================================================
Message_0137:
|1CDAB2| db $FC, $02 ; text speed: 2
|1CDAB4| db $FE, $6D, $01 ; position: low
|1CDAB7| db $FE, $6B, $02 ; border: 2
|1CDABA| db $FD, $A0 ; kanji 勇
|1CDABC| db $FD, $1E ; kanji 者
|1CDABE| db $24 ; の
|1CDABF| db $FD, $02 ; kanji 行
|1CDAC1| db $0A ; く
|1CDAC2| db $FD, $5D ; kanji 道
|1CDAC4| db $15, $6C, $88, $51, $7A, $9F, $C9, $62 ; がトライフォース
|1CDACC| db $F8 ; row 2
|1CDACD| db $2B, $1C, $C8, $31, $19, $3E, $08, $3B ; へと,みちびかれ
|1CDAD5| db $30, $12, $07, $02, $21, $CD ; ますように。
|1CDADB| db $FB ; end of message

;===================================================================================================
; Crystal maiden ¿comprende?
;===================================================================================================
; ちゃんときこえたかしら?
; ▶ う ん
;   ぜんぜん
;===================================================================================================
Message_0138:
|1CDADC| db $FC, $02 ; text speed: 2
|1CDADE| db $FE, $6D, $01 ; position: low
|1CDAE1| db $FE, $6B, $02 ; border: 2
|1CDAE4| db $19, $47, $0F, $1C, $09, $0C, $03, $18 ; ちゃんときこえた
|1CDAEC| db $08, $11, $38, $C6 ; かしら?
|1CDAF0| db $F8 ; row 2
|1CDAF1| db $FF, $FF, $E4, $FF, $02, $FF, $FF, $0F ; ␣␣▶␣う␣␣ん
|1CDAF9| db $F9 ; row 3
|1CDAFA| db $FF, $FF, $FF, $FF, $27, $0F, $27, $0F ; ␣␣␣␣ぜんぜん
|1CDB02| db $FE, $68 ; choose 2 low
|1CDB04| db $FB ; end of message

;===================================================================================================
; Crystal maidens opening Ganon's Tower
;===================================================================================================
; [LINK]! 私達7人の力で
; ガノンの塔の結界をやぶります
;===================================================================================================
Message_0139:
|1CDB05| db $FE, $6A ; write player name
|1CDB07| db $C7, $FF ; !␣
|1CDB09| db $FD, $26 ; kanji 私
|1CDB0B| db $FD, $13 ; kanji 達
|1CDB0D| db $A7 ; 7
|1CDB0E| db $FD, $38 ; kanji 人
|1CDB10| db $24 ; の
|1CDB11| db $FD, $99 ; kanji 力
|1CDB13| db $36 ; で
|1CDB14| db $F8 ; row 2
|1CDB15| db $65, $74, $5F, $24 ; ガノンの
|1CDB19| db $FD, $D5 ; kanji 塔
|1CDB1B| db $24 ; の
|1CDB1C| db $FD, $83 ; kanji 結
|1CDB1E| db $FD, $E9 ; kanji 界
|1CDB20| db $0E, $05, $3F, $39, $30, $12 ; をやぶります
|1CDB26| db $FB ; end of message

;===================================================================================================
; Zelda in Turtle Rock when every crystal is had
;===================================================================================================
; [LINK],よくここまで来てく
; れました。 やっぱりあなたが
; 伝説の『勇者』だったのね。
; はじめて会った時から,そんな
; 気がしていました。
; ⋯ ⋯ ⋯
; ガノンは,デスマウンテンの塔
; に結界をはり,2つの世界の通
; り道をぬける時をまっています
; ガノンが光の世界へ出てしまっ
; たら,もう捕える事はできない
; かも知れないわ。
; でも,このとじた空間のなかな
; ら,どこへ逃げても必ず見付け
; る事ができます。
; あなたの助けをまつ娘達が,ま
; だ残っているわ。
; 彼女達をすべて救い出したら
; ガノンの塔へ向かうのよ。
; 結界は,7賢者の血を引く私達
; の力で必ずやぶります。
; [LINK] ⋯
; 必ず平和な国を
; とり戻しましょうね ⋯ ⋯
;===================================================================================================
Message_013A:
|1CDB27| db $FC, $02 ; text speed: 2
|1CDB29| db $FE, $6D, $01 ; position: low
|1CDB2C| db $FE, $6B, $02 ; border: 2
|1CDB2F| db $FE, $6A ; write player name
|1CDB31| db $C8, $07, $0A, $0C, $0C, $30, $36 ; ,よくここまで
|1CDB38| db $FD, $D6 ; kanji 来
|1CDB3A| db $1B, $0A ; てく
|1CDB3C| db $F8 ; row 2
|1CDB3D| db $3B, $30, $11, $18, $CD, $FF, $05, $4A ; れました。␣やっ
|1CDB45| db $42, $39, $00, $20, $18, $15 ; ぱりあなたが
|1CDB4B| db $F9 ; row 3
|1CDB4C| db $FD, $2E ; kanji 伝
|1CDB4E| db $FD, $2F ; kanji 説
|1CDB50| db $24, $C4 ; の『
|1CDB52| db $FD, $A0 ; kanji 勇
|1CDB54| db $FD, $1E ; kanji 者
|1CDB56| db $C5, $2E, $4A, $18, $24, $23, $CD ; 』だったのね。
|1CDB5D| db $FC, $01 ; text speed: 1
|1CDB5F| db $FA ; wait for key
|1CDB60| db $F7 ; row 1
|1CDB61| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDB69| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDB6F| db $F8 ; row 2
|1CDB70| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDB78| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDB7E| db $F9 ; row 3
|1CDB7F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDB87| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CDB8C| db $FC, $02 ; text speed: 2
|1CDB8E| db $F7 ; row 1
|1CDB8F| db $28, $25, $33, $1B ; はじめて
|1CDB93| db $FD, $04 ; kanji 会
|1CDB95| db $4A, $18 ; った
|1CDB97| db $FD, $88 ; kanji 時
|1CDB99| db $08, $38, $C8, $14, $0F, $20 ; から,そんな
|1CDB9F| db $F8 ; row 2
|1CDBA0| db $FD, $37 ; kanji 気
|1CDBA2| db $15, $11, $1B, $01, $30, $11, $18, $CD ; がしていました。
|1CDBAA| db $F9 ; row 3
|1CDBAB| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CDBB1| db $FC, $01 ; text speed: 1
|1CDBB3| db $FA ; wait for key
|1CDBB4| db $F7 ; row 1
|1CDBB5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDBBD| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDBC3| db $F8 ; row 2
|1CDBC4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDBCC| db $FF ; ␣
|1CDBCD| db $F9 ; row 3
|1CDBCE| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDBD4| db $FC, $02 ; text speed: 2
|1CDBD6| db $F7 ; row 1
|1CDBD7| db $65, $74, $5F, $28, $C8, $86, $62, $80 ; ガノンは,デスマ
|1CDBDF| db $52, $5F, $6B, $5F, $24 ; ウンテンの
|1CDBE4| db $FD, $D5 ; kanji 塔
|1CDBE6| db $F8 ; row 2
|1CDBE7| db $21 ; に
|1CDBE8| db $FD, $83 ; kanji 結
|1CDBEA| db $FD, $E9 ; kanji 界
|1CDBEC| db $0E, $28, $39, $C8, $A2, $1A, $24 ; をはり,2つの
|1CDBF3| db $FD, $E8 ; kanji 世
|1CDBF5| db $FD, $E9 ; kanji 界
|1CDBF7| db $24 ; の
|1CDBF8| db $FD, $09 ; kanji 通
|1CDBFA| db $F9 ; row 3
|1CDBFB| db $39 ; り
|1CDBFC| db $FD, $5D ; kanji 道
|1CDBFE| db $0E, $22, $0B, $3A ; をぬける
|1CDC02| db $FD, $88 ; kanji 時
|1CDC04| db $0E, $30, $4A, $1B, $01, $30, $12 ; をまっています
|1CDC0B| db $FC, $01 ; text speed: 1
|1CDC0D| db $FA ; wait for key
|1CDC0E| db $F7 ; row 1
|1CDC0F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC17| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDC1D| db $F8 ; row 2
|1CDC1E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC26| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDC2C| db $F9 ; row 3
|1CDC2D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC35| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDC3B| db $FC, $02 ; text speed: 2
|1CDC3D| db $F7 ; row 1
|1CDC3E| db $65, $74, $5F, $15 ; ガノンが
|1CDC42| db $FD, $73 ; kanji 光
|1CDC44| db $24 ; の
|1CDC45| db $FD, $E8 ; kanji 世
|1CDC47| db $FD, $E9 ; kanji 界
|1CDC49| db $2B ; へ
|1CDC4A| db $FD, $23 ; kanji 出
|1CDC4C| db $1B, $11, $30, $4A ; てしまっ
|1CDC50| db $F8 ; row 2
|1CDC51| db $18, $38, $C8, $34, $02 ; たら,もう
|1CDC56| db $FD, $9F ; kanji 捕
|1CDC58| db $03, $3A ; える
|1CDC5A| db $FD, $22 ; kanji 事
|1CDC5C| db $28, $36, $09, $20, $01 ; はできない
|1CDC61| db $F9 ; row 3
|1CDC62| db $08, $34 ; かも
|1CDC64| db $FD, $93 ; kanji 知
|1CDC66| db $3B, $20, $01, $0D, $CD ; れないわ。
|1CDC6B| db $FC, $01 ; text speed: 1
|1CDC6D| db $FA ; wait for key
|1CDC6E| db $F7 ; row 1
|1CDC6F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC77| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDC7D| db $F8 ; row 2
|1CDC7E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC86| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDC8C| db $F9 ; row 3
|1CDC8D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDC95| db $FC, $02 ; text speed: 2
|1CDC97| db $F7 ; row 1
|1CDC98| db $36, $34, $C8, $0C, $24, $1C, $25, $18 ; でも,このとじた
|1CDCA0| db $FD, $AA ; kanji 空
|1CDCA2| db $FD, $39 ; kanji 間
|1CDCA4| db $24, $20, $08, $20 ; のなかな
|1CDCA8| db $F8 ; row 2
|1CDCA9| db $38, $C8, $37, $0C, $2B ; ら,どこへ
|1CDCAE| db $FD, $DD ; kanji 逃
|1CDCB0| db $1D, $1B, $34 ; げても
|1CDCB3| db $FD, $30 ; kanji 必
|1CDCB5| db $26 ; ず
|1CDCB6| db $FD, $4C ; kanji 見
|1CDCB8| db $FD, $52 ; kanji 付
|1CDCBA| db $0B ; け
|1CDCBB| db $F9 ; row 3
|1CDCBC| db $3A ; る
|1CDCBD| db $FD, $22 ; kanji 事
|1CDCBF| db $15, $36, $09, $30, $12, $CD ; ができます。
|1CDCC5| db $FC, $01 ; text speed: 1
|1CDCC7| db $FA ; wait for key
|1CDCC8| db $F7 ; row 1
|1CDCC9| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDCD1| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDCD7| db $F8 ; row 2
|1CDCD8| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDCE0| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDCE6| db $F9 ; row 3
|1CDCE7| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDCEF| db $FC, $02 ; text speed: 2
|1CDCF1| db $F7 ; row 1
|1CDCF2| db $00, $20, $18, $24 ; あなたの
|1CDCF6| db $FD, $CA ; kanji 助
|1CDCF8| db $0B, $0E, $30, $1A ; けをまつ
|1CDCFC| db $FD, $00 ; kanji 娘
|1CDCFE| db $FD, $13 ; kanji 達
|1CDD00| db $15, $C8, $30 ; が,ま
|1CDD03| db $F8 ; row 2
|1CDD04| db $2E ; だ
|1CDD05| db $FD, $C6 ; kanji 残
|1CDD07| db $4A, $1B, $01, $3A, $0D, $CD ; っているわ。
|1CDD0D| db $F9 ; row 3
|1CDD0E| db $FD, $14 ; kanji 彼
|1CDD10| db $FD, $15 ; kanji 女
|1CDD12| db $FD, $13 ; kanji 達
|1CDD14| db $0E, $12, $40, $1B ; をすべて
|1CDD18| db $FD, $28 ; kanji 救
|1CDD1A| db $01 ; い
|1CDD1B| db $FD, $23 ; kanji 出
|1CDD1D| db $11, $18, $38 ; したら
|1CDD20| db $FC, $01 ; text speed: 1
|1CDD22| db $FA ; wait for key
|1CDD23| db $F7 ; row 1
|1CDD24| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDD2C| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDD32| db $F8 ; row 2
|1CDD33| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDD3B| db $F9 ; row 3
|1CDD3C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDD44| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CDD49| db $FC, $02 ; text speed: 2
|1CDD4B| db $F7 ; row 1
|1CDD4C| db $65, $74, $5F, $24 ; ガノンの
|1CDD50| db $FD, $D5 ; kanji 塔
|1CDD52| db $2B ; へ
|1CDD53| db $FD, $86 ; kanji 向
|1CDD55| db $08, $02, $24, $07, $CD ; かうのよ。
|1CDD5A| db $F8 ; row 2
|1CDD5B| db $FD, $83 ; kanji 結
|1CDD5D| db $FD, $E9 ; kanji 界
|1CDD5F| db $28, $C8, $A7 ; は,7
|1CDD62| db $FD, $C4 ; kanji 賢
|1CDD64| db $FD, $1E ; kanji 者
|1CDD66| db $24 ; の
|1CDD67| db $FD, $B9 ; kanji 血
|1CDD69| db $0E ; を
|1CDD6A| db $FD, $48 ; kanji 引
|1CDD6C| db $0A ; く
|1CDD6D| db $FD, $26 ; kanji 私
|1CDD6F| db $FD, $13 ; kanji 達
|1CDD71| db $F9 ; row 3
|1CDD72| db $24 ; の
|1CDD73| db $FD, $99 ; kanji 力
|1CDD75| db $36 ; で
|1CDD76| db $FD, $30 ; kanji 必
|1CDD78| db $26, $05, $3F, $39, $30, $12, $CD ; ずやぶります。
|1CDD7F| db $FC, $01 ; text speed: 1
|1CDD81| db $FA ; wait for key
|1CDD82| db $F7 ; row 1
|1CDD83| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDD8B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDD91| db $F8 ; row 2
|1CDD92| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDD9A| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CDDA0| db $F9 ; row 3
|1CDDA1| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CDDA9| db $FF, $FF, $FF ; ␣␣␣
|1CDDAC| db $FC, $02 ; text speed: 2
|1CDDAE| db $F7 ; row 1
|1CDDAF| db $FF ; ␣
|1CDDB0| db $FE, $6A ; write player name
|1CDDB2| db $FF, $CC ; ␣⋯
|1CDDB4| db $F8 ; row 2
|1CDDB5| db $FD, $30 ; kanji 必
|1CDDB7| db $26 ; ず
|1CDDB8| db $FD, $0B ; kanji 平
|1CDDBA| db $FD, $0C ; kanji 和
|1CDDBC| db $20 ; な
|1CDDBD| db $FD, $2B ; kanji 国
|1CDDBF| db $0E ; を
|1CDDC0| db $F9 ; row 3
|1CDDC1| db $1C, $39 ; とり
|1CDDC3| db $FD, $0F ; kanji 戻
|1CDDC5| db $11, $30, $11, $49, $02, $23, $FF, $CC ; しましょうね␣⋯
|1CDDCD| db $FF, $CC ; ␣⋯
|1CDDCF| db $FB ; end of message

;===================================================================================================
; Agahnim greeting
;===================================================================================================
; いやあ,[LINK]殿。
; おまちしておりましたぞ!
; クックック⋯。
; あなたの目の前で ゼルダを
; 消してやろうと思いましてね。
; 見よ!ゼルダのさいごじゃあ!
;===================================================================================================
Message_013B:
|1CDDD0| db $01, $05, $00, $C8 ; いやあ,
|1CDDD4| db $FE, $6A ; write player name
|1CDDD6| db $FD, $90 ; kanji 殿
|1CDDD8| db $CD ; 。
|1CDDD9| db $F8 ; row 2
|1CDDDA| db $04, $30, $19, $11, $1B, $04, $39, $30 ; おまちしておりま
|1CDDE2| db $11, $18, $2D, $C7 ; したぞ!
|1CDDE6| db $F9 ; row 3
|1CDDE7| db $5A, $9A, $5A, $9A, $5A, $CC, $CD ; クックック⋯。
|1CDDEE| db $FA ; wait for key
|1CDDEF| db $F6 ; scroll
|1CDDF0| db $00, $20, $18, $24 ; あなたの
|1CDDF4| db $FD, $75 ; kanji 目
|1CDDF6| db $24 ; の
|1CDDF7| db $FD, $78 ; kanji 前
|1CDDF9| db $36, $FF, $77, $8A, $7E, $0E ; で␣ゼルダを
|1CDDFF| db $F6 ; scroll
|1CDE00| db $FD, $9D ; kanji 消
|1CDE02| db $11, $1B, $05, $3C, $02, $1C ; してやろうと
|1CDE08| db $FD, $36 ; kanji 思
|1CDE0A| db $01, $30, $11, $1B, $23, $CD ; いましてね。
|1CDE10| db $F6 ; scroll
|1CDE11| db $FD, $4C ; kanji 見
|1CDE13| db $07, $C7, $77, $8A, $7E, $24, $10, $01 ; よ!ゼルダのさい
|1CDE1B| db $1E, $25, $47, $00, $C7 ; ごじゃあ!
|1CDE20| db $FB ; end of message

;===================================================================================================
; Agahnim hahahaha
;===================================================================================================
; ホォッホッホッ⋯。 これで,
; 7賢者の封印も めでたく
; とかれたワケですなあ。
; 魔の力が,この国をおおいつく
; すのも時間のもんだいですぞ⋯
; しょせん伝説の『勇者』も
; 『黄金の力』を持つ,われらが
; 魔族には,かないませんか。
; ホォッホッホッ さらばじゃ!
;===================================================================================================
Message_013C:
|1CDE21| db $7C, $9F, $9A, $7C, $9A, $7C, $9A, $CC ; ホォッホッホッ⋯
|1CDE29| db $CD, $FF, $0C, $3B, $36, $C8 ; 。␣これで,
|1CDE2F| db $F8 ; row 2
|1CDE30| db $A7 ; 7
|1CDE31| db $FD, $C4 ; kanji 賢
|1CDE33| db $FD, $1E ; kanji 者
|1CDE35| db $24 ; の
|1CDE36| db $FD, $9E ; kanji 封
|1CDE38| db $FD, $35 ; kanji 印
|1CDE3A| db $34, $FF, $33, $36, $18, $0A ; も␣めでたく
|1CDE40| db $F9 ; row 3
|1CDE41| db $1C, $08, $3B, $18, $5D, $5B, $36, $12 ; とかれたワケです
|1CDE49| db $20, $00, $CD ; なあ。
|1CDE4C| db $FA ; wait for key
|1CDE4D| db $F6 ; scroll
|1CDE4E| db $FD, $2D ; kanji 魔
|1CDE50| db $24 ; の
|1CDE51| db $FD, $99 ; kanji 力
|1CDE53| db $15, $C8, $0C, $24 ; が,この
|1CDE57| db $FD, $2B ; kanji 国
|1CDE59| db $0E, $04, $04, $01, $1A, $0A ; をおおいつく
|1CDE5F| db $F6 ; scroll
|1CDE60| db $12, $24, $34 ; すのも
|1CDE63| db $FD, $88 ; kanji 時
|1CDE65| db $FD, $39 ; kanji 間
|1CDE67| db $24, $34, $0F, $2E, $01, $36, $12, $2D ; のもんだいですぞ
|1CDE6F| db $CC ; ⋯
|1CDE70| db $F6 ; scroll
|1CDE71| db $11, $49, $13, $0F ; しょせん
|1CDE75| db $FD, $2E ; kanji 伝
|1CDE77| db $FD, $2F ; kanji 説
|1CDE79| db $24, $C4 ; の『
|1CDE7B| db $FD, $A0 ; kanji 勇
|1CDE7D| db $FD, $1E ; kanji 者
|1CDE7F| db $C5, $34 ; 』も
|1CDE81| db $FA ; wait for key
|1CDE82| db $F6 ; scroll
|1CDE83| db $C4 ; 『
|1CDE84| db $FD, $98 ; kanji 黄
|1CDE86| db $FD, $43 ; kanji 金
|1CDE88| db $24 ; の
|1CDE89| db $FD, $99 ; kanji 力
|1CDE8B| db $C5, $0E ; 』を
|1CDE8D| db $FD, $DB ; kanji 持
|1CDE8F| db $1A, $C8, $0D, $3B, $38, $15 ; つ,われらが
|1CDE95| db $F6 ; scroll
|1CDE96| db $FD, $2D ; kanji 魔
|1CDE98| db $FD, $F2 ; kanji 族
|1CDE9A| db $21, $28, $C8, $08, $20, $01, $30, $13 ; には,かないませ
|1CDEA2| db $0F, $08, $CD ; んか。
|1CDEA5| db $F6 ; scroll
|1CDEA6| db $7C, $9F, $9A, $7C, $9A, $7C, $9A, $FF ; ホォッホッホッ␣
|1CDEAE| db $10, $38, $3D, $25, $47, $C7 ; さらばじゃ!
|1CDEB4| db $FB ; end of message

;===================================================================================================
; Agahnim fight Light World
;===================================================================================================
; ほほう,どうしてもやられたい
; と言うのですな⋯。 では,
; そのノゾミ かなえてやろう!
;===================================================================================================
Message_013D:
|1CDEB5| db $2C, $2C, $02, $C8, $37, $02, $11, $1B ; ほほう,どうして
|1CDEBD| db $34, $05, $38, $3B, $18, $01 ; もやられたい
|1CDEC3| db $F8 ; row 2
|1CDEC4| db $1C ; と
|1CDEC5| db $FD, $16 ; kanji 言
|1CDEC7| db $02, $24, $36, $12, $20, $CC, $CD, $FF ; うのですな⋯。␣
|1CDECF| db $36, $28, $C8 ; では,
|1CDED2| db $F9 ; row 3
|1CDED3| db $14, $24, $74, $7D, $81, $FF, $08, $20 ; そのノゾミ␣かな
|1CDEDB| db $03, $1B, $05, $3C, $02, $C7 ; えてやろう!
|1CDEE1| db $FB ; end of message

;===================================================================================================
; Agahnim defeated in Light World
;===================================================================================================
; グウゥ,さすがは,『勇者』
; しかし,このままにはせぬぞ!
; 闇世界へ引きずりこんでやる!
;===================================================================================================
Message_013E:
|1CDEE2| db $67, $52, $9D, $C8, $10, $12, $15, $28 ; グウゥ,さすがは
|1CDEEA| db $C8, $C4 ; ,『
|1CDEEC| db $FD, $A0 ; kanji 勇
|1CDEEE| db $FD, $1E ; kanji 者
|1CDEF0| db $C5 ; 』
|1CDEF1| db $F8 ; row 2
|1CDEF2| db $11, $08, $11, $C8, $0C, $24, $30, $30 ; しかし,このまま
|1CDEFA| db $21, $28, $13, $22, $2D, $C7 ; にはせぬぞ!
|1CDF00| db $F9 ; row 3
|1CDF01| db $FD, $57 ; kanji 闇
|1CDF03| db $FD, $E8 ; kanji 世
|1CDF05| db $FD, $E9 ; kanji 界
|1CDF07| db $2B ; へ
|1CDF08| db $FD, $48 ; kanji 引
|1CDF0A| db $09, $26, $39, $0C, $0F, $36, $05, $3A ; きずりこんでやる
|1CDF12| db $C7 ; !
|1CDF13| db $FB ; end of message

;===================================================================================================
; Agahnim fight Dark World
;===================================================================================================
; ホッホッホ,よくぞここまで
; まいられました,[LINK]殿。
; もう1度お会いできてわたくし
; とてもうれしゅうございます。
; しかし,3度目はないと,思い
; しりなさいっ!くたばれ〜っ!
;===================================================================================================
Message_013F:
|1CDF14| db $7C, $9A, $7C, $9A, $7C, $C8, $07, $0A ; ホッホッホ,よく
|1CDF1C| db $2D, $0C, $0C, $30, $36 ; ぞここまで
|1CDF21| db $F8 ; row 2
|1CDF22| db $30, $01, $38, $3B, $30, $11, $18, $C8 ; まいられました,
|1CDF2A| db $FE, $6A ; write player name
|1CDF2C| db $FD, $90 ; kanji 殿
|1CDF2E| db $CD ; 。
|1CDF2F| db $F9 ; row 3
|1CDF30| db $34, $02, $A1 ; もう1
|1CDF33| db $FD, $2A ; kanji 度
|1CDF35| db $04 ; お
|1CDF36| db $FD, $04 ; kanji 会
|1CDF38| db $01, $36, $09, $1B, $0D, $18, $0A, $11 ; いできてわたくし
|1CDF40| db $FA ; wait for key
|1CDF41| db $F6 ; scroll
|1CDF42| db $1C, $1B, $34, $02, $3B, $11, $48, $02 ; とてもうれしゅう
|1CDF4A| db $1E, $1F, $01, $30, $12, $CD ; ございます。
|1CDF50| db $F6 ; scroll
|1CDF51| db $11, $08, $11, $C8, $A3 ; しかし,3
|1CDF56| db $FD, $2A ; kanji 度
|1CDF58| db $FD, $75 ; kanji 目
|1CDF5A| db $28, $20, $01, $1C, $C8 ; はないと,
|1CDF5F| db $FD, $36 ; kanji 思
|1CDF61| db $01 ; い
|1CDF62| db $F6 ; scroll
|1CDF63| db $11, $39, $20, $10, $01, $4A, $C7, $0A ; しりなさいっ!く
|1CDF6B| db $18, $3D, $3B, $CE, $4A, $C7 ; たばれ〜っ!
|1CDF71| db $FB ; end of message

;===================================================================================================
; King Zora: You want the flippers?
;===================================================================================================
; やあ,このワシにヨウかな?
; ▶ 水かきがほしい
;   ちょっとよっただけ
;===================================================================================================
Message_0140:
|1CDF72| db $05, $00, $C8, $0C, $24, $5D, $61, $21 ; やあ,このワシに
|1CDF7A| db $57, $52, $08, $20, $C6 ; ヨウかな?
|1CDF7F| db $F8 ; row 2
|1CDF80| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CDF84| db $FD, $66 ; kanji 水
|1CDF86| db $08, $09, $15, $2C, $11, $01 ; かきがほしい
|1CDF8C| db $F9 ; row 3
|1CDF8D| db $FF, $FF, $FF, $FF, $19, $49, $4A, $1C ; ␣␣␣␣ちょっと
|1CDF95| db $07, $4A, $18, $2E, $0B ; よっただけ
|1CDF9A| db $FE, $68 ; choose 2 low
|1CDF9C| db $FB ; end of message

;===================================================================================================
; King Zora: Give me 500 rupees.
;===================================================================================================
; そうか,でもただではいやじゃ
; 500ルピーくれたら,うって
; やっても良いぞ!
; どうする?
; ▶ 500ルピーはらう
;   やっぱりやめる
;===================================================================================================
Message_0141:
|1CDF9D| db $14, $02, $08, $C8, $36, $34, $18, $2E ; そうか,でもただ
|1CDFA5| db $36, $28, $01, $05, $25, $47 ; ではいやじゃ
|1CDFAB| db $F8 ; row 2
|1CDFAC| db $A5, $A0, $A0, $8A, $93, $C9, $0A, $3B ; 500ルピーくれ
|1CDFB4| db $18, $38, $C8, $02, $4A, $1B ; たら,うって
|1CDFBA| db $F9 ; row 3
|1CDFBB| db $05, $4A, $1B, $34 ; やっても
|1CDFBF| db $FD, $32 ; kanji 良
|1CDFC1| db $01, $2D, $C7 ; いぞ!
|1CDFC4| db $FA ; wait for key
|1CDFC5| db $F6 ; scroll
|1CDFC6| db $37, $02, $12, $3A, $C6 ; どうする?
|1CDFCB| db $F6 ; scroll
|1CDFCC| db $FF, $FF, $E4, $FF, $A5, $A0, $A0, $8A ; ␣␣▶␣500ル
|1CDFD4| db $93, $C9, $28, $38, $02 ; ピーはらう
|1CDFD9| db $F6 ; scroll
|1CDFDA| db $FF, $FF, $FF, $FF, $05, $4A, $42, $39 ; ␣␣␣␣やっぱり
|1CDFE2| db $05, $33, $3A ; やめる
|1CDFE5| db $FE, $68 ; choose 2 low
|1CDFE7| db $FB ; end of message

;===================================================================================================
; King Zora: Here's the flippers!
;===================================================================================================
; ワッハッハ,では水かきをあげ
; よう。 それにもうひとつサー
; ビスしてやるぞ。
; 川や湖を結ぶワシらだけの
; 秘密の水路を使わせてやろう。
; うずまきを見たら入ってみろ。
; それじゃあ,たいせつにしてく
; れよ。 ワッハッハッ
; さらばじゃあ〜⋯。
;===================================================================================================
Message_0142:
|1CDFE8| db $5D, $9A, $78, $9A, $78, $C8, $36, $28 ; ワッハッハ,では
|1CDFF0| db $FD, $66 ; kanji 水
|1CDFF2| db $08, $09, $0E, $00, $1D ; かきをあげ
|1CDFF7| db $F8 ; row 2
|1CDFF8| db $07, $02, $CD, $FF, $14, $3B, $21, $34 ; よう。␣それにも
|1CE000| db $02, $29, $1C, $1A, $60, $C9 ; うひとつサー
|1CE006| db $F9 ; row 3
|1CE007| db $8E, $62, $11, $1B, $05, $3A, $2D, $CD ; ビスしてやるぞ。
|1CE00F| db $FA ; wait for key
|1CE010| db $F6 ; scroll
|1CE011| db $FD, $B8 ; kanji 川
|1CE013| db $05 ; や
|1CE014| db $FD, $12 ; kanji 湖
|1CE016| db $0E ; を
|1CE017| db $FD, $83 ; kanji 結
|1CE019| db $3F, $5D, $61, $38, $2E, $0B, $24 ; ぶワシらだけの
|1CE020| db $F6 ; scroll
|1CE021| db $FD, $C1 ; kanji 秘
|1CE023| db $FD, $C2 ; kanji 密
|1CE025| db $24 ; の
|1CE026| db $FD, $66 ; kanji 水
|1CE028| db $FD, $B6 ; kanji 路
|1CE02A| db $0E ; を
|1CE02B| db $FD, $89 ; kanji 使
|1CE02D| db $0D, $13, $1B, $05, $3C, $02, $CD ; わせてやろう。
|1CE034| db $F6 ; scroll
|1CE035| db $02, $26, $30, $09, $0E ; うずまきを
|1CE03A| db $FD, $4C ; kanji 見
|1CE03C| db $18, $38 ; たら
|1CE03E| db $FD, $49 ; kanji 入
|1CE040| db $4A, $1B, $31, $3C, $CD ; ってみろ。
|1CE045| db $FA ; wait for key
|1CE046| db $F6 ; scroll
|1CE047| db $14, $3B, $25, $47, $00, $C8, $18, $01 ; それじゃあ,たい
|1CE04F| db $13, $1A, $21, $11, $1B, $0A ; せつにしてく
|1CE055| db $F6 ; scroll
|1CE056| db $3B, $07, $CD, $FF, $5D, $9A, $78, $9A ; れよ。␣ワッハッ
|1CE05E| db $78, $9A ; ハッ
|1CE060| db $F6 ; scroll
|1CE061| db $FF, $FF, $10, $38, $3D, $25, $47, $00 ; ␣␣さらばじゃあ
|1CE069| db $CE, $CC, $CD ; 〜⋯。
|1CE06C| db $FB ; end of message

;===================================================================================================
; King Zora: You are too poor for flippers.
;===================================================================================================
; じゃあ,ルピーを集めて,また
; ここへおいで⋯。
; ワッハッハ,また,会おうね!
;===================================================================================================
Message_0143:
|1CE06D| db $25, $47, $00, $C8, $8A, $93, $C9, $0E ; じゃあ,ルピーを
|1CE075| db $FD, $E0 ; kanji 集
|1CE077| db $33, $1B, $C8, $30, $18 ; めて,また
|1CE07C| db $F8 ; row 2
|1CE07D| db $0C, $0C, $2B, $04, $01, $36, $CC, $CD ; ここへおいで⋯。
|1CE085| db $F9 ; row 3
|1CE086| db $5D, $9A, $78, $9A, $78, $C8, $30, $18 ; ワッハッハ,また
|1CE08E| db $C8 ; ,
|1CE08F| db $FD, $04 ; kanji 会
|1CE091| db $04, $02, $23, $C7 ; おうね!
|1CE095| db $FB ; end of message

;===================================================================================================
; King Zora: Thank you. Come again.
;===================================================================================================
; そうか,ワシのかおが,みたく
; なったら,いつでもおいで⋯。
; ワッハッハ,さらばじゃあ⋯!
;===================================================================================================
Message_0144:
|1CE096| db $14, $02, $08, $C8, $5D, $61, $24, $08 ; そうか,ワシのか
|1CE09E| db $04, $15, $C8, $31, $18, $0A ; おが,みたく
|1CE0A4| db $F8 ; row 2
|1CE0A5| db $20, $4A, $18, $38, $C8, $01, $1A, $36 ; なったら,いつで
|1CE0AD| db $34, $04, $01, $36, $CC, $CD ; もおいで⋯。
|1CE0B3| db $F9 ; row 3
|1CE0B4| db $5D, $9A, $78, $9A, $78, $C8, $10, $38 ; ワッハッハ,さら
|1CE0BC| db $3D, $25, $47, $00, $CC, $C7 ; ばじゃあ⋯!
|1CE0C2| db $FB ; end of message

;===================================================================================================
; Kakariko boy hint
;===================================================================================================
; やあ,[LINK]おにいちゃん。
; 長老のおじいちゃんの事かい?
; 悪いやつらには,ないしょだよ
; おじいちゃんは,お城の東に
; ある,神殿にいるのさ。
; 地図に印してあげるよ,ホラ。
;===================================================================================================
Message_0145:
|1CE0C3| db $05, $00, $C8 ; やあ,
|1CE0C6| db $FE, $6A ; write player name
|1CE0C8| db $04, $21, $01, $19, $47, $0F, $CD ; おにいちゃん。
|1CE0CF| db $F8 ; row 2
|1CE0D0| db $FD, $8D ; kanji 長
|1CE0D2| db $FD, $E5 ; kanji 老
|1CE0D4| db $24, $04, $25, $01, $19, $47, $0F, $24 ; のおじいちゃんの
|1CE0DC| db $FD, $22 ; kanji 事
|1CE0DE| db $08, $01, $C6 ; かい?
|1CE0E1| db $F9 ; row 3
|1CE0E2| db $FD, $85 ; kanji 悪
|1CE0E4| db $01, $05, $1A, $38, $21, $28, $C8, $20 ; いやつらには,な
|1CE0EC| db $01, $11, $49, $2E, $07 ; いしょだよ
|1CE0F1| db $FA ; wait for key
|1CE0F2| db $F6 ; scroll
|1CE0F3| db $04, $25, $01, $19, $47, $0F, $28, $C8 ; おじいちゃんは,
|1CE0FB| db $04 ; お
|1CE0FC| db $FD, $01 ; kanji 城
|1CE0FE| db $24 ; の
|1CE0FF| db $FD, $D9 ; kanji 東
|1CE101| db $21 ; に
|1CE102| db $F6 ; scroll
|1CE103| db $00, $3A, $C8 ; ある,
|1CE106| db $FD, $05 ; kanji 神
|1CE108| db $FD, $90 ; kanji 殿
|1CE10A| db $21, $01, $3A, $24, $10, $CD ; にいるのさ。
|1CE110| db $F6 ; scroll
|1CE111| db $FD, $33 ; kanji 地
|1CE113| db $FD, $34 ; kanji 図
|1CE115| db $21 ; に
|1CE116| db $FD, $35 ; kanji 印
|1CE118| db $11, $1B, $00, $1D, $3A, $07, $C8, $7C ; してあげるよ,ホ
|1CE120| db $88, $CD ; ラ。
|1CE122| db $FE, $79, $2D ; SFX3.2D
|1CE125| db $FB ; end of message

;===================================================================================================
; Kakariko boy chatter
;===================================================================================================
; 長老のおじいちゃんに会えた?
; 悪いやつらがいなくなれば,
; おじいちゃんも村へ帰れるのに
;===================================================================================================
Message_0146:
|1CE126| db $FD, $8D ; kanji 長
|1CE128| db $FD, $E5 ; kanji 老
|1CE12A| db $24, $04, $25, $01, $19, $47, $0F, $21 ; のおじいちゃんに
|1CE132| db $FD, $04 ; kanji 会
|1CE134| db $03, $18, $C6 ; えた?
|1CE137| db $F8 ; row 2
|1CE138| db $FD, $85 ; kanji 悪
|1CE13A| db $01, $05, $1A, $38, $15, $01, $20, $0A ; いやつらがいなく
|1CE142| db $20, $3B, $3D, $C8 ; なれば,
|1CE146| db $F9 ; row 3
|1CE147| db $04, $25, $01, $19, $47, $0F, $34 ; おじいちゃんも
|1CE14E| db $FD, $8C ; kanji 村
|1CE150| db $2B ; へ
|1CE151| db $FD, $D7 ; kanji 帰
|1CE153| db $3B, $3A, $24, $21 ; れるのに
|1CE157| db $FB ; end of message

;===================================================================================================
; Dark World hint NPC broccoli's story
;===================================================================================================
; おや,新ガオさんだねェ。
; お前さんも,『黄金の力』を
; 求めてこの世界へ来たのかね?
; でもな,『黄金の力』は,さい
; しょにそれに,ふれた者だけが
; 使える力だったんだ。
; その男が,この世界をつくる事
; を願った⋯,この世界はその男
; の心をうつした世界なんだ。
; オレも,よくに目がくらんで,
; ここへ来たんだが,そういう者
; は,みなモンスターになった。
; この世界をもとの聖地に戻す
; には,その男を倒し,『黄金の
; 力』を持つにふさわしい者が,
; それを手にするしか方法は,
; ないだろう⋯。それまでおれは
; この姿でまっているつもりだ。
; しかし,先住の民もいたずらな
; 物をのこしたもんだ。『黄金の
; 力』⋯『トライフォース』か⋯
;===================================================================================================
Message_0147:
|1CE158| db $04, $05, $C8 ; おや,
|1CE15B| db $FD, $E7 ; kanji 新
|1CE15D| db $65, $54, $10, $0F, $2E, $23, $9E, $CD ; ガオさんだねェ。
|1CE165| db $F8 ; row 2
|1CE166| db $04 ; お
|1CE167| db $FD, $78 ; kanji 前
|1CE169| db $10, $0F, $34, $C8, $C4 ; さんも,『
|1CE16E| db $FD, $98 ; kanji 黄
|1CE170| db $FD, $43 ; kanji 金
|1CE172| db $24 ; の
|1CE173| db $FD, $99 ; kanji 力
|1CE175| db $C5, $0E ; 』を
|1CE177| db $F9 ; row 3
|1CE178| db $FD, $9B ; kanji 求
|1CE17A| db $33, $1B, $0C, $24 ; めてこの
|1CE17E| db $FD, $E8 ; kanji 世
|1CE180| db $FD, $E9 ; kanji 界
|1CE182| db $2B ; へ
|1CE183| db $FD, $D6 ; kanji 来
|1CE185| db $18, $24, $08, $23, $C6 ; たのかね?
|1CE18A| db $FA ; wait for key
|1CE18B| db $F6 ; scroll
|1CE18C| db $36, $34, $20, $C8, $C4 ; でもな,『
|1CE191| db $FD, $98 ; kanji 黄
|1CE193| db $FD, $43 ; kanji 金
|1CE195| db $24 ; の
|1CE196| db $FD, $99 ; kanji 力
|1CE198| db $C5, $28, $C8, $10, $01 ; 』は,さい
|1CE19D| db $F6 ; scroll
|1CE19E| db $11, $49, $21, $14, $3B, $21, $C8, $2A ; しょにそれに,ふ
|1CE1A6| db $3B, $18 ; れた
|1CE1A8| db $FD, $1E ; kanji 者
|1CE1AA| db $2E, $0B, $15 ; だけが
|1CE1AD| db $F6 ; scroll
|1CE1AE| db $FD, $89 ; kanji 使
|1CE1B0| db $03, $3A ; える
|1CE1B2| db $FD, $99 ; kanji 力
|1CE1B4| db $2E, $4A, $18, $0F, $2E, $CD ; だったんだ。
|1CE1BA| db $FA ; wait for key
|1CE1BB| db $F6 ; scroll
|1CE1BC| db $14, $24 ; その
|1CE1BE| db $FD, $5E ; kanji 男
|1CE1C0| db $15, $C8, $0C, $24 ; が,この
|1CE1C4| db $FD, $E8 ; kanji 世
|1CE1C6| db $FD, $E9 ; kanji 界
|1CE1C8| db $0E, $1A, $0A, $3A ; をつくる
|1CE1CC| db $FD, $22 ; kanji 事
|1CE1CE| db $F6 ; scroll
|1CE1CF| db $0E ; を
|1CE1D0| db $FD, $0A ; kanji 願
|1CE1D2| db $4A, $18, $CC, $C8, $0C, $24 ; った⋯,この
|1CE1D8| db $FD, $E8 ; kanji 世
|1CE1DA| db $FD, $E9 ; kanji 界
|1CE1DC| db $28, $14, $24 ; はその
|1CE1DF| db $FD, $5E ; kanji 男
|1CE1E1| db $F6 ; scroll
|1CE1E2| db $24 ; の
|1CE1E3| db $FD, $E6 ; kanji 心
|1CE1E5| db $0E, $02, $1A, $11, $18 ; をうつした
|1CE1EA| db $FD, $E8 ; kanji 世
|1CE1EC| db $FD, $E9 ; kanji 界
|1CE1EE| db $20, $0F, $2E, $CD ; なんだ。
|1CE1F2| db $FA ; wait for key
|1CE1F3| db $F6 ; scroll
|1CE1F4| db $54, $8B, $34, $C8, $07, $0A, $21 ; オレも,よくに
|1CE1FB| db $FD, $75 ; kanji 目
|1CE1FD| db $15, $0A, $38, $0F, $36, $C8 ; がくらんで,
|1CE203| db $F6 ; scroll
|1CE204| db $0C, $0C, $2B ; ここへ
|1CE207| db $FD, $D6 ; kanji 来
|1CE209| db $18, $0F, $2E, $15, $C8, $14, $02, $01 ; たんだが,そうい
|1CE211| db $02 ; う
|1CE212| db $FD, $1E ; kanji 者
|1CE214| db $F6 ; scroll
|1CE215| db $28, $C8, $31, $20, $84, $5F, $62, $68 ; は,みなモンスタ
|1CE21D| db $C9, $21, $20, $4A, $18, $CD ; ーになった。
|1CE223| db $FA ; wait for key
|1CE224| db $F6 ; scroll
|1CE225| db $0C, $24 ; この
|1CE227| db $FD, $E8 ; kanji 世
|1CE229| db $FD, $E9 ; kanji 界
|1CE22B| db $0E, $34, $1C, $24 ; をもとの
|1CE22F| db $FD, $F6 ; kanji 聖
|1CE231| db $FD, $33 ; kanji 地
|1CE233| db $21 ; に
|1CE234| db $FD, $0F ; kanji 戻
|1CE236| db $12 ; す
|1CE237| db $F6 ; scroll
|1CE238| db $21, $28, $C8, $14, $24 ; には,その
|1CE23D| db $FD, $5E ; kanji 男
|1CE23F| db $0E ; を
|1CE240| db $FD, $29 ; kanji 倒
|1CE242| db $11, $C8, $C4 ; し,『
|1CE245| db $FD, $98 ; kanji 黄
|1CE247| db $FD, $43 ; kanji 金
|1CE249| db $24 ; の
|1CE24A| db $F6 ; scroll
|1CE24B| db $FD, $99 ; kanji 力
|1CE24D| db $C5, $0E ; 』を
|1CE24F| db $FD, $DB ; kanji 持
|1CE251| db $1A, $21, $2A, $10, $0D, $11, $01 ; つにふさわしい
|1CE258| db $FD, $1E ; kanji 者
|1CE25A| db $15, $C8 ; が,
|1CE25C| db $FA ; wait for key
|1CE25D| db $F6 ; scroll
|1CE25E| db $14, $3B, $0E ; それを
|1CE261| db $FD, $3E ; kanji 手
|1CE263| db $21, $12, $3A, $11, $08 ; にするしか
|1CE268| db $FD, $20 ; kanji 方
|1CE26A| db $FD, $3C ; kanji 法
|1CE26C| db $28, $C8 ; は,
|1CE26E| db $F6 ; scroll
|1CE26F| db $20, $01, $2E, $3C, $02, $CC, $CD, $14 ; ないだろう⋯。そ
|1CE277| db $3B, $30, $36, $04, $3B, $28 ; れまでおれは
|1CE27D| db $F6 ; scroll
|1CE27E| db $0C, $24 ; この
|1CE280| db $FD, $A2 ; kanji 姿
|1CE282| db $36, $30, $4A, $1B, $01, $3A, $1A, $34 ; でまっているつも
|1CE28A| db $39, $2E, $CD ; りだ。
|1CE28D| db $FA ; wait for key
|1CE28E| db $F6 ; scroll
|1CE28F| db $11, $08, $11, $C8 ; しかし,
|1CE293| db $FD, $9C ; kanji 先
|1CE295| db $FD, $3F ; kanji 住
|1CE297| db $24 ; の
|1CE298| db $FD, $F8 ; kanji 民
|1CE29A| db $34, $01, $18, $26, $38, $20 ; もいたずらな
|1CE2A0| db $F6 ; scroll
|1CE2A1| db $FD, $51 ; kanji 物
|1CE2A3| db $0E, $24, $0C, $11, $18, $34, $0F, $2E ; をのこしたもんだ
|1CE2AB| db $CD, $C4 ; 。『
|1CE2AD| db $FD, $98 ; kanji 黄
|1CE2AF| db $FD, $43 ; kanji 金
|1CE2B1| db $24 ; の
|1CE2B2| db $F6 ; scroll
|1CE2B3| db $FD, $99 ; kanji 力
|1CE2B5| db $C5, $CC, $C4, $6C, $88, $51, $7A, $9F ; 』⋯『トライフォ
|1CE2BD| db $C9, $62, $C5, $08, $CC ; ース』か⋯
|1CE2C2| db $FB ; end of message

;===================================================================================================
; Throw something into the pond?
;===================================================================================================
; ーふしぎのいずみー
; 何かアイテムを投げこんでみま
; すか?
; さあ,どうする?
; ▶ 投げてみる
;   やめておく
;===================================================================================================
Message_0148:
|1CE2C3| db $FF, $FF, $C9, $2A, $11, $16, $24, $01 ; ␣␣ーふしぎのい
|1CE2CB| db $26, $31, $C9 ; ずみー
|1CE2CE| db $F8 ; row 2
|1CE2CF| db $FD, $8B ; kanji 何
|1CE2D1| db $08, $50, $51, $6B, $82, $0E ; かアイテムを
|1CE2D7| db $FD, $FC ; kanji 投
|1CE2D9| db $1D, $0C, $0F, $36, $31, $30 ; げこんでみま
|1CE2DF| db $F9 ; row 3
|1CE2E0| db $12, $08, $C6 ; すか?
|1CE2E3| db $FA ; wait for key
|1CE2E4| db $F6 ; scroll
|1CE2E5| db $10, $00, $C8, $37, $02, $12, $3A, $C6 ; さあ,どうする?
|1CE2ED| db $F6 ; scroll
|1CE2EE| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CE2F2| db $FD, $FC ; kanji 投
|1CE2F4| db $1D, $1B, $31, $3A ; げてみる
|1CE2F8| db $F6 ; scroll
|1CE2F9| db $FF, $FF, $FF, $FF, $05, $33, $1B, $04 ; ␣␣␣␣やめてお
|1CE301| db $0A ; く
|1CE302| db $FE, $68 ; choose 2 low
|1CE304| db $FB ; end of message

;===================================================================================================
; Don't do it!
;===================================================================================================
; やめておけ!
;===================================================================================================
Message_0149:
|1CE305| db $05, $33, $1B, $04, $0B, $C7 ; やめておけ!
|1CE30B| db $FB ; end of message

;===================================================================================================
; Don't do it!
;---------------------------------------------------------------------------------------------------
; Duplicate message!!!
;===================================================================================================
; やめておけ!
;===================================================================================================
Message_014A:
|1CE30C| db $05, $33, $1B, $04, $0B, $C7 ; やめておけ!
|1CE312| db $FB ; end of message

;===================================================================================================
; Pond fairy item return
;===================================================================================================
; じゃあ,きみにかえすわ。
; もう,おとしたりしちゃ
; ダ メ ヨ!
;===================================================================================================
Message_014B:
|1CE313| db $25, $47, $00, $C8, $09, $31, $21, $08 ; じゃあ,きみにか
|1CE31B| db $03, $12, $0D, $CD ; えすわ。
|1CE31F| db $F8 ; row 2
|1CE320| db $34, $02, $C8, $04, $1C, $11, $18, $39 ; もう,おとしたり
|1CE328| db $11, $19, $47 ; しちゃ
|1CE32B| db $F9 ; row 3
|1CE32C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $7E ; ␣␣␣␣␣␣␣ダ
|1CE334| db $FF, $83, $FF, $57, $C7 ; ␣メ␣ヨ!
|1CE339| db $FB ; end of message

;===================================================================================================
; How many rupees will you toss?
;===================================================================================================
; ルピーをいくら投げますか?
; ▶ [BCD][BCD]ルピー
;   [BCD][BCD]ルピー
;===================================================================================================
Message_014C:
|1CE33A| db $8A, $93, $C9, $0E, $01, $0A, $38 ; ルピーをいくら
|1CE341| db $FD, $FC ; kanji 投
|1CE343| db $1D, $30, $12, $08, $C6 ; げますか?
|1CE348| db $F8 ; row 2
|1CE349| db $FF, $FF, $E4, $FF ; ␣␣▶␣
|1CE34D| db $FE, $6C, $01 ; BCD digit 1
|1CE350| db $FE, $6C, $00 ; BCD digit 0
|1CE353| db $8A, $93, $C9 ; ルピー
|1CE356| db $F9 ; row 3
|1CE357| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CE35B| db $FE, $6C, $03 ; BCD digit 3
|1CE35E| db $FE, $6C, $02 ; BCD digit 2
|1CE361| db $8A, $93, $C9 ; ルピー
|1CE364| db $FE, $68 ; choose 2 low
|1CE366| db $FB ; end of message

;===================================================================================================
; Pyramid fairy gifts silver arrows
;===================================================================================================
; あなたは,しょうじきな人ね。
; 私,あなたが気にいっちゃった
; 大事な物をあげるわ⋯。
; これは,『銀の矢』です。
; ガノンに,とどめをさすには
; これがぜったい必要なのよ!
; 私がちょっぴりふとめなのは
; ガノンの魔力のせいなんだから
; きっと,ガノンをやっつけてね
;===================================================================================================
Message_014D:
|1CE367| db $00, $20, $18, $28, $C8, $11, $49, $02 ; あなたは,しょう
|1CE36F| db $25, $09, $20 ; じきな
|1CE372| db $FD, $38 ; kanji 人
|1CE374| db $23, $CD ; ね。
|1CE376| db $F8 ; row 2
|1CE377| db $FD, $26 ; kanji 私
|1CE379| db $C8, $00, $20, $18, $15 ; ,あなたが
|1CE37E| db $FD, $37 ; kanji 気
|1CE380| db $21, $01, $4A, $19, $47, $4A, $18 ; にいっちゃった
|1CE387| db $F9 ; row 3
|1CE388| db $FD, $5F ; kanji 大
|1CE38A| db $FD, $22 ; kanji 事
|1CE38C| db $20 ; な
|1CE38D| db $FD, $51 ; kanji 物
|1CE38F| db $0E, $00, $1D, $3A, $0D, $CC, $CD ; をあげるわ⋯。
|1CE396| db $FA ; wait for key
|1CE397| db $F6 ; scroll
|1CE398| db $0C, $3B, $28, $C8, $C4 ; これは,『
|1CE39D| db $FD, $DE ; kanji 銀
|1CE39F| db $24 ; の
|1CE3A0| db $FD, $BB ; kanji 矢
|1CE3A2| db $C5, $36, $12, $CD ; 』です。
|1CE3A6| db $F6 ; scroll
|1CE3A7| db $65, $74, $5F, $21, $C8, $1C, $37, $33 ; ガノンに,とどめ
|1CE3AF| db $0E, $10, $12, $21, $28 ; をさすには
|1CE3B4| db $F6 ; scroll
|1CE3B5| db $0C, $3B, $15, $27, $4A, $18, $01 ; これがぜったい
|1CE3BC| db $FD, $30 ; kanji 必
|1CE3BE| db $FD, $31 ; kanji 要
|1CE3C0| db $20, $24, $07, $C7 ; なのよ!
|1CE3C4| db $FA ; wait for key
|1CE3C5| db $F6 ; scroll
|1CE3C6| db $FD, $26 ; kanji 私
|1CE3C8| db $15, $19, $49, $4A, $43, $39, $2A, $1C ; がちょっぴりふと
|1CE3D0| db $33, $20, $24, $28 ; めなのは
|1CE3D4| db $F6 ; scroll
|1CE3D5| db $65, $74, $5F, $24 ; ガノンの
|1CE3D9| db $FD, $2D ; kanji 魔
|1CE3DB| db $FD, $99 ; kanji 力
|1CE3DD| db $24, $13, $01, $20, $0F, $2E, $08, $38 ; のせいなんだから
|1CE3E5| db $F6 ; scroll
|1CE3E6| db $09, $4A, $1C, $C8, $65, $74, $5F, $0E ; きっと,ガノンを
|1CE3EE| db $05, $4A, $1A, $0B, $1B, $23 ; やっつけてね
|1CE3F4| db $FB ; end of message

;===================================================================================================
; Great luck! Desu.
;===================================================================================================
; 大キチ! です。
;===================================================================================================
Message_014E:
|1CE3F5| db $F8 ; row 2
|1CE3F6| db $FF, $FF, $FF ; ␣␣␣
|1CE3F9| db $FD, $5F ; kanji 大
|1CE3FB| db $59, $69, $C7, $FF, $FF, $36, $12, $CD ; キチ!␣␣です。
|1CE403| db $FB ; end of message

;===================================================================================================
; Good luck! Desu.
;---------------------------------------------------------------------------------------------------
; Official translation:
;    Good Luck!
;---------------------------------------------------------------------------------------------------
; DeepL translation:
;    Being struck mad by something within a thousand miles of the city! Desu.
;===================================================================================================
; 中キチ! です。
;===================================================================================================
Message_014F:
|1CE404| db $F8 ; row 2
|1CE405| db $FF, $FF, $FF ; ␣␣␣
|1CE408| db $FD, $AE ; kanji 中
|1CE40A| db $59, $69, $C7, $FF, $FF, $36, $12, $CD ; キチ!␣␣です。
|1CE412| db $FB ; end of message

;===================================================================================================
; A little luck. Desu.
;===================================================================================================
; 小キチ! です。
;===================================================================================================
Message_0150:
|1CE413| db $F8 ; row 2
|1CE414| db $FF, $FF, $FF ; ␣␣␣
|1CE417| db $FD, $FA ; kanji 小
|1CE419| db $59, $69, $C7, $FF, $FF, $36, $12, $CD ; キチ!␣␣です。
|1CE421| db $FB ; end of message

;===================================================================================================
; Big trouble. Desu. :3
;===================================================================================================
; 大キョウ! です。
;===================================================================================================
Message_0151:
|1CE422| db $F8 ; row 2
|1CE423| db $FF, $FF, $FF ; ␣␣␣
|1CE426| db $FD, $5F ; kanji 大
|1CE428| db $59, $99, $52, $C7, $FF, $FF, $36, $12 ; キョウ!␣␣です
|1CE430| db $CD ; 。
|1CE431| db $FB ; end of message

;===================================================================================================
; Today your luck is…
;===================================================================================================
; ちなみにきょうのあなたの
; 運せいは,
;===================================================================================================
Message_0152:
|1CE432| db $19, $20, $31, $21, $09, $49, $02, $24 ; ちなみにきょうの
|1CE43A| db $00, $20, $18, $24 ; あなたの
|1CE43E| db $F8 ; row 2
|1CE43F| db $FD, $4F ; kanji 運
|1CE441| db $13, $01, $28, $C8 ; せいは,
|1CE445| db $FB ; end of message

;===================================================================================================
; 1/4 Heart pieces
;===================================================================================================
; ハートのかけらをみつけた !
; ♥
;===================================================================================================
Message_0153:
|1CE446| db $78, $C9, $6C, $24, $08, $0B, $38, $0E ; ハートのかけらを
|1CE44E| db $31, $1A, $0B, $18, $FF, $C7 ; みつけた␣!
|1CE454| db $F8 ; row 2
|1CE455| db $FF, $FF, $FF, $FF, $FF, $FF, $E5, $E7 ; ␣␣␣␣␣␣♥♥
|1CE45D| db $FB ; end of message

;===================================================================================================
; 2/4 Heart pieces
;===================================================================================================
; ハートのかけらをみつけた !
; ♥
;===================================================================================================
Message_0154:
|1CE45E| db $78, $C9, $6C, $24, $08, $0B, $38, $0E ; ハートのかけらを
|1CE466| db $31, $1A, $0B, $18, $FF, $C7 ; みつけた␣!
|1CE46C| db $F8 ; row 2
|1CE46D| db $FF, $FF, $FF, $FF, $FF, $FF, $E6, $E7 ; ␣␣␣␣␣␣♥♥
|1CE475| db $FB ; end of message

;===================================================================================================
; 3/4 Heart pieces
;===================================================================================================
; ハートのかけらをみつけた !
; ♥
;===================================================================================================
Message_0155:
|1CE476| db $78, $C9, $6C, $24, $08, $0B, $38, $0E ; ハートのかけらを
|1CE47E| db $31, $1A, $0B, $18, $FF, $C7 ; みつけた␣!
|1CE484| db $F8 ; row 2
|1CE485| db $FF, $FF, $FF, $FF, $FF, $FF, $E8, $E9 ; ␣␣␣␣␣␣♥♥
|1CE48D| db $FB ; end of message

;===================================================================================================
; 4/4 Heart get
;===================================================================================================
; ハートのかけらをみつけた !
; ♥
; ハートのレベルが1つあがった
;===================================================================================================
Message_0156:
|1CE48E| db $78, $C9, $6C, $24, $08, $0B, $38, $0E ; ハートのかけらを
|1CE496| db $31, $1A, $0B, $18, $FF, $C7 ; みつけた␣!
|1CE49C| db $F8 ; row 2
|1CE49D| db $FF, $FF, $FF, $FF, $FF, $FF, $EA, $EB ; ␣␣␣␣␣␣♥♥
|1CE4A5| db $F9 ; row 3
|1CE4A6| db $78, $C9, $6C, $24, $8B, $90, $8A, $15 ; ハートのレベルが
|1CE4AE| db $A1, $1A, $00, $15, $4A, $18 ; 1つあがった
|1CE4B4| db $FB ; end of message

;===================================================================================================
; Sanctuary heart get
;===================================================================================================
; ハートのうつわをみつけた !
; ♥
; ハートのレベルが1つあがった
;===================================================================================================
Message_0157:
|1CE4B5| db $78, $C9, $6C, $24, $02, $1A, $0D, $0E ; ハートのうつわを
|1CE4BD| db $31, $1A, $0B, $18, $FF, $C7 ; みつけた␣!
|1CE4C3| db $F8 ; row 2
|1CE4C4| db $FF, $FF, $FF, $FF, $FF, $FF, $EA, $EB ; ␣␣␣␣␣␣♥♥
|1CE4CC| db $F9 ; row 3
|1CE4CD| db $78, $C9, $6C, $24, $8B, $90, $8A, $15 ; ハートのレベルが
|1CE4D5| db $A1, $1A, $00, $15, $4A, $18 ; 1つあがった
|1CE4DB| db $FB ; end of message

;===================================================================================================
; Big fairy heal
;===================================================================================================
; たびのつかれをいやしましょう
; すこしの間 目をとじて⋯
;===================================================================================================
Message_0158:
|1CE4DC| db $18, $3E, $24, $1A, $08, $3B, $0E, $01 ; たびのつかれをい
|1CE4E4| db $05, $11, $30, $11, $49, $02 ; やしましょう
|1CE4EA| db $F8 ; row 2
|1CE4EB| db $12, $0C, $11, $24 ; すこしの
|1CE4EF| db $FD, $39 ; kanji 間
|1CE4F1| db $FF ; ␣
|1CE4F2| db $FD, $75 ; kanji 目
|1CE4F4| db $0E, $1C, $25, $1B, $CC ; をとじて⋯
|1CE4F9| db $FB ; end of message

;===================================================================================================
; Pink ball when no moon pearl
;===================================================================================================
; うっひ〜! ゴロンゴロン⋯,
; あれっ,あんたは,ウサギさん
; になったんだね⋯。
; そうだよ,この世界は,ぼく達
; の住む世界と,よくにた地けい
; だけど,ちょ〜っとちがうのさ
; そのうえ,迷いこんだ人間は,
; その人の心をうつした姿に,
; かわってしまうんだよ。
; おいら,コロコロ気がかわるも
; んで,ボールみたいになっちゃ
; ったぜ⋯
; でも,ムーンパールって玉が
; あればもとの姿に戻れるらしい
; んだ⋯。 ゴロンゴロンゴロン
;===================================================================================================
Message_0159:
|1CE4FA| db $02, $4A, $29, $CE, $C7, $FF, $6E, $8C ; うっひ〜!␣ゴロ
|1CE502| db $5F, $6E, $8C, $5F, $CC, $C8 ; ンゴロン⋯,
|1CE508| db $F8 ; row 2
|1CE509| db $00, $3B, $4A, $C8, $00, $0F, $18, $28 ; あれっ,あんたは
|1CE511| db $C8, $52, $60, $66, $10, $0F ; ,ウサギさん
|1CE517| db $F9 ; row 3
|1CE518| db $21, $20, $4A, $18, $0F, $2E, $23, $CC ; になったんだね⋯
|1CE520| db $CD ; 。
|1CE521| db $FA ; wait for key
|1CE522| db $F6 ; scroll
|1CE523| db $14, $02, $2E, $07, $C8, $0C, $24 ; そうだよ,この
|1CE52A| db $FD, $E8 ; kanji 世
|1CE52C| db $FD, $E9 ; kanji 界
|1CE52E| db $28, $C8, $41, $0A ; は,ぼく
|1CE532| db $FD, $13 ; kanji 達
|1CE534| db $F6 ; scroll
|1CE535| db $24 ; の
|1CE536| db $FD, $3F ; kanji 住
|1CE538| db $32 ; む
|1CE539| db $FD, $E8 ; kanji 世
|1CE53B| db $FD, $E9 ; kanji 界
|1CE53D| db $1C, $C8, $07, $0A, $21, $18 ; と,よくにた
|1CE543| db $FD, $33 ; kanji 地
|1CE545| db $0B, $01 ; けい
|1CE547| db $F6 ; scroll
|1CE548| db $2E, $0B, $37, $C8, $19, $49, $CE, $4A ; だけど,ちょ〜っ
|1CE550| db $1C, $19, $15, $02, $24, $10 ; とちがうのさ
|1CE556| db $FA ; wait for key
|1CE557| db $F6 ; scroll
|1CE558| db $14, $24, $02, $03, $C8 ; そのうえ,
|1CE55D| db $FD, $70 ; kanji 迷
|1CE55F| db $01, $0C, $0F, $2E ; いこんだ
|1CE563| db $FD, $38 ; kanji 人
|1CE565| db $FD, $39 ; kanji 間
|1CE567| db $28, $C8 ; は,
|1CE569| db $F6 ; scroll
|1CE56A| db $14, $24 ; その
|1CE56C| db $FD, $38 ; kanji 人
|1CE56E| db $24 ; の
|1CE56F| db $FD, $E6 ; kanji 心
|1CE571| db $0E, $02, $1A, $11, $18 ; をうつした
|1CE576| db $FD, $A2 ; kanji 姿
|1CE578| db $21, $C8 ; に,
|1CE57A| db $F6 ; scroll
|1CE57B| db $08, $0D, $4A, $1B, $11, $30, $02, $0F ; かわってしまうん
|1CE583| db $2E, $07, $CD ; だよ。
|1CE586| db $FA ; wait for key
|1CE587| db $F6 ; scroll
|1CE588| db $04, $01, $38, $C8, $5C, $8C, $5C, $8C ; おいら,コロコロ
|1CE590| db $FD, $37 ; kanji 気
|1CE592| db $15, $08, $0D, $3A, $34 ; がかわるも
|1CE597| db $F6 ; scroll
|1CE598| db $0F, $36, $C8, $91, $C9, $8A, $31, $18 ; んで,ボールみた
|1CE5A0| db $01, $21, $20, $4A, $19, $47 ; いになっちゃ
|1CE5A6| db $F6 ; scroll
|1CE5A7| db $4A, $18, $27, $CC ; ったぜ⋯
|1CE5AB| db $FA ; wait for key
|1CE5AC| db $F6 ; scroll
|1CE5AD| db $36, $34, $C8, $82, $C9, $5F, $92, $C9 ; でも,ムーンパー
|1CE5B5| db $8A, $4A, $1B ; ルって
|1CE5B8| db $FD, $D2 ; kanji 玉
|1CE5BA| db $15 ; が
|1CE5BB| db $F6 ; scroll
|1CE5BC| db $00, $3B, $3D, $34, $1C, $24 ; あればもとの
|1CE5C2| db $FD, $A2 ; kanji 姿
|1CE5C4| db $21 ; に
|1CE5C5| db $FD, $0F ; kanji 戻
|1CE5C7| db $3B, $3A, $38, $11, $01 ; れるらしい
|1CE5CC| db $F6 ; scroll
|1CE5CD| db $0F, $2E, $CC, $CD, $FF, $6E, $8C, $5F ; んだ⋯。␣ゴロン
|1CE5D5| db $6E, $8C, $5F, $6E, $8C, $5F ; ゴロンゴロン
|1CE5DB| db $FB ; end of message

;===================================================================================================
; Pink ball when moon pearl is had
;===================================================================================================
; うっひ〜! ありゃりゃ!
; あんたは,姿がかわらないの?
; ただもんじゃないね,あんた。
;===================================================================================================
Message_015A:
|1CE5DC| db $02, $4A, $29, $CE, $C7, $FF, $00, $39 ; うっひ〜!␣あり
|1CE5E4| db $47, $39, $47, $C7 ; ゃりゃ!
|1CE5E8| db $F8 ; row 2
|1CE5E9| db $00, $0F, $18, $28, $C8 ; あんたは,
|1CE5EE| db $FD, $A2 ; kanji 姿
|1CE5F0| db $15, $08, $0D, $38, $20, $01, $24, $C6 ; がかわらないの?
|1CE5F8| db $F9 ; row 3
|1CE5F9| db $18, $2E, $34, $0F, $25, $47, $20, $01 ; ただもんじゃない
|1CE601| db $23, $C8, $00, $0F, $18, $CD ; ね,あんた。
|1CE607| db $FB ; end of message

;===================================================================================================
; Bully when no moon pearl
;===================================================================================================
; おう,なんかもんくあるのか,
; このウサギヤロー!
; せっかく『黄金の力』を
; いただこうと思ってこの世界に
; きたのに,こんな姿になるし
; もとの世界に帰れねェ⋯。
; ヘラの塔にある,ムーンパール
; てェ玉さえ手に入ればもとの姿
; に戻れるってことだが⋯。
; オレは,ムシャクシャしてるん
; だぞ,コノヤロウー!
; あっちヘ行けっ。シッシッ
;===================================================================================================
Message_015B:
|1CE608| db $04, $02, $C8, $20, $0F, $08, $34, $0F ; おう,なんかもん
|1CE610| db $0A, $00, $3A, $24, $08, $C8 ; くあるのか,
|1CE616| db $F8 ; row 2
|1CE617| db $0C, $24, $52, $60, $66, $55, $8C, $C9 ; このウサギヤロー
|1CE61F| db $C7 ; !
|1CE620| db $F9 ; row 3
|1CE621| db $13, $4A, $08, $0A, $C4 ; せっかく『
|1CE626| db $FD, $98 ; kanji 黄
|1CE628| db $FD, $43 ; kanji 金
|1CE62A| db $24 ; の
|1CE62B| db $FD, $99 ; kanji 力
|1CE62D| db $C5, $0E ; 』を
|1CE62F| db $FA ; wait for key
|1CE630| db $F6 ; scroll
|1CE631| db $01, $18, $2E, $0C, $02, $1C ; いただこうと
|1CE637| db $FD, $36 ; kanji 思
|1CE639| db $4A, $1B, $0C, $24 ; ってこの
|1CE63D| db $FD, $E8 ; kanji 世
|1CE63F| db $FD, $E9 ; kanji 界
|1CE641| db $21 ; に
|1CE642| db $F6 ; scroll
|1CE643| db $09, $18, $24, $21, $C8, $0C, $0F, $20 ; きたのに,こんな
|1CE64B| db $FD, $A2 ; kanji 姿
|1CE64D| db $21, $20, $3A, $11 ; になるし
|1CE651| db $F6 ; scroll
|1CE652| db $34, $1C, $24 ; もとの
|1CE655| db $FD, $E8 ; kanji 世
|1CE657| db $FD, $E9 ; kanji 界
|1CE659| db $21 ; に
|1CE65A| db $FD, $D7 ; kanji 帰
|1CE65C| db $3B, $23, $9E, $CC, $CD ; れねェ⋯。
|1CE661| db $FA ; wait for key
|1CE662| db $F6 ; scroll
|1CE663| db $7B, $88, $24 ; ヘラの
|1CE666| db $FD, $D5 ; kanji 塔
|1CE668| db $21, $00, $3A, $C8, $82, $C9, $5F, $92 ; にある,ムーンパ
|1CE670| db $C9, $8A ; ール
|1CE672| db $F6 ; scroll
|1CE673| db $1B, $9E ; てェ
|1CE675| db $FD, $D2 ; kanji 玉
|1CE677| db $10, $03 ; さえ
|1CE679| db $FD, $3E ; kanji 手
|1CE67B| db $21 ; に
|1CE67C| db $FD, $49 ; kanji 入
|1CE67E| db $3B, $3D, $34, $1C, $24 ; ればもとの
|1CE683| db $FD, $A2 ; kanji 姿
|1CE685| db $F6 ; scroll
|1CE686| db $21 ; に
|1CE687| db $FD, $0F ; kanji 戻
|1CE689| db $3B, $3A, $4A, $1B, $0C, $1C, $2E, $15 ; れるってことだが
|1CE691| db $CC, $CD ; ⋯。
|1CE693| db $FA ; wait for key
|1CE694| db $F6 ; scroll
|1CE695| db $54, $8B, $28, $C8, $82, $61, $97, $5A ; オレは,ムシャク
|1CE69D| db $61, $97, $11, $1B, $3A, $0F ; シャしてるん
|1CE6A3| db $F6 ; scroll
|1CE6A4| db $2E, $2D, $C8, $5C, $74, $55, $8C, $52 ; だぞ,コノヤロウ
|1CE6AC| db $C9, $C7 ; ー!
|1CE6AE| db $F6 ; scroll
|1CE6AF| db $00, $4A, $19, $7B ; あっちヘ
|1CE6B3| db $FD, $02 ; kanji 行
|1CE6B5| db $0B, $4A, $CD, $61, $9A, $61, $9A ; けっ。シッシッ
|1CE6BC| db $FB ; end of message

;===================================================================================================
; Bully when moon pearl is had
;===================================================================================================
; うひゃあ!お前,姿がかわらな
; いじゃないか! あっ,お前
; ムーンパールを見つけたなっ!
;===================================================================================================
Message_015C:
|1CE6BD| db $02, $29, $47, $00, $C7, $04 ; うひゃあ!お
|1CE6C3| db $FD, $78 ; kanji 前
|1CE6C5| db $C8 ; ,
|1CE6C6| db $FD, $A2 ; kanji 姿
|1CE6C8| db $15, $08, $0D, $38, $20 ; がかわらな
|1CE6CD| db $F8 ; row 2
|1CE6CE| db $01, $25, $47, $20, $01, $08, $C7, $FF ; いじゃないか!␣
|1CE6D6| db $00, $4A, $C8, $04 ; あっ,お
|1CE6DA| db $FD, $78 ; kanji 前
|1CE6DC| db $F9 ; row 3
|1CE6DD| db $82, $C9, $5F, $92, $C9, $8A, $0E ; ムーンパールを
|1CE6E4| db $FD, $4C ; kanji 見
|1CE6E6| db $1A, $0B, $18, $20, $4A, $C7 ; つけたなっ!
|1CE6EC| db $FB ; end of message

;===================================================================================================
; Dark World shop greeting
;===================================================================================================
; こんな,ぶっそうな世界じゃあ
; 何かと物いりだろ? 好きな物
; を選んでいってくれよ⋯。
;===================================================================================================
Message_015D:
|1CE6ED| db $0C, $0F, $20, $C8, $3F, $4A, $14, $02 ; こんな,ぶっそう
|1CE6F5| db $20 ; な
|1CE6F6| db $FD, $E8 ; kanji 世
|1CE6F8| db $FD, $E9 ; kanji 界
|1CE6FA| db $25, $47, $00 ; じゃあ
|1CE6FD| db $F8 ; row 2
|1CE6FE| db $FD, $8B ; kanji 何
|1CE700| db $08, $1C ; かと
|1CE702| db $FD, $51 ; kanji 物
|1CE704| db $01, $39, $2E, $3C, $C6, $FF ; いりだろ?␣
|1CE70A| db $FD, $6D ; kanji 好
|1CE70C| db $09, $20 ; きな
|1CE70E| db $FD, $51 ; kanji 物
|1CE710| db $F9 ; row 3
|1CE711| db $0E ; を
|1CE712| db $FD, $81 ; kanji 選
|1CE714| db $0F, $36, $01, $4A, $1B, $0A, $3B, $07 ; んでいってくれよ
|1CE71C| db $CC, $CD ; ⋯。
|1CE71E| db $FB ; end of message

;===================================================================================================
; Chest game offer
;===================================================================================================
; はい,いらっしゃい!
; 30ルピーで宝箱2つ開けられ
; るよ。 あそんで行ってくれ!
; どうする?
; ▶ あそんでいく
;   また今度あそぶ
;===================================================================================================
Message_015E:
|1CE71F| db $28, $01, $C8, $01, $38, $4A, $11, $47 ; はい,いらっしゃ
|1CE727| db $01, $C7 ; い!
|1CE729| db $F8 ; row 2
|1CE72A| db $A3, $A0, $8A, $93, $C9, $36 ; 30ルピーで
|1CE730| db $FD, $9A ; kanji 宝
|1CE732| db $FD, $EA ; kanji 箱
|1CE734| db $A2, $1A ; 2つ
|1CE736| db $FD, $4B ; kanji 開
|1CE738| db $0B, $38, $3B ; けられ
|1CE73B| db $F9 ; row 3
|1CE73C| db $3A, $07, $CD, $FF, $00, $14, $0F, $36 ; るよ。␣あそんで
|1CE744| db $FD, $02 ; kanji 行
|1CE746| db $4A, $1B, $0A, $3B, $C7 ; ってくれ!
|1CE74B| db $FA ; wait for key
|1CE74C| db $F6 ; scroll
|1CE74D| db $37, $02, $12, $3A, $C6 ; どうする?
|1CE752| db $F6 ; scroll
|1CE753| db $FF, $FF, $E4, $FF, $00, $14, $0F, $36 ; ␣␣▶␣あそんで
|1CE75B| db $01, $0A ; いく
|1CE75D| db $F6 ; scroll
|1CE75E| db $FF, $FF, $FF, $FF, $30, $18 ; ␣␣␣␣また
|1CE764| db $FD, $6A ; kanji 今
|1CE766| db $FD, $2A ; kanji 度
|1CE768| db $00, $14, $3F ; あそぶ
|1CE76B| db $FE, $68 ; choose 2 low
|1CE76D| db $FB ; end of message

;===================================================================================================
; Chest game rejected
;===================================================================================================
; また,来てあそんでくれよなぁ
; まってるからなあ。
; ほな,さいなら〜。
;===================================================================================================
Message_015F:
|1CE76E| db $30, $18, $C8 ; また,
|1CE771| db $FD, $D6 ; kanji 来
|1CE773| db $1B, $00, $14, $0F, $36, $0A, $3B, $07 ; てあそんでくれよ
|1CE77B| db $20, $4B ; なぁ
|1CE77D| db $F8 ; row 2
|1CE77E| db $30, $4A, $1B, $3A, $08, $38, $20, $00 ; まってるからなあ
|1CE786| db $CD ; 。
|1CE787| db $F9 ; row 3
|1CE788| db $2C, $20, $C8, $10, $01, $20, $38, $CE ; ほな,さいなら〜
|1CE790| db $CD ; 。
|1CE791| db $FB ; end of message

;===================================================================================================
; Nii-chan! Nii-chan! Give me money before opening my chests! >:T
;===================================================================================================
; にいちゃん,にいちゃん!
; ちゃんとルピーはらってから
; 宝箱あけとくれよ!
;===================================================================================================
Message_0160:
|1CE792| db $21, $01, $19, $47, $0F, $C8, $21, $01 ; にいちゃん,にい
|1CE79A| db $19, $47, $0F, $C7 ; ちゃん!
|1CE79E| db $F8 ; row 2
|1CE79F| db $19, $47, $0F, $1C, $8A, $93, $C9, $28 ; ちゃんとルピーは
|1CE7A7| db $38, $4A, $1B, $08, $38 ; らってから
|1CE7AC| db $F9 ; row 3
|1CE7AD| db $FD, $9A ; kanji 宝
|1CE7AF| db $FD, $EA ; kanji 箱
|1CE7B1| db $00, $0B, $1C, $0A, $3B, $07, $C7 ; あけとくれよ!
|1CE7B8| db $FB ; end of message

;===================================================================================================
; Niii-chan, you can't open the treasure chest anymore.
;===================================================================================================
; にいちゃん,宝箱はもう開けら
; れないよ。それでおしまい
; だからな。
;===================================================================================================
Message_0161:
|1CE7B9| db $21, $01, $19, $47, $0F, $C8 ; にいちゃん,
|1CE7BF| db $FD, $9A ; kanji 宝
|1CE7C1| db $FD, $EA ; kanji 箱
|1CE7C3| db $28, $34, $02 ; はもう
|1CE7C6| db $FD, $4B ; kanji 開
|1CE7C8| db $0B, $38 ; けら
|1CE7CA| db $F8 ; row 2
|1CE7CB| db $3B, $20, $01, $07, $CD, $14, $3B, $36 ; れないよ。それで
|1CE7D3| db $04, $11, $30, $01 ; おしまい
|1CE7D7| db $F9 ; row 3
|1CE7D8| db $2E, $08, $38, $20, $CD ; だからな。
|1CE7DD| db $FB ; end of message

;===================================================================================================
; Onii-chan! Play the chest game!
;===================================================================================================
; よっしゃっ,にいちゃん
; あそんでいってやっ!
;===================================================================================================
Message_0162:
|1CE7DE| db $07, $4A, $11, $47, $4A, $C8, $21, $01 ; よっしゃっ,にい
|1CE7E6| db $19, $47, $0F ; ちゃん
|1CE7E9| db $F8 ; row 2
|1CE7EA| db $00, $14, $0F, $36, $01, $4A, $1B, $05 ; あそんでいってや
|1CE7F2| db $4A, $C7 ; っ!
|1CE7F4| db $FB ; end of message

;===================================================================================================
; Light World shop: Buy my stuff with the A button!
;===================================================================================================
; いらっしゃいませ。
; お好きな物をAボタンで,
; お選び下さい。さあ,どうぞ!
;===================================================================================================
Message_0163:
|1CE7F5| db $01, $38, $4A, $11, $47, $01, $30, $13 ; いらっしゃいませ
|1CE7FD| db $CD ; 。
|1CE7FE| db $F8 ; row 2
|1CE7FF| db $04 ; お
|1CE800| db $FD, $6D ; kanji 好
|1CE802| db $09, $20 ; きな
|1CE804| db $FD, $51 ; kanji 物
|1CE806| db $0E, $AA, $91, $68, $5F, $36, $C8 ; をAボタンで,
|1CE80D| db $F9 ; row 3
|1CE80E| db $04 ; お
|1CE80F| db $FD, $81 ; kanji 選
|1CE811| db $3E ; び
|1CE812| db $FD, $61 ; kanji 下
|1CE814| db $10, $01, $CD, $10, $00, $C8, $37, $02 ; さい。さあ,どう
|1CE81C| db $2D, $C7 ; ぞ!
|1CE81E| db $FB ; end of message

;===================================================================================================
; You can't buy that. Pick something else.
;===================================================================================================
; そいつをかっても,なんのとく
; にもなりませんよ。
; もっとちがう物を選んだら?
;===================================================================================================
Message_0164:
|1CE81F| db $14, $01, $1A, $0E, $08, $4A, $1B, $34 ; そいつをかっても
|1CE827| db $C8, $20, $0F, $24, $1C, $0A ; ,なんのとく
|1CE82D| db $F8 ; row 2
|1CE82E| db $21, $34, $20, $39, $30, $13, $0F, $07 ; にもなりませんよ
|1CE836| db $CD ; 。
|1CE837| db $F9 ; row 3
|1CE838| db $34, $4A, $1C, $19, $15, $02 ; もっとちがう
|1CE83E| db $FD, $51 ; kanji 物
|1CE840| db $0E ; を
|1CE841| db $FD, $81 ; kanji 選
|1CE843| db $0F, $2E, $38, $C6 ; んだら?
|1CE847| db $FB ; end of message

;===================================================================================================
; If you lose your shield, come back here.
;---------------------------------------------------------------------------------------------------
; No warranty?
;===================================================================================================
; どうも,ありがとう!
; 盾をなくした時は,
; いつでもどうぞ。
;===================================================================================================
Message_0165:
|1CE848| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE850| db $02, $C7 ; う!
|1CE852| db $F8 ; row 2
|1CE853| db $FD, $1B ; kanji 盾
|1CE855| db $0E, $20, $0A, $11, $18 ; をなくした
|1CE85A| db $FD, $88 ; kanji 時
|1CE85C| db $28, $C8 ; は,
|1CE85E| db $F9 ; row 3
|1CE85F| db $01, $1A, $36, $34, $37, $02, $2D, $CD ; いつでもどうぞ。
|1CE867| db $FB ; end of message

;===================================================================================================
; That's the drug of life you just purchased!
;===================================================================================================
; どうも,ありがとう!
; それは,いのちのクスリだよ。
; 体力が,かいふくするよ。
;===================================================================================================
Message_0166:
|1CE868| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE870| db $02, $C7 ; う!
|1CE872| db $F8 ; row 2
|1CE873| db $14, $3B, $28, $C8, $01, $24, $19, $24 ; それは,いのちの
|1CE87B| db $5A, $62, $89, $2E, $07, $CD ; クスリだよ。
|1CE881| db $F9 ; row 3
|1CE882| db $FD, $BF ; kanji 体
|1CE884| db $FD, $99 ; kanji 力
|1CE886| db $15, $C8, $08, $01, $2A, $0A, $12, $3A ; が,かいふくする
|1CE88E| db $07, $CD ; よ。
|1CE890| db $FB ; end of message

;===================================================================================================
; That's an arrow you just purchased!
;===================================================================================================
; どうも,ありがとう!
; それは,矢です。
; ユミがなければ使えないよ。
;===================================================================================================
Message_0167:
|1CE891| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE899| db $02, $C7 ; う!
|1CE89B| db $F8 ; row 2
|1CE89C| db $14, $3B, $28, $C8 ; それは,
|1CE8A0| db $FD, $BB ; kanji 矢
|1CE8A2| db $36, $12, $CD ; です。
|1CE8A5| db $F9 ; row 3
|1CE8A6| db $56, $81, $15, $20, $0B, $3B, $3D ; ユミがなければ
|1CE8AD| db $FD, $89 ; kanji 使
|1CE8AF| db $03, $20, $01, $07, $CD ; えないよ。
|1CE8B4| db $FB ; end of message

;===================================================================================================
; That's a bomb you just purchased!
;===================================================================================================
; どうも,ありがとう!
; おいたバクダンはAボタンで
; かつげるんだよ。
;===================================================================================================
Message_0168:
|1CE8B5| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE8BD| db $02, $C7 ; う!
|1CE8BF| db $F8 ; row 2
|1CE8C0| db $04, $01, $18, $8D, $5A, $7E, $5F, $28 ; おいたバクダンは
|1CE8C8| db $AA, $91, $68, $5F, $36 ; Aボタンで
|1CE8CD| db $F9 ; row 3
|1CE8CE| db $08, $1A, $1D, $3A, $0F, $2E, $07, $CD ; かつげるんだよ。
|1CE8D6| db $FB ; end of message

;===================================================================================================
; That's a bee you just purchased!
; I don't know what bees are for though.
;===================================================================================================
; どうも,ありがとう!
; それは,ハチだよ,何に使うの
; かは,私も知らないな。
;===================================================================================================
Message_0169:
|1CE8D7| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE8DF| db $02, $C7 ; う!
|1CE8E1| db $F8 ; row 2
|1CE8E2| db $14, $3B, $28, $C8, $78, $69, $2E, $07 ; それは,ハチだよ
|1CE8EA| db $C8 ; ,
|1CE8EB| db $FD, $8B ; kanji 何
|1CE8ED| db $21 ; に
|1CE8EE| db $FD, $89 ; kanji 使
|1CE8F0| db $02, $24 ; うの
|1CE8F2| db $F9 ; row 3
|1CE8F3| db $08, $28, $C8 ; かは,
|1CE8F6| db $FD, $26 ; kanji 私
|1CE8F8| db $34 ; も
|1CE8F9| db $FD, $93 ; kanji 知
|1CE8FB| db $38, $20, $01, $20, $CD ; らないな。
|1CE900| db $FB ; end of message

;===================================================================================================
; That's a heart you just purchased!
;===================================================================================================
; どうも,ありがとう!
; ハートが1つ,かいふくするよ
;===================================================================================================
Message_016A:
|1CE901| db $37, $02, $34, $C8, $00, $39, $15, $1C ; どうも,ありがと
|1CE909| db $02, $C7 ; う!
|1CE90B| db $F8 ; row 2
|1CE90C| db $78, $C9, $6C, $15, $A1, $1A, $C8, $08 ; ハートが1つ,か
|1CE914| db $01, $2A, $0A, $12, $3A, $07 ; いふくするよ
|1CE91A| db $FB ; end of message

;===================================================================================================
; No empty bottle for potion
;===================================================================================================
; おっとっと⋯。そのしな物は,
; アキビンを持っていないと,
; さし上げられませんねえ。
;===================================================================================================
Message_016B:
|1CE91B| db $04, $4A, $1C, $4A, $1C, $CC, $CD, $14 ; おっとっと⋯。そ
|1CE923| db $24, $11, $20 ; のしな
|1CE926| db $FD, $51 ; kanji 物
|1CE928| db $28, $C8 ; は,
|1CE92A| db $F8 ; row 2
|1CE92B| db $50, $59, $8E, $5F, $0E ; アキビンを
|1CE930| db $FD, $DB ; kanji 持
|1CE932| db $4A, $1B, $01, $20, $01, $1C, $C8 ; っていないと,
|1CE939| db $F9 ; row 3
|1CE93A| db $10, $11 ; さし
|1CE93C| db $FD, $72 ; kanji 上
|1CE93E| db $1D, $38, $3B, $30, $13, $0F, $23, $03 ; げられませんねえ
|1CE946| db $CD ; 。
|1CE947| db $FB ; end of message

;===================================================================================================
; No room for more ammunition
;===================================================================================================
; そのしな物は,それいじょう
; 持てませんよ。 他に何か
; ございませんか?
;===================================================================================================
Message_016C:
|1CE948| db $14, $24, $11, $20 ; そのしな
|1CE94C| db $FD, $51 ; kanji 物
|1CE94E| db $28, $C8, $14, $3B, $01, $25, $49, $02 ; は,それいじょう
|1CE956| db $F8 ; row 2
|1CE957| db $FD, $DB ; kanji 持
|1CE959| db $1B, $30, $13, $0F, $07, $CD, $FF ; てませんよ。␣
|1CE960| db $FD, $27 ; kanji 他
|1CE962| db $21 ; に
|1CE963| db $FD, $8B ; kanji 何
|1CE965| db $08 ; か
|1CE966| db $F9 ; row 3
|1CE967| db $1E, $1F, $01, $30, $13, $0F, $08, $C6 ; ございませんか?
|1CE96F| db $FB ; end of message

;===================================================================================================
; Ganon message
;===================================================================================================
; きさまの様なコゾウに,
; ここまでおいつめられるとは
; 思わなかったぞ!
; わがぶんしん闇の司祭アグニム
; を2度までもしりぞけるとは⋯
; だが,トライフォースはやらぬ
; きさまを倒し,光と闇2つの
; 世界を 支配するわがのぞみ
; 必ずかなえてみせるわ!
;===================================================================================================
Message_016D:
|1CE970| db $09, $10, $30, $24 ; きさまの
|1CE974| db $FD, $10 ; kanji 様
|1CE976| db $20, $5C, $7D, $52, $21, $C8 ; なコゾウに,
|1CE97C| db $F8 ; row 2
|1CE97D| db $0C, $0C, $30, $36, $04, $01, $1A, $33 ; ここまでおいつめ
|1CE985| db $38, $3B, $3A, $1C, $28 ; られるとは
|1CE98A| db $F9 ; row 3
|1CE98B| db $FD, $36 ; kanji 思
|1CE98D| db $0D, $20, $08, $4A, $18, $2D, $C7 ; わなかったぞ!
|1CE994| db $FA ; wait for key
|1CE995| db $F6 ; scroll
|1CE996| db $0D, $15, $3F, $0F, $11, $0F ; わがぶんしん
|1CE99C| db $FD, $57 ; kanji 闇
|1CE99E| db $24 ; の
|1CE99F| db $FD, $0D ; kanji 司
|1CE9A1| db $FD, $17 ; kanji 祭
|1CE9A3| db $50, $67, $71, $82 ; アグニム
|1CE9A7| db $F6 ; scroll
|1CE9A8| db $0E, $A2 ; を2
|1CE9AA| db $FD, $2A ; kanji 度
|1CE9AC| db $30, $36, $34, $11, $39, $2D, $0B, $3A ; までもしりぞける
|1CE9B4| db $1C, $28, $CC ; とは⋯
|1CE9B7| db $F6 ; scroll
|1CE9B8| db $2E, $15, $C8, $6C, $88, $51, $7A, $9F ; だが,トライフォ
|1CE9C0| db $C9, $62, $28, $05, $38, $22 ; ースはやらぬ
|1CE9C6| db $FA ; wait for key
|1CE9C7| db $F6 ; scroll
|1CE9C8| db $09, $10, $30, $0E ; きさまを
|1CE9CC| db $FD, $29 ; kanji 倒
|1CE9CE| db $11, $C8 ; し,
|1CE9D0| db $FD, $73 ; kanji 光
|1CE9D2| db $1C ; と
|1CE9D3| db $FD, $57 ; kanji 闇
|1CE9D5| db $A2, $1A, $24 ; 2つの
|1CE9D8| db $F6 ; scroll
|1CE9D9| db $FD, $E8 ; kanji 世
|1CE9DB| db $FD, $E9 ; kanji 界
|1CE9DD| db $0E, $FF ; を␣
|1CE9DF| db $FD, $F0 ; kanji 支
|1CE9E1| db $FD, $8E ; kanji 配
|1CE9E3| db $12, $3A, $0D, $15, $24, $2D, $31 ; するわがのぞみ
|1CE9EA| db $F6 ; scroll
|1CE9EB| db $FD, $30 ; kanji 必
|1CE9ED| db $26, $08, $20, $03, $1B, $31, $13, $3A ; ずかなえてみせる
|1CE9F5| db $0D, $C7 ; わ!
|1CE9F7| db $FB ; end of message

;===================================================================================================
; Ganon: Darkness attack!!!!
;===================================================================================================
; コゾウ,なかなかやるなっ!
; だが,この闇の秘術,お前に
; やぶれるかな⋯。ゆくぞ!
;===================================================================================================
Message_016E:
|1CE9F8| db $5C, $7D, $52, $C8, $20, $08, $20, $08 ; コゾウ,なかなか
|1CEA00| db $05, $3A, $20, $4A, $C7 ; やるなっ!
|1CEA05| db $F8 ; row 2
|1CEA06| db $2E, $15, $C8, $0C, $24 ; だが,この
|1CEA0B| db $FD, $57 ; kanji 闇
|1CEA0D| db $24 ; の
|1CEA0E| db $FD, $C1 ; kanji 秘
|1CEA10| db $FD, $CB ; kanji 術
|1CEA12| db $C8, $04 ; ,お
|1CEA14| db $FD, $78 ; kanji 前
|1CEA16| db $21 ; に
|1CEA17| db $F9 ; row 3
|1CEA18| db $05, $3F, $3B, $3A, $08, $20, $CC, $CD ; やぶれるかな⋯。
|1CEA20| db $06, $0A, $2D, $C7 ; ゆくぞ!
|1CEA24| db $FB ; end of message

;===================================================================================================
; Lost Woods hideout thief
;===================================================================================================
; やい,こぞう。ここは,オレ達
; 盗賊ー味のかくれ家なんだぞ!
; かってに入らないでくれよ⋯。
; 話は,かわるけど,昔オレ達の
; なかまだった男が,あやしのサ
; バクの入口にいるんだってなあ
;===================================================================================================
Message_016F:
|1CEA25| db $05, $01, $C8, $0C, $2D, $02, $CD, $0C ; やい,こぞう。こ
|1CEA2D| db $0C, $28, $C8, $54, $8B ; こは,オレ
|1CEA32| db $FD, $13 ; kanji 達
|1CEA34| db $F8 ; row 2
|1CEA35| db $FD, $F1 ; kanji 盗
|1CEA37| db $FD, $EE ; kanji 賊
|1CEA39| db $C9 ; ー
|1CEA3A| db $FD, $1F ; kanji 味
|1CEA3C| db $24, $08, $0A, $3B ; のかくれ
|1CEA40| db $FD, $56 ; kanji 家
|1CEA42| db $20, $0F, $2E, $2D, $C7 ; なんだぞ!
|1CEA47| db $F9 ; row 3
|1CEA48| db $08, $4A, $1B, $21 ; かってに
|1CEA4C| db $FD, $49 ; kanji 入
|1CEA4E| db $38, $20, $01, $36, $0A, $3B, $07, $CC ; らないでくれよ⋯
|1CEA56| db $CD ; 。
|1CEA57| db $FA ; wait for key
|1CEA58| db $F6 ; scroll
|1CEA59| db $FD, $A3 ; kanji 話
|1CEA5B| db $28, $C8, $08, $0D, $3A, $0B, $37, $C8 ; は,かわるけど,
|1CEA63| db $FD, $7E ; kanji 昔
|1CEA65| db $54, $8B ; オレ
|1CEA67| db $FD, $13 ; kanji 達
|1CEA69| db $24 ; の
|1CEA6A| db $F6 ; scroll
|1CEA6B| db $20, $08, $30, $2E, $4A, $18 ; なかまだった
|1CEA71| db $FD, $5E ; kanji 男
|1CEA73| db $15, $C8, $00, $05, $11, $24, $60 ; が,あやしのサ
|1CEA7A| db $F6 ; scroll
|1CEA7B| db $8D, $5A, $24 ; バクの
|1CEA7E| db $FD, $49 ; kanji 入
|1CEA80| db $FD, $4A ; kanji 口
|1CEA82| db $21, $01, $3A, $0F, $2E, $4A, $1B, $20 ; にいるんだってな
|1CEA8A| db $00 ; あ
|1CEA8B| db $FB ; end of message

;===================================================================================================
; Blind's hideout guy
;===================================================================================================
; よう,[LINK]。この家は,昔
; 盗賊のかくれ家だったんだぞ。
; なんて言ったかなあ⋯。
; そうそう,ブラインドとか言う
; 名の盗賊で,あかるい所が大キ
; ライだったらしいぜ。
;===================================================================================================
Message_0170:
|1CEA8C| db $07, $02, $C8 ; よう,
|1CEA8F| db $FE, $6A ; write player name
|1CEA91| db $CD, $0C, $24 ; 。この
|1CEA94| db $FD, $56 ; kanji 家
|1CEA96| db $28, $C8 ; は,
|1CEA98| db $FD, $7E ; kanji 昔
|1CEA9A| db $F8 ; row 2
|1CEA9B| db $FD, $F1 ; kanji 盗
|1CEA9D| db $FD, $EE ; kanji 賊
|1CEA9F| db $24, $08, $0A, $3B ; のかくれ
|1CEAA3| db $FD, $56 ; kanji 家
|1CEAA5| db $2E, $4A, $18, $0F, $2E, $2D, $CD ; だったんだぞ。
|1CEAAC| db $F9 ; row 3
|1CEAAD| db $20, $0F, $1B ; なんて
|1CEAB0| db $FD, $16 ; kanji 言
|1CEAB2| db $4A, $18, $08, $20, $00, $CC, $CD ; ったかなあ⋯。
|1CEAB9| db $FA ; wait for key
|1CEABA| db $F6 ; scroll
|1CEABB| db $14, $02, $14, $02, $C8, $8F, $88, $51 ; そうそう,ブライ
|1CEAC3| db $5F, $87, $1C, $08 ; ンドとか
|1CEAC7| db $FD, $16 ; kanji 言
|1CEAC9| db $02 ; う
|1CEACA| db $F6 ; scroll
|1CEACB| db $FD, $6F ; kanji 名
|1CEACD| db $24 ; の
|1CEACE| db $FD, $F1 ; kanji 盗
|1CEAD0| db $FD, $EE ; kanji 賊
|1CEAD2| db $36, $C8, $00, $08, $3A, $01 ; で,あかるい
|1CEAD8| db $FD, $55 ; kanji 所
|1CEADA| db $15 ; が
|1CEADB| db $FD, $5F ; kanji 大
|1CEADD| db $59 ; キ
|1CEADE| db $F6 ; scroll
|1CEADF| db $88, $51, $2E, $4A, $18, $38, $11, $01 ; ライだったらしい
|1CEAE7| db $27, $CD ; ぜ。
|1CEAE9| db $FB ; end of message

;===================================================================================================
; I am the Triforce!
;===================================================================================================
; ようこそ,[LINK]よ⋯。
; 私は,トライフォースの精
; ⋯ ⋯ ⋯
; トライフォースは神があたえし
; 『黄金の力』 ふれた者の心の
; 中にある願いをかなえます。
; こころ正しき者がふれれば,
; 正しき願いを⋯悪しき者が
; ふれれば,悪しき願いを⋯。
; その者の願いが,強ければ
; 強いほど,トライフォースは
; その力をはっきするのです。
; ガノンの願いは世界を手にする
; ことでした。その悪しき願いは
; 聖地を闇の世界にかえてしまい
; そこで力をたくわえたガノンは
; じぶんの願いをかなえるために
; 光の世界へ現れるつもりでした
; しかし,トライフォースにふれ
; たガノンが倒れた今,闇の世界
; も消えゆくことでしょう。
; トライフォースは新たな持ちぬ
; しをまっています『黄金の力』
; は,あなたの手にあるのです。
; さあ,ふれてごらんなさい。
; あなたの心にある願いのままに
; ⋯ ⋯ ⋯ ⋯
;===================================================================================================
Message_0171:
|1CEAEA| db $FC, $02 ; text speed: 2
|1CEAEC| db $FE, $6D, $00 ; position: high
|1CEAEF| db $FE, $6B, $02 ; border: 2
|1CEAF2| db $07, $02, $0C, $14, $C8 ; ようこそ,
|1CEAF7| db $FE, $6A ; write player name
|1CEAF9| db $07, $CC, $CD ; よ⋯。
|1CEAFC| db $F8 ; row 2
|1CEAFD| db $FD, $26 ; kanji 私
|1CEAFF| db $28, $C8, $6C, $88, $51, $7A, $9F, $C9 ; は,トライフォー
|1CEB07| db $62, $24 ; スの
|1CEB09| db $FD, $92 ; kanji 精
|1CEB0B| db $F9 ; row 3
|1CEB0C| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CEB12| db $FC, $01 ; text speed: 1
|1CEB14| db $FA ; wait for key
|1CEB15| db $F7 ; row 1
|1CEB16| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEB1E| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CEB22| db $F8 ; row 2
|1CEB23| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEB2B| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEB31| db $F9 ; row 3
|1CEB32| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEB38| db $FC, $02 ; text speed: 2
|1CEB3A| db $F7 ; row 1
|1CEB3B| db $6C, $88, $51, $7A, $9F, $C9, $62, $28 ; トライフォースは
|1CEB43| db $FD, $05 ; kanji 神
|1CEB45| db $15, $00, $18, $03, $11 ; があたえし
|1CEB4A| db $F8 ; row 2
|1CEB4B| db $C4 ; 『
|1CEB4C| db $FD, $98 ; kanji 黄
|1CEB4E| db $FD, $43 ; kanji 金
|1CEB50| db $24 ; の
|1CEB51| db $FD, $99 ; kanji 力
|1CEB53| db $C5, $FF, $2A, $3B, $18 ; 』␣ふれた
|1CEB58| db $FD, $1E ; kanji 者
|1CEB5A| db $24 ; の
|1CEB5B| db $FD, $E6 ; kanji 心
|1CEB5D| db $24 ; の
|1CEB5E| db $F9 ; row 3
|1CEB5F| db $FD, $AE ; kanji 中
|1CEB61| db $21, $00, $3A ; にある
|1CEB64| db $FD, $0A ; kanji 願
|1CEB66| db $01, $0E, $08, $20, $03, $30, $12, $CD ; いをかなえます。
|1CEB6E| db $FC, $01 ; text speed: 1
|1CEB70| db $FA ; wait for key
|1CEB71| db $F7 ; row 1
|1CEB72| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEB7A| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEB80| db $F8 ; row 2
|1CEB81| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEB89| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEB8F| db $F9 ; row 3
|1CEB90| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEB98| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEB9D| db $FC, $02 ; text speed: 2
|1CEB9F| db $F7 ; row 1
|1CEBA0| db $0C, $0C, $3C ; こころ
|1CEBA3| db $FD, $4D ; kanji 正
|1CEBA5| db $11, $09 ; しき
|1CEBA7| db $FD, $1E ; kanji 者
|1CEBA9| db $15, $2A, $3B, $3B, $3D, $C8 ; がふれれば,
|1CEBAF| db $F8 ; row 2
|1CEBB0| db $FD, $4D ; kanji 正
|1CEBB2| db $11, $09 ; しき
|1CEBB4| db $FD, $0A ; kanji 願
|1CEBB6| db $01, $0E, $CC ; いを⋯
|1CEBB9| db $FD, $85 ; kanji 悪
|1CEBBB| db $11, $09 ; しき
|1CEBBD| db $FD, $1E ; kanji 者
|1CEBBF| db $15 ; が
|1CEBC0| db $F9 ; row 3
|1CEBC1| db $2A, $3B, $3B, $3D, $C8 ; ふれれば,
|1CEBC6| db $FD, $85 ; kanji 悪
|1CEBC8| db $11, $09 ; しき
|1CEBCA| db $FD, $0A ; kanji 願
|1CEBCC| db $01, $0E, $CC, $CD ; いを⋯。
|1CEBD0| db $FC, $01 ; text speed: 1
|1CEBD2| db $FA ; wait for key
|1CEBD3| db $F7 ; row 1
|1CEBD4| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEBDC| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEBE1| db $F8 ; row 2
|1CEBE2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEBEA| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CEBEE| db $F9 ; row 3
|1CEBEF| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEBF7| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEBFC| db $FC, $02 ; text speed: 2
|1CEBFE| db $F7 ; row 1
|1CEBFF| db $14, $24 ; その
|1CEC01| db $FD, $1E ; kanji 者
|1CEC03| db $24 ; の
|1CEC04| db $FD, $0A ; kanji 願
|1CEC06| db $01, $15, $C8 ; いが,
|1CEC09| db $FD, $FB ; kanji 強
|1CEC0B| db $0B, $3B, $3D ; ければ
|1CEC0E| db $F8 ; row 2
|1CEC0F| db $FD, $FB ; kanji 強
|1CEC11| db $01, $2C, $37, $C8, $6C, $88, $51, $7A ; いほど,トライフ
|1CEC19| db $9F, $C9, $62, $28 ; ォースは
|1CEC1D| db $F9 ; row 3
|1CEC1E| db $14, $24 ; その
|1CEC20| db $FD, $99 ; kanji 力
|1CEC22| db $0E, $28, $4A, $09, $12, $3A, $24, $36 ; をはっきするので
|1CEC2A| db $12, $CD ; す。
|1CEC2C| db $FC, $01 ; text speed: 1
|1CEC2E| db $FA ; wait for key
|1CEC2F| db $F7 ; row 1
|1CEC30| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEC38| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEC3D| db $F8 ; row 2
|1CEC3E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEC46| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEC4B| db $F9 ; row 3
|1CEC4C| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEC54| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CEC59| db $FC, $02 ; text speed: 2
|1CEC5B| db $F7 ; row 1
|1CEC5C| db $65, $74, $5F, $24 ; ガノンの
|1CEC60| db $FD, $0A ; kanji 願
|1CEC62| db $01, $28 ; いは
|1CEC64| db $FD, $E8 ; kanji 世
|1CEC66| db $FD, $E9 ; kanji 界
|1CEC68| db $0E ; を
|1CEC69| db $FD, $3E ; kanji 手
|1CEC6B| db $21, $12, $3A ; にする
|1CEC6E| db $F8 ; row 2
|1CEC6F| db $0C, $1C, $36, $11, $18, $CD, $14, $24 ; ことでした。その
|1CEC77| db $FD, $85 ; kanji 悪
|1CEC79| db $11, $09 ; しき
|1CEC7B| db $FD, $0A ; kanji 願
|1CEC7D| db $01, $28 ; いは
|1CEC7F| db $F9 ; row 3
|1CEC80| db $FD, $F6 ; kanji 聖
|1CEC82| db $FD, $33 ; kanji 地
|1CEC84| db $0E ; を
|1CEC85| db $FD, $57 ; kanji 闇
|1CEC87| db $24 ; の
|1CEC88| db $FD, $E8 ; kanji 世
|1CEC8A| db $FD, $E9 ; kanji 界
|1CEC8C| db $21, $08, $03, $1B, $11, $30, $01 ; にかえてしまい
|1CEC93| db $FC, $01 ; text speed: 1
|1CEC95| db $FA ; wait for key
|1CEC96| db $F7 ; row 1
|1CEC97| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEC9F| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CECA5| db $F8 ; row 2
|1CECA6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CECAE| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CECB4| db $F9 ; row 3
|1CECB5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CECBD| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CECC3| db $FC, $02 ; text speed: 2
|1CECC5| db $F7 ; row 1
|1CECC6| db $14, $0C, $36 ; そこで
|1CECC9| db $FD, $99 ; kanji 力
|1CECCB| db $0E, $18, $0A, $0D, $03, $18, $65, $74 ; をたくわえたガノ
|1CECD3| db $5F, $28 ; ンは
|1CECD5| db $F8 ; row 2
|1CECD6| db $25, $3F, $0F, $24 ; じぶんの
|1CECDA| db $FD, $0A ; kanji 願
|1CECDC| db $01, $0E, $08, $20, $03, $3A, $18, $33 ; いをかなえるため
|1CECE4| db $21 ; に
|1CECE5| db $F9 ; row 3
|1CECE6| db $FD, $73 ; kanji 光
|1CECE8| db $24 ; の
|1CECE9| db $FD, $E8 ; kanji 世
|1CECEB| db $FD, $E9 ; kanji 界
|1CECED| db $2B ; へ
|1CECEE| db $FD, $BC ; kanji 現
|1CECF0| db $3B, $3A, $1A, $34, $39, $36, $11, $18 ; れるつもりでした
|1CECF8| db $FC, $01 ; text speed: 1
|1CECFA| db $FA ; wait for key
|1CECFB| db $F7 ; row 1
|1CECFC| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED04| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CED0A| db $F8 ; row 2
|1CED0B| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED13| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CED19| db $F9 ; row 3
|1CED1A| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED22| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CED28| db $FC, $02 ; text speed: 2
|1CED2A| db $F7 ; row 1
|1CED2B| db $11, $08, $11, $C8, $6C, $88, $51, $7A ; しかし,トライフ
|1CED33| db $9F, $C9, $62, $21, $2A, $3B ; ォースにふれ
|1CED39| db $F8 ; row 2
|1CED3A| db $18, $65, $74, $5F, $15 ; たガノンが
|1CED3F| db $FD, $29 ; kanji 倒
|1CED41| db $3B, $18 ; れた
|1CED43| db $FD, $6A ; kanji 今
|1CED45| db $C8 ; ,
|1CED46| db $FD, $57 ; kanji 闇
|1CED48| db $24 ; の
|1CED49| db $FD, $E8 ; kanji 世
|1CED4B| db $FD, $E9 ; kanji 界
|1CED4D| db $F9 ; row 3
|1CED4E| db $34 ; も
|1CED4F| db $FD, $9D ; kanji 消
|1CED51| db $03, $06, $0A, $0C, $1C, $36, $11, $49 ; えゆくことでしょ
|1CED59| db $02, $CD ; う。
|1CED5B| db $FC, $01 ; text speed: 1
|1CED5D| db $FA ; wait for key
|1CED5E| db $F7 ; row 1
|1CED5F| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED67| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CED6D| db $F8 ; row 2
|1CED6E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED76| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CED7C| db $F9 ; row 3
|1CED7D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CED85| db $FF, $FF, $FF, $FF ; ␣␣␣␣
|1CED89| db $FC, $02 ; text speed: 2
|1CED8B| db $F7 ; row 1
|1CED8C| db $6C, $88, $51, $7A, $9F, $C9, $62, $28 ; トライフォースは
|1CED94| db $FD, $E7 ; kanji 新
|1CED96| db $18, $20 ; たな
|1CED98| db $FD, $DB ; kanji 持
|1CED9A| db $19, $22 ; ちぬ
|1CED9C| db $F8 ; row 2
|1CED9D| db $11, $0E, $30, $4A, $1B, $01, $30, $12 ; しをまっています
|1CEDA5| db $C4 ; 『
|1CEDA6| db $FD, $98 ; kanji 黄
|1CEDA8| db $FD, $43 ; kanji 金
|1CEDAA| db $24 ; の
|1CEDAB| db $FD, $99 ; kanji 力
|1CEDAD| db $C5 ; 』
|1CEDAE| db $F9 ; row 3
|1CEDAF| db $28, $C8, $00, $20, $18, $24 ; は,あなたの
|1CEDB5| db $FD, $3E ; kanji 手
|1CEDB7| db $21, $00, $3A, $24, $36, $12, $CD ; にあるのです。
|1CEDBE| db $FC, $01 ; text speed: 1
|1CEDC0| db $FA ; wait for key
|1CEDC1| db $F7 ; row 1
|1CEDC2| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEDCA| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEDD0| db $F8 ; row 2
|1CEDD1| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEDD9| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEDDF| db $F9 ; row 3
|1CEDE0| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣␣␣
|1CEDE8| db $FF, $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣␣
|1CEDEE| db $FC, $02 ; text speed: 2
|1CEDF0| db $F7 ; row 1
|1CEDF1| db $10, $00, $C8, $2A, $3B, $1B, $1E, $38 ; さあ,ふれてごら
|1CEDF9| db $0F, $20, $10, $01, $CD ; んなさい。
|1CEDFE| db $F8 ; row 2
|1CEDFF| db $00, $20, $18, $24 ; あなたの
|1CEE03| db $FD, $E6 ; kanji 心
|1CEE05| db $21, $00, $3A ; にある
|1CEE08| db $FD, $0A ; kanji 願
|1CEE0A| db $01, $24, $30, $30, $21 ; いのままに
|1CEE0F| db $F9 ; row 3
|1CEE10| db $FF, $FF, $CC, $FF, $CC, $FF, $CC, $FF ; ␣␣⋯␣⋯␣⋯␣
|1CEE18| db $CC ; ⋯
|1CEE19| db $FB ; end of message

;===================================================================================================
; Toppo prize
;---------------------------------------------------------------------------------------------------
; This guy is extremely angry.
;===================================================================================================
; チクショー もってけどろぼう
;===================================================================================================
Message_0172:
|1CEE1A| db $69, $5A, $61, $99, $C9, $FF, $34, $4A ; チクショー␣もっ
|1CEE22| db $1B, $0B, $37, $3C, $41, $02 ; てけどろぼう
|1CEE28| db $FB ; end of message

;===================================================================================================
; Drunkard
;===================================================================================================
; ういっ,おれは見たんだ。
; 川上の願いのタキでものすげ〜
; べっぴんのネエちゃんをよ⋯。
; [LINK]も1度会ってみな。
; ぜったい気に入ると思うけどな
;===================================================================================================
Message_0173:
|1CEE29| db $02, $01, $4A, $C8, $04, $3B, $28 ; ういっ,おれは
|1CEE30| db $FD, $4C ; kanji 見
|1CEE32| db $18, $0F, $2E, $CD ; たんだ。
|1CEE36| db $F8 ; row 2
|1CEE37| db $FD, $B8 ; kanji 川
|1CEE39| db $FD, $72 ; kanji 上
|1CEE3B| db $24 ; の
|1CEE3C| db $FD, $0A ; kanji 願
|1CEE3E| db $01, $24, $68, $59, $36, $34, $24, $12 ; いのタキでものす
|1CEE46| db $1D, $CE ; げ〜
|1CEE48| db $F9 ; row 3
|1CEE49| db $40, $4A, $43, $0F, $24, $73, $53, $19 ; べっぴんのネエち
|1CEE51| db $47, $0F, $0E, $07, $CC, $CD ; ゃんをよ⋯。
|1CEE57| db $FA ; wait for key
|1CEE58| db $F6 ; scroll
|1CEE59| db $FE, $6A ; write player name
|1CEE5B| db $34, $A1 ; も1
|1CEE5D| db $FD, $2A ; kanji 度
|1CEE5F| db $FD, $04 ; kanji 会
|1CEE61| db $4A, $1B, $31, $20, $CD ; ってみな。
|1CEE66| db $F6 ; scroll
|1CEE67| db $27, $4A, $18, $01 ; ぜったい
|1CEE6B| db $FD, $37 ; kanji 気
|1CEE6D| db $21 ; に
|1CEE6E| db $FD, $49 ; kanji 入
|1CEE70| db $3A, $1C ; ると
|1CEE72| db $FD, $36 ; kanji 思
|1CEE74| db $02, $0B, $37, $20 ; うけどな
|1CEE78| db $F6 ; scroll
|1CEE79| db $FB ; end of message

;===================================================================================================
; It's a secret to everyone.
;===================================================================================================
; みんなには,ナイショだよ。
;===================================================================================================
Message_0174:
|1CEE7A| db $31, $0F, $20, $21, $28, $C8, $70, $51 ; みんなには,ナイ
|1CEE82| db $61, $99, $2E, $07, $CD ; ショだよ。
|1CEE87| db $FB ; end of message

;===================================================================================================
; Check out ice rod cave.
; It's a secret to everyone.
;===================================================================================================
; ハイリア湖の東の洞くつには
; 何かが住んでるよ。
; みんなには,ナイショだよ。
;===================================================================================================
Message_0175:
|1CEE88| db $78, $51, $89, $50 ; ハイリア
|1CEE8C| db $FD, $12 ; kanji 湖
|1CEE8E| db $24 ; の
|1CEE8F| db $FD, $D9 ; kanji 東
|1CEE91| db $24 ; の
|1CEE92| db $FD, $EF ; kanji 洞
|1CEE94| db $0A, $1A, $21, $28 ; くつには
|1CEE98| db $F8 ; row 2
|1CEE99| db $FD, $8B ; kanji 何
|1CEE9B| db $08, $15 ; かが
|1CEE9D| db $FD, $3F ; kanji 住
|1CEE9F| db $0F, $36, $3A, $07, $CD ; んでるよ。
|1CEEA4| db $F9 ; row 3
|1CEEA5| db $31, $0F, $20, $21, $28, $C8, $70, $51 ; みんなには,ナイ
|1CEEAD| db $61, $99, $2E, $07, $CD ; ショだよ。
|1CEEB2| db $FB ; end of message

;===================================================================================================
; Kill people for money.
; It's a secret to everyone.
;===================================================================================================
; とまった敵をやっつけると
; ルピーがよくでるよ。
; みんなには,ナイショだよ。
;===================================================================================================
Message_0176:
|1CEEB3| db $1C, $30, $4A, $18 ; とまった
|1CEEB7| db $FD, $D1 ; kanji 敵
|1CEEB9| db $0E, $05, $4A, $1A, $0B, $3A, $1C ; をやっつけると
|1CEEC0| db $F8 ; row 2
|1CEEC1| db $8A, $93, $C9, $15, $07, $0A, $36, $3A ; ルピーがよくでる
|1CEEC9| db $07, $CD ; よ。
|1CEECB| db $F9 ; row 3
|1CEECC| db $31, $0F, $20, $21, $28, $C8, $70, $51 ; みんなには,ナイ
|1CEED4| db $61, $99, $2E, $07, $CD ; ショだよ。
|1CEED9| db $FB ; end of message

;===================================================================================================
; Telepathy tile: Small spike cave
;===================================================================================================
; こおった敵をハンマーでこわす
; と,魔法のツボがもらえるのを
; 知っておるか? [LINK]よ⋯
;===================================================================================================
Message_0177:
|1CEEDA| db $0C, $04, $4A, $18 ; こおった
|1CEEDE| db $FD, $D1 ; kanji 敵
|1CEEE0| db $0E, $78, $5F, $80, $C9, $36, $0C, $0D ; をハンマーでこわ
|1CEEE8| db $12 ; す
|1CEEE9| db $F8 ; row 2
|1CEEEA| db $1C, $C8 ; と,
|1CEEEC| db $FD, $2D ; kanji 魔
|1CEEEE| db $FD, $3C ; kanji 法
|1CEEF0| db $24, $6A, $91, $15, $34, $38, $03, $3A ; のツボがもらえる
|1CEEF8| db $24, $0E ; のを
|1CEEFA| db $F9 ; row 3
|1CEEFB| db $FD, $93 ; kanji 知
|1CEEFD| db $4A, $1B, $04, $3A, $08, $C6, $FF ; っておるか?␣
|1CEF04| db $FE, $6A ; write player name
|1CEF06| db $07, $CC ; よ⋯
|1CEF08| db $FB ; end of message

;===================================================================================================
; Cukeman: Tra la la, look for Sahasrahla.
;===================================================================================================
; まずは
; サハスラーラを さがすラーラ
; ⋯ ⋯ ⋯ 。
;===================================================================================================
Message_0178:
|1CEF09| db $30, $26, $28 ; まずは
|1CEF0C| db $F8 ; row 2
|1CEF0D| db $60, $78, $62, $88, $C9, $88, $0E, $FF ; サハスラーラを␣
|1CEF15| db $10, $15, $12, $88, $C9, $88 ; さがすラーラ
|1CEF1B| db $F9 ; row 3
|1CEF1C| db $FF, $CC, $FF, $CC, $FF, $CC, $FF, $CD ; ␣⋯␣⋯␣⋯␣。
|1CEF24| db $FB ; end of message

;===================================================================================================
; Cukeman: Oh yah, you found Sahasrahla!
;===================================================================================================
; サハスラーラを みつけたの!
; ⋯ ⋯ ⋯
; さすがラーラ ⋯
;===================================================================================================
Message_0179:
|1CEF25| db $60, $78, $62, $88, $C9, $88, $0E, $FF ; サハスラーラを␣
|1CEF2D| db $31, $1A, $0B, $18, $24, $C7 ; みつけたの!
|1CEF33| db $F8 ; row 2
|1CEF34| db $FF, $CC, $FF, $CC, $FF, $CC ; ␣⋯␣⋯␣⋯
|1CEF3A| db $F9 ; row 3
|1CEF3B| db $10, $12, $15, $88, $C9, $88, $FF, $FF ; さすがラーラ␣␣
|1CEF43| db $CC ; ⋯
|1CEF44| db $FB ; end of message

;===================================================================================================
; I'm sorry, but you appear to be poor.
;===================================================================================================
; ごめんなさい。
; ちょっと ルピーが
; 足りないみたい⋯。
;===================================================================================================
Message_017A:
|1CEF45| db $1E, $33, $0F, $20, $10, $01, $CD ; ごめんなさい。
|1CEF4C| db $F8 ; row 2
|1CEF4D| db $19, $49, $4A, $1C, $FF, $8A, $93, $C9 ; ちょっと␣ルピー
|1CEF55| db $15 ; が
|1CEF56| db $F9 ; row 3
|1CEF57| db $FD, $96 ; kanji 足
|1CEF59| db $39, $20, $01, $31, $18, $01, $CC, $CD ; りないみたい⋯。
|1CEF61| db $FB ; end of message

;===================================================================================================
; Cucco easter egg
;===================================================================================================
; ケココあら!な,なんなの⋯。
; 人の姿になっちゃって,ことば
; まで,話せちゃうじゃないの!
; あなたでしょ よく私のなかま
; いじめてるの。 カザミドリが
; ちゃんと見てるわよ。 けれど
; 人間の姿も ケッコウふべんね
; あ〜あ トリにもどりたいわ!
; ケコッコ⋯
;===================================================================================================
Message_017B:
|1CEF62| db $5B, $5C, $5C, $00, $38, $C7, $20, $C8 ; ケココあら!な,
|1CEF6A| db $20, $0F, $20, $24, $CC, $CD ; なんなの⋯。
|1CEF70| db $F8 ; row 2
|1CEF71| db $FD, $38 ; kanji 人
|1CEF73| db $24 ; の
|1CEF74| db $FD, $A2 ; kanji 姿
|1CEF76| db $21, $20, $4A, $19, $47, $4A, $1B, $C8 ; になっちゃって,
|1CEF7E| db $0C, $1C, $3D ; ことば
|1CEF81| db $F9 ; row 3
|1CEF82| db $30, $36, $C8 ; まで,
|1CEF85| db $FD, $A3 ; kanji 話
|1CEF87| db $13, $19, $47, $02, $25, $47, $20, $01 ; せちゃうじゃない
|1CEF8F| db $24, $C7 ; の!
|1CEF91| db $FA ; wait for key
|1CEF92| db $F6 ; scroll
|1CEF93| db $00, $20, $18, $36, $11, $49, $FF, $07 ; あなたでしょ␣よ
|1CEF9B| db $0A ; く
|1CEF9C| db $FD, $26 ; kanji 私
|1CEF9E| db $24, $20, $08, $30 ; のなかま
|1CEFA2| db $F6 ; scroll
|1CEFA3| db $01, $25, $33, $1B, $3A, $24, $CD, $FF ; いじめてるの。␣
|1CEFAB| db $58, $6F, $81, $87, $89, $15 ; カザミドリが
|1CEFB1| db $F6 ; scroll
|1CEFB2| db $19, $47, $0F, $1C ; ちゃんと
|1CEFB6| db $FD, $4C ; kanji 見
|1CEFB8| db $1B, $3A, $0D, $07, $CD, $FF, $0B, $3B ; てるわよ。␣けれ
|1CEFC0| db $37 ; ど
|1CEFC1| db $FA ; wait for key
|1CEFC2| db $F6 ; scroll
|1CEFC3| db $FD, $38 ; kanji 人
|1CEFC5| db $FD, $39 ; kanji 間
|1CEFC7| db $24 ; の
|1CEFC8| db $FD, $A2 ; kanji 姿
|1CEFCA| db $34, $FF, $5B, $9A, $5C, $52, $2A, $40 ; も␣ケッコウふべ
|1CEFD2| db $0F, $23 ; んね
|1CEFD4| db $F6 ; scroll
|1CEFD5| db $00, $CE, $00, $FF, $6C, $89, $21, $34 ; あ〜あ␣トリにも
|1CEFDD| db $37, $39, $18, $01, $0D, $C7 ; どりたいわ!
|1CEFE3| db $F6 ; scroll
|1CEFE4| db $5B, $5C, $9A, $5C, $CC ; ケコッコ⋯
|1CEFE9| db $FB ; end of message

;===================================================================================================
; Low stakes chest game offer
;===================================================================================================
; かけたルピーがふえるかへるか
; 20ルピーで1ぱつしょうぶだ
; あんた,やってみないかい?
; さあ,どうする?
; ▶ しょうぶする
;   逃げだす
;===================================================================================================
Message_017C:
|1CEFEA| db $08, $0B, $18, $8A, $93, $C9, $15, $2A ; かけたルピーがふ
|1CEFF2| db $03, $3A, $08, $2B, $3A, $08 ; えるかへるか
|1CEFF8| db $F8 ; row 2
|1CEFF9| db $A2, $A0, $8A, $93, $C9, $36, $A1, $42 ; 20ルピーで1ぱ
|1CF001| db $1A, $11, $49, $02, $3F, $2E ; つしょうぶだ
|1CF007| db $F9 ; row 3
|1CF008| db $00, $0F, $18, $C8, $05, $4A, $1B, $31 ; あんた,やってみ
|1CF010| db $20, $01, $08, $01, $C6 ; ないかい?
|1CF015| db $FA ; wait for key
|1CF016| db $F6 ; scroll
|1CF017| db $10, $00, $C8, $37, $02, $12, $3A, $C6 ; さあ,どうする?
|1CF01F| db $F6 ; scroll
|1CF020| db $FF, $FF, $E4, $FF, $FF, $11, $49, $02 ; ␣␣▶␣␣しょう
|1CF028| db $3F, $12, $3A ; ぶする
|1CF02B| db $F6 ; scroll
|1CF02C| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CF031| db $FD, $DD ; kanji 逃
|1CF033| db $1D, $2E, $12 ; げだす
|1CF036| db $FE, $68 ; choose 2 low
|1CF038| db $FB ; end of message

;===================================================================================================
; Open a chest!
;===================================================================================================
; よしっ!好きな宝箱を
; 開けてくれっ!
;===================================================================================================
Message_017D:
|1CF039| db $07, $11, $4A, $C7 ; よしっ!
|1CF03D| db $FD, $6D ; kanji 好
|1CF03F| db $09, $20 ; きな
|1CF041| db $FD, $9A ; kanji 宝
|1CF043| db $FD, $EA ; kanji 箱
|1CF045| db $0E ; を
|1CF046| db $F8 ; row 2
|1CF047| db $FD, $4B ; kanji 開
|1CF049| db $0B, $1B, $0A, $3B, $4A, $C7 ; けてくれっ!
|1CF04F| db $FB ; end of message

;===================================================================================================
; Chest game rejected
;===================================================================================================
; そうかい⋯。残念だな。
; また,ルピーをためて
; よってくれよな。
;===================================================================================================
Message_017E:
|1CF050| db $14, $02, $08, $01, $CC, $CD ; そうかい⋯。
|1CF056| db $FD, $C6 ; kanji 残
|1CF058| db $FD, $B2 ; kanji 念
|1CF05A| db $2E, $20, $CD ; だな。
|1CF05D| db $F8 ; row 2
|1CF05E| db $30, $18, $C8, $8A, $93, $C9, $0E, $18 ; また,ルピーをた
|1CF066| db $33, $1B ; めて
|1CF068| db $F9 ; row 3
|1CF069| db $07, $4A, $1B, $0A, $3B, $07, $20, $CD ; よってくれよな。
|1CF071| db $FB ; end of message

;===================================================================================================
; High stakes chest game offer
;===================================================================================================
; かけたルピーがふえるかへるか
; 100ルピーで1ぱつしょうぶ
; あんた,やってみないかい?
; さあ,どうする?
; ▶ しょうぶする
;   逃げだす
;===================================================================================================
Message_017F:
|1CF072| db $08, $0B, $18, $8A, $93, $C9, $15, $2A ; かけたルピーがふ
|1CF07A| db $03, $3A, $08, $2B, $3A, $08 ; えるかへるか
|1CF080| db $F8 ; row 2
|1CF081| db $A1, $A0, $A0, $8A, $93, $C9, $36, $A1 ; 100ルピーで1
|1CF089| db $42, $1A, $11, $49, $02, $3F ; ぱつしょうぶ
|1CF08F| db $F9 ; row 3
|1CF090| db $00, $0F, $18, $C8, $05, $4A, $1B, $31 ; あんた,やってみ
|1CF098| db $20, $01, $08, $01, $C6 ; ないかい?
|1CF09D| db $FA ; wait for key
|1CF09E| db $F6 ; scroll
|1CF09F| db $10, $00, $C8, $37, $02, $12, $3A, $C6 ; さあ,どうする?
|1CF0A7| db $F6 ; scroll
|1CF0A8| db $FF, $FF, $E4, $FF, $FF, $11, $49, $02 ; ␣␣▶␣␣しょう
|1CF0B0| db $3F, $12, $3A ; ぶする
|1CF0B3| db $F6 ; scroll
|1CF0B4| db $FF, $FF, $FF, $FF, $FF ; ␣␣␣␣␣
|1CF0B9| db $FD, $DD ; kanji 逃
|1CF0BB| db $1D, $2E, $12 ; げだす
|1CF0BE| db $FE, $68 ; choose 2 low
|1CF0C0| db $FB ; end of message

;===================================================================================================
; Innkeeper when no flippers
;===================================================================================================
; やあ,[LINK]。 わざわざ,
; 入りにくい家を訪ねてくれたね
; おれいに良い事教えてあげよう
; 川上の人目につかない所に,湖
; があって,そこにはゾーラが,
; うじゃうじゃしてるんだって。
; そのゾーラたちの宝と言うのが
; これがもう,XXXしい物らし
; いよ!でへへ,みてみたいよな
;===================================================================================================
Message_0180:
|1CF0C1| db $05, $00, $C8 ; やあ,
|1CF0C4| db $FE, $6A ; write player name
|1CF0C6| db $CD, $FF, $0D, $1F, $0D, $1F, $C8 ; 。␣わざわざ,
|1CF0CD| db $F8 ; row 2
|1CF0CE| db $FD, $49 ; kanji 入
|1CF0D0| db $39, $21, $0A, $01 ; りにくい
|1CF0D4| db $FD, $56 ; kanji 家
|1CF0D6| db $0E ; を
|1CF0D7| db $FD, $07 ; kanji 訪
|1CF0D9| db $23, $1B, $0A, $3B, $18, $23 ; ねてくれたね
|1CF0DF| db $F9 ; row 3
|1CF0E0| db $04, $3B, $01, $21 ; おれいに
|1CF0E4| db $FD, $32 ; kanji 良
|1CF0E6| db $01 ; い
|1CF0E7| db $FD, $22 ; kanji 事
|1CF0E9| db $FD, $03 ; kanji 教
|1CF0EB| db $03, $1B, $00, $1D, $07, $02 ; えてあげよう
|1CF0F1| db $FA ; wait for key
|1CF0F2| db $F6 ; scroll
|1CF0F3| db $FD, $B8 ; kanji 川
|1CF0F5| db $FD, $72 ; kanji 上
|1CF0F7| db $24 ; の
|1CF0F8| db $FD, $38 ; kanji 人
|1CF0FA| db $FD, $75 ; kanji 目
|1CF0FC| db $21, $1A, $08, $20, $01 ; につかない
|1CF101| db $FD, $55 ; kanji 所
|1CF103| db $21, $C8 ; に,
|1CF105| db $FD, $12 ; kanji 湖
|1CF107| db $F6 ; scroll
|1CF108| db $15, $00, $4A, $1B, $C8, $14, $0C, $21 ; があって,そこに
|1CF110| db $28, $7D, $C9, $88, $15, $C8 ; はゾーラが,
|1CF116| db $F6 ; scroll
|1CF117| db $02, $25, $47, $02, $25, $47, $11, $1B ; うじゃうじゃして
|1CF11F| db $3A, $0F, $2E, $4A, $1B, $CD ; るんだって。
|1CF125| db $FA ; wait for key
|1CF126| db $F6 ; scroll
|1CF127| db $14, $24, $7D, $C9, $88, $18, $19, $24 ; そのゾーラたちの
|1CF12F| db $FD, $9A ; kanji 宝
|1CF131| db $1C ; と
|1CF132| db $FD, $16 ; kanji 言
|1CF134| db $02, $24, $15 ; うのが
|1CF137| db $F6 ; scroll
|1CF138| db $0C, $3B, $15, $34, $02, $C8, $C1, $C1 ; これがもう,XX
|1CF140| db $C1, $11, $01 ; Xしい
|1CF143| db $FD, $51 ; kanji 物
|1CF145| db $38, $11 ; らし
|1CF147| db $F6 ; scroll
|1CF148| db $01, $07, $C7, $36, $2B, $2B, $C8, $31 ; いよ!でへへ,み
|1CF150| db $1B, $31, $18, $01, $07, $20 ; てみたいよな
|1CF156| db $FB ; end of message

;===================================================================================================
; Innkeeper when flippers are had
;===================================================================================================
; わざわざ入りにくい家を訪ねて
; くれたね。おれいのことばを
; おくります。 アリガトウ!
; ところで,昔この村にオカリナ
; で,どうぶつ達と話ができる
; 子どもがいてねェ。
; トリを使って国中をかけまわっ
; ていたよ。きっと,そのオカリ
; ナにはふしぎな力があったのさ
;===================================================================================================
Message_0181:
|1CF157| db $0D, $1F, $0D, $1F ; わざわざ
|1CF15B| db $FD, $49 ; kanji 入
|1CF15D| db $39, $21, $0A, $01 ; りにくい
|1CF161| db $FD, $56 ; kanji 家
|1CF163| db $0E ; を
|1CF164| db $FD, $07 ; kanji 訪
|1CF166| db $23, $1B ; ねて
|1CF168| db $F8 ; row 2
|1CF169| db $0A, $3B, $18, $23, $CD, $04, $3B, $01 ; くれたね。おれい
|1CF171| db $24, $0C, $1C, $3D, $0E ; のことばを
|1CF176| db $F9 ; row 3
|1CF177| db $04, $0A, $39, $30, $12, $CD, $FF, $50 ; おくります。␣ア
|1CF17F| db $89, $65, $6C, $52, $C7 ; リガトウ!
|1CF184| db $FA ; wait for key
|1CF185| db $F6 ; scroll
|1CF186| db $1C, $0C, $3C, $36, $C8 ; ところで,
|1CF18B| db $FD, $7E ; kanji 昔
|1CF18D| db $0C, $24 ; この
|1CF18F| db $FD, $8C ; kanji 村
|1CF191| db $21, $54, $58, $89, $70 ; にオカリナ
|1CF196| db $F6 ; scroll
|1CF197| db $36, $C8, $37, $02, $3F, $1A ; で,どうぶつ
|1CF19D| db $FD, $13 ; kanji 達
|1CF19F| db $1C ; と
|1CF1A0| db $FD, $A3 ; kanji 話
|1CF1A2| db $15, $36, $09, $3A ; ができる
|1CF1A6| db $F6 ; scroll
|1CF1A7| db $FD, $11 ; kanji 子
|1CF1A9| db $37, $34, $15, $01, $1B, $23, $9E, $CD ; どもがいてねェ。
|1CF1B1| db $FA ; wait for key
|1CF1B2| db $F6 ; scroll
|1CF1B3| db $6C, $89, $0E ; トリを
|1CF1B6| db $FD, $89 ; kanji 使
|1CF1B8| db $4A, $1B ; って
|1CF1BA| db $FD, $2B ; kanji 国
|1CF1BC| db $FD, $AE ; kanji 中
|1CF1BE| db $0E, $08, $0B, $30, $0D, $4A ; をかけまわっ
|1CF1C4| db $F6 ; scroll
|1CF1C5| db $1B, $01, $18, $07, $CD, $09, $4A, $1C ; ていたよ。きっと
|1CF1CD| db $C8, $14, $24, $54, $58, $89 ; ,そのオカリ
|1CF1D3| db $F6 ; scroll
|1CF1D4| db $70, $21, $28, $2A, $11, $16, $20 ; ナにはふしぎな
|1CF1DB| db $FD, $99 ; kanji 力
|1CF1DD| db $15, $00, $4A, $18, $24, $10 ; があったのさ
|1CF1E3| db $FB ; end of message

;===================================================================================================
; 2 spawn points
;===================================================================================================
; ▶[LINK]の家からスタート
;   教会からスタート
;===================================================================================================
Message_0182:
|1CF1E4| db $FE, $6D, $00 ; position: high
|1CF1E7| db $FC, $00 ; text speed: 0
|1CF1E9| db $E4 ; ▶
|1CF1EA| db $FE, $6A ; write player name
|1CF1EC| db $24 ; の
|1CF1ED| db $FD, $56 ; kanji 家
|1CF1EF| db $08, $38, $62, $68, $C9, $6C ; からスタート
|1CF1F5| db $F8 ; row 2
|1CF1F6| db $FF ; ␣
|1CF1F7| db $FD, $03 ; kanji 教
|1CF1F9| db $FD, $04 ; kanji 会
|1CF1FB| db $08, $38, $62, $68, $C9, $6C ; からスタート
|1CF201| db $FE, $72 ; choose 2 high
|1CF203| db $FB ; end of message

;===================================================================================================
; 3 spawn points
;===================================================================================================
; ▶[LINK]の家からスタート
;   教会からスタート
;   山の洞くつからスタート
;===================================================================================================
Message_0183:
|1CF204| db $FE, $6D, $00 ; position: high
|1CF207| db $FC, $00 ; text speed: 0
|1CF209| db $E4 ; ▶
|1CF20A| db $FE, $6A ; write player name
|1CF20C| db $24 ; の
|1CF20D| db $FD, $56 ; kanji 家
|1CF20F| db $08, $38, $62, $68, $C9, $6C ; からスタート
|1CF215| db $F8 ; row 2
|1CF216| db $FF ; ␣
|1CF217| db $FD, $03 ; kanji 教
|1CF219| db $FD, $04 ; kanji 会
|1CF21B| db $08, $38, $62, $68, $C9, $6C ; からスタート
|1CF221| db $F9 ; row 3
|1CF222| db $FF ; ␣
|1CF223| db $FD, $94 ; kanji 山
|1CF225| db $24 ; の
|1CF226| db $FD, $EF ; kanji 洞
|1CF228| db $0A, $1A, $08, $38, $62, $68, $C9, $6C ; くつからスタート
|1CF230| db $FE, $71 ; choose 3
|1CF232| db $FB ; end of message

;===================================================================================================
; Save and Quit
;===================================================================================================
; ▶ 続けてゲームする
;   セーブしておわる
;===================================================================================================
Message_0184:
|1CF233| db $FC, $00 ; text speed: 0
|1CF235| db $E4, $FF ; ▶␣
|1CF237| db $FD, $82 ; kanji 続
|1CF239| db $0B, $1B, $6D, $C9, $82, $12, $3A ; けてゲームする
|1CF240| db $F8 ; row 2
|1CF241| db $FF, $FF, $63, $C9, $8F, $11, $1B, $04 ; ␣␣セーブしてお
|1CF249| db $0D, $3A ; わる
|1CF24B| db $FE, $72 ; choose 2 high
|1CF24D| db $FB ; end of message

;===================================================================================================
; Digging game offer
;===================================================================================================
; さあ,穴ほり屋だよ。
; 30びょう間,ほりほうだい。
; でてきたお宝あんたの物!
; 80ルピーでさあどうだ?
; ▶ ほりたい
;   ほりたくない
;===================================================================================================
Message_0185:
|1CF24E| db $10, $00, $C8 ; さあ,
|1CF251| db $FD, $5C ; kanji 穴
|1CF253| db $2C, $39 ; ほり
|1CF255| db $FD, $3D ; kanji 屋
|1CF257| db $2E, $07, $CD ; だよ。
|1CF25A| db $F8 ; row 2
|1CF25B| db $A3, $A0, $3E, $49, $02 ; 30びょう
|1CF260| db $FD, $39 ; kanji 間
|1CF262| db $C8, $2C, $39, $2C, $02, $2E, $01, $CD ; ,ほりほうだい。
|1CF26A| db $F9 ; row 3
|1CF26B| db $36, $1B, $09, $18, $04 ; でてきたお
|1CF270| db $FD, $9A ; kanji 宝
|1CF272| db $00, $0F, $18, $24 ; あんたの
|1CF276| db $FD, $51 ; kanji 物
|1CF278| db $C7 ; !
|1CF279| db $FA ; wait for key
|1CF27A| db $F6 ; scroll
|1CF27B| db $A8, $A0, $8A, $93, $C9, $36, $10, $00 ; 80ルピーでさあ
|1CF283| db $37, $02, $2E, $C6 ; どうだ?
|1CF287| db $F6 ; scroll
|1CF288| db $FF, $FF, $E4, $FF, $2C, $39, $18, $01 ; ␣␣▶␣ほりたい
|1CF290| db $F6 ; scroll
|1CF291| db $FF, $FF, $FF, $FF, $2C, $39, $18, $0A ; ␣␣␣␣ほりたく
|1CF299| db $20, $01 ; ない
|1CF29B| db $FE, $68 ; choose 2 low
|1CF29D| db $FB ; end of message

;===================================================================================================
; Digging game start
;===================================================================================================
; それではシャベルをかしましょ
; う。 おててにもったら,
; Yボタンで,さあ,ほって!
;===================================================================================================
Message_0186:
|1CF29E| db $14, $3B, $36, $28, $61, $97, $90, $8A ; それではシャベル
|1CF2A6| db $0E, $08, $11, $30, $11, $49 ; をかしましょ
|1CF2AC| db $F8 ; row 2
|1CF2AD| db $02, $CD, $FF, $04, $1B, $1B, $21, $34 ; う。␣おててにも
|1CF2B5| db $4A, $18, $38, $C8 ; ったら,
|1CF2B9| db $F9 ; row 3
|1CF2BA| db $C2, $91, $68, $5F, $36, $C8, $10, $00 ; Yボタンで,さあ
|1CF2C2| db $C8, $2C, $4A, $1B, $C7 ; ,ほって!
|1CF2C7| db $FB ; end of message

;===================================================================================================
; Digging game says you are too poor
;===================================================================================================
; そうかい,それじゃあ,あきら
; めよう。 ルピーをためて
; また来てね。
;===================================================================================================
Message_0187:
|1CF2C8| db $14, $02, $08, $01, $C8, $14, $3B, $25 ; そうかい,それじ
|1CF2D0| db $47, $00, $C8, $00, $09, $38 ; ゃあ,あきら
|1CF2D6| db $F8 ; row 2
|1CF2D7| db $33, $07, $02, $CD, $FF, $8A, $93, $C9 ; めよう。␣ルピー
|1CF2DF| db $0E, $18, $33, $1B ; をためて
|1CF2E3| db $F9 ; row 3
|1CF2E4| db $30, $18 ; また
|1CF2E6| db $FD, $D6 ; kanji 来
|1CF2E8| db $1B, $23, $CD ; てね。
|1CF2EB| db $FB ; end of message

;===================================================================================================
; Digging game over
;===================================================================================================
; おっと時間だ,おしまいだ。
; また来てちょうだい,さような
; ら⋯。
;===================================================================================================
Message_0188:
|1CF2EC| db $04, $4A, $1C ; おっと
|1CF2EF| db $FD, $88 ; kanji 時
|1CF2F1| db $FD, $39 ; kanji 間
|1CF2F3| db $2E, $C8, $04, $11, $30, $01, $2E, $CD ; だ,おしまいだ。
|1CF2FB| db $F8 ; row 2
|1CF2FC| db $30, $18 ; また
|1CF2FE| db $FD, $D6 ; kanji 来
|1CF300| db $1B, $19, $49, $02, $2E, $01, $C8, $10 ; てちょうだい,さ
|1CF308| db $07, $02, $20 ; ような
|1CF30B| db $F9 ; row 3
|1CF30C| db $38, $CC, $CD ; ら⋯。
|1CF30F| db $FB ; end of message

;===================================================================================================
; Digging game try again some time
;===================================================================================================
; また,来てちょーだい
; まってるよ〜ん。
;===================================================================================================
Message_0189:
|1CF310| db $30, $18, $C8 ; また,
|1CF313| db $FD, $D6 ; kanji 来
|1CF315| db $1B, $19, $49, $C9, $2E, $01 ; てちょーだい
|1CF31B| db $F8 ; row 2
|1CF31C| db $30, $4A, $1B, $3A, $07, $CE, $0F, $CD ; まってるよ〜ん。
|1CF324| db $FB ; end of message

;===================================================================================================
; Digging game no pets allowed
;===================================================================================================
; くわしい事は,言えないが,
; 今は,ちょっと つごうが悪い
; また来てちょーだい。ゴメンネ
;===================================================================================================
Message_018A:
|1CF325| db $0A, $0D, $11, $01 ; くわしい
|1CF329| db $FD, $22 ; kanji 事
|1CF32B| db $28, $C8 ; は,
|1CF32D| db $FD, $16 ; kanji 言
|1CF32F| db $03, $20, $01, $15, $C8 ; えないが,
|1CF334| db $F8 ; row 2
|1CF335| db $FD, $6A ; kanji 今
|1CF337| db $28, $C8, $19, $49, $4A, $1C, $FF, $1A ; は,ちょっと␣つ
|1CF33F| db $1E, $02, $15 ; ごうが
|1CF342| db $FD, $85 ; kanji 悪
|1CF344| db $01 ; い
|1CF345| db $F9 ; row 3
|1CF346| db $30, $18 ; また
|1CF348| db $FD, $D6 ; kanji 来
|1CF34A| db $1B, $19, $49, $C9, $2E, $01, $CD, $6E ; てちょーだい。ゴ
|1CF352| db $83, $5F, $73 ; メンネ
|1CF355| db $FB ; end of message

;===================================================================================================

MessageDataEnd:

;===================================================================================================

TextCommandLengths:
|1CF356| db 1, 1, 1, 1
|1CF35A| db 1, 1, 1, 2
|1CF35E| db 2, 2, 1

; $00 = no parameter
; $FF = has parameter
ExtendedTextCommandLengths:
|1CF361| db $00, $00, $00, $00
|1CF365| db $FF, $FF, $FF, $FF
|1CF369| db $00, $00, $00, $00
|1CF36D| db $00, $00, $00, $00
|1CF371| db $FF, $FF, $FF, $FF
|1CF375| db $00, $00, $00, $00
|1CF379| db $00

;===================================================================================================

CreateMessagePointers:
|1CF37A| PHB
|1CF37B| PHK
|1CF37C| PLB

|1CF37D| REP #$30

|1CF37F| LDA.w #Message_Data ; offset into ROM
|1CF382| STA.l $7F71C0

|1CF386| STA.b $00

|1CF388| STZ.b $02

.next_byte
|1CF38A| LDX.b $00

|1CF38C| LDA.l ^&Message_Data,X
|1CF390| AND.w #$00FF
|1CF393| CMP.w #$00F6 ; scroll
|1CF396| BCS .is_command

|1CF398| LDA.w #$00F5 ; use this value to get a length of 1

.is_command
|1CF39B| TAY
|1CF39C| LDA.w TextCommandLengths-$F5,Y

|1CF39F| AND.w #$00FF ; add in the offset
|1CF3A2| CLC
|1CF3A3| ADC.b $00
|1CF3A5| STA.b $00

|1CF3A7| CPY.w #$00FE
|1CF3AA| BNE .not_extended_command

|1CF3AC| LDA.l ^&Message_Data+1,X
|1CF3B0| AND.w #$00FF
|1CF3B3| TAY

|1CF3B4| LDA.w ExtendedTextCommandLengths-$68,Y ; $FF = extra param
|1CF3B7| BPL .not_extended_command

|1CF3B9| INC.b $00

.not_extended_command
|1CF3BB| CPY.w #$00FB ; end of message

|1CF3BE| BNE .next_byte ; keep counting if not the end yet

|1CF3C0| LDX.b $02 ; next message pointer offset
|1CF3C2| INX
|1CF3C3| INX
|1CF3C4| STX.b $02

|1CF3C6| LDA.b $00 ; get ROM offset of message data
|1CF3C8| STA.l $7F71C0,X

|1CF3CC| CMP.w #MessageDataEnd ; [HARDCODED] terminator
|1CF3CF| BNE .next_byte

|1CF3D1| SEP #$30

|1CF3D3| PLB

|1CF3D4| RTL

;===================================================================================================
; FREE ROM: 0x12B
;===================================================================================================
NULL_1CF3D5:
|1CF3D5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF3DD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF3E5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF3ED| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF3F5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF3FD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF405| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF40D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF415| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF41D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF425| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF42D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF435| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF43D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF445| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF44D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF455| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF45D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF465| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF46D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF475| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF47D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF485| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF48D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF495| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF49D| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4A5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4AD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4B5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4BD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4C5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4CD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4D5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4DD| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4E5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4ED| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4F5| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CF4FD| db $FF, $FF, $FF

;===================================================================================================
; Cancels the hookshot and puts Link back to the start of the frame.
;===================================================================================================
AbortMovement:
|1CF500| PHB
|1CF501| PHK
|1CF502| PLB

|1CF503| PHX

|1CF504| LDX.b #$04

; check each ancilla slot for a hookshot
.next_ancilla
|1CF506| LDA.w $0C4A,X
|1CF509| CMP.b #$1F ; ANCILLA 1F
|1CF50B| BNE .not_hooker

.yes_hooker
|1CF50D| LDA.w $037E
|1CF510| BEQ .not_hooker

.active_hooker
|1CF512| STZ.w $037E
|1CF515| BRA .stop_hooking

.not_hooker
|1CF517| DEX
|1CF518| BPL .next_ancilla

;---------------------------------------------------------------------------------------------------

.stop_hooking
|1CF51A| LDA.b $23 ; cache link's coordinates
|1CF51C| STA.b $41

|1CF51E| LDA.b $21
|1CF520| STA.b $40

|1CF522| REP #$20

|1CF524| LDA.w $0FC2
|1CF527| STA.b $22

|1CF529| LDA.w $0FC4
|1CF52C| STA.b $20

|1CF52E| SEP #$20

|1CF530| JSL HandleIndoorCameraAndDoors_long

|1CF534| PLX

|1CF535| PLB

|1CF536| RTL

;===================================================================================================
; Comes in with Y, a quota for maximum number of this ancilla
;===================================================================================================
FindAncillaSlot:
|1CF537| STY.b $0F

|1CF539| INY
|1CF53A| STY.b $0E

|1CF53C| LDY.b #$00
|1CF53E| LDX.b #$04

; tally each matching ancilla in the first 4 slots
.tallyoop
|1CF540| CMP.w $0C4A,X
|1CF543| BNE .not_the_same

|1CF545| INY

.not_the_same
|1CF546| DEX
|1CF547| BPL .tallyoop

; I guess, theoretically, the quota shouldn't be surpassable
; but if you somehow do it, this will not function as intended
|1CF549| CPY.b $0E
|1CF54B| BEQ .too_many_here

|1CF54D| LDY.b #$01 ; [HARDCODED] check for bomb or debris, limited to 2 slots
|1CF54F| CMP.b #$07 ; ANCILLA 07
|1CF551| BEQ .find_empty_slot

|1CF553| CMP.b #$08 ; ANCILLA 08
|1CF555| BEQ .find_empty_slot

|1CF557| LDY.b #$04 ; all other ancillae are designed to use any of the first 5

.find_empty_slot
|1CF559| LDA.w $0C4A,Y
|1CF55C| BEQ .slot_available

|1CF55E| DEY
|1CF55F| BPL .find_empty_slot

; otherwise, find an unimportant ancilla to replace
; here's the famous dumb code that allows for misslotting
; why search slots in this manner instead of just searching the same 5
; (or 2 in the case of bombs)
; the more you think about it, the less it makes sense
; this game's most broken class of glitches was pretty easily preventable
.check_next_replacement
|1CF561| DEC.w $03C4
|1CF564| BPL .continue_with_index

; use the quota as the index to search from
; this decision also makes 0 sense
; Why not 4...?
|1CF566| LDA.b $0F
|1CF568| STA.w $03C4

.continue_with_index
|1CF56B| LDY.w $03C4

|1CF56E| LDA.w $0C4A,Y
|1CF571| CMP.b #$3C ; ANCILLA 3C
|1CF573| BEQ .slot_available

|1CF575| CMP.b #$13 ; ANCILLA 13
|1CF577| BEQ .slot_available

|1CF579| CMP.b #$0A ; ANCILLA 0A
|1CF57B| BEQ .slot_available

|1CF57D| DEY
|1CF57E| BPL .check_next_replacement

.slot_available
|1CF580| RTL

;---------------------------------------------------------------------------------------------------

.too_many_here
|1CF581| TXY

|1CF582| RTL

;===================================================================================================

pool SpinAndDie

.anim_step
|1CF583| db $00, $01, $02, $03, $00, $01, $02, $03
|1CF58B| db $00, $01, $02, $03, $04, $05, $05

.timer
|1CF592| db   5,   5,   5,   5,   5,   5,   5,   5
|1CF59A| db   5,   5,   5,   5,   3,   3,  98

.prop
|1CF5A1| db $20, $10

endpool

;---------------------------------------------------------------------------------------------------

SpinAndDie:
|1CF5A3| PHB
|1CF5A4| PHK
|1CF5A5| PLB

|1CF5A6| DEC.w $030B
|1CF5A9| BPL .timer_running

|1CF5AB| LDX.w $030D
|1CF5AE| INX
|1CF5AF| CPX.b #$0F
|1CF5B1| BEQ EXIT_1CF60D

|1CF5B3| CPX.b #$0E
|1CF5B5| BNE .swooning

|1CF5B7| INC.b $11

.swooning
|1CF5B9| STX.w $030D

|1CF5BC| LDA.w .anim_step,X
|1CF5BF| STA.w $030A

|1CF5C2| LDA.w .timer,X
|1CF5C5| STA.w $030B

.timer_running
|1CF5C8| LDA.w $030D
|1CF5CB| CMP.b #$0D
|1CF5CD| BNE EXIT_1CF60D

|1CF5CF| LDA.b $4B
|1CF5D1| CMP.b #$0C
|1CF5D3| BEQ EXIT_1CF60D

|1CF5D5| REP #$20

|1CF5D7| LDA.b $20
|1CF5D9| CLC
|1CF5DA| ADC.w #$0010
|1CF5DD| SEC
|1CF5DE| SBC.b $E8
|1CF5E0| STA.b $00

|1CF5E2| LDA.b $22
|1CF5E4| CLC
|1CF5E5| ADC.w #$0007
|1CF5E8| SEC
|1CF5E9| SBC.b $E2
|1CF5EB| STA.b $02

;---------------------------------------------------------------------------------------------------

|1CF5ED| SEP #$20

|1CF5EF| LDY.b $EE

|1CF5F1| LDA.b $02
|1CF5F3| STA.w $09D0

|1CF5F6| LDA.b $00
|1CF5F8| STA.w $09D1

|1CF5FB| LDA.b #$AA
|1CF5FD| STA.w $09D2

|1CF600| LDA.w .prop,Y

|1CF603| ORA.b #$02
|1CF605| STA.w $09D3

|1CF608| LDA.b #$02
|1CF60A| STA.w $0A94

;---------------------------------------------------------------------------------------------------

#EXIT_1CF60D:
|1CF60D| PLB

|1CF60E| RTL

;===================================================================================================

pool AncillaAdd_SwordBeam

.initial_angles
|1CF60F| db $21, $1D, $19, $15
|1CF613| db $03, $3E, $3A, $36
|1CF617| db $12, $0E, $0A, $06
|1CF61B| db $31, $2D, $29, $25

.speed_y
|1CF61F| db -64,  64,   0,   0

.speed_x
|1CF623| db   0,   0, -64,  64

.speed_angular
|1CF627| db  -8,  -8,  -8,   8

.offset_y_low
|1CF62B| db -24,   8,  -6,  -6

.offset_y_high
|1CF62F| db  -1,   0,  -1,  -1

.offset_x_low
|1CF633| db  -8, -10, -22,   4

.offset_x_high
|1CF637| db  -1,  -1,  -1,   0

endpool

;---------------------------------------------------------------------------------------------------

AncillaAdd_SwordBeam:
|1CF63B| PHB
|1CF63C| PHK
|1CF63D| PLB

|1CF63E| LDA.b #$0C ; ANCILLA 0C
|1CF640| JSL AddAncilla_bank09
|1CF644| BCS EXIT_1CF60D

|1CF646| LDA.b $2F
|1CF648| ASL A
|1CF649| TAY

|1CF64A| LDA.w .initial_angles+0,Y
|1CF64D| STA.l $7F5800

|1CF651| LDA.w .initial_angles+1,Y
|1CF654| STA.l $7F5801

|1CF658| LDA.w .initial_angles+2,Y
|1CF65B| STA.l $7F5802

|1CF65F| LDA.w .initial_angles+3,Y
|1CF662| STA.l $7F5803
|1CF666| STA.l $7F5804

|1CF66A| LDA.b #$02
|1CF66C| STA.w $03B1,X

|1CF66F| LDA.b #$4C
|1CF671| STA.w $0C5E,X

|1CF674| LDA.b #$08
|1CF676| STA.w $039F,X

|1CF679| STZ.w $0C54,X
|1CF67C| STZ.w $0385,X
|1CF67F| STZ.w $0394,X

|1CF682| LDA.b #$00
|1CF684| STA.w $03A4,X

|1CF687| LDA.b #$0E
|1CF689| STA.l $7F5808

|1CF68D| LDA.b $2F
|1CF68F| LSR A
|1CF690| STA.w $0C72,X

|1CF693| TAY

|1CF694| LDA.w .speed_y,Y
|1CF697| STA.w $0C22,X

|1CF69A| LDA.w .speed_x,Y
|1CF69D| STA.w $0C2C,X

|1CF6A0| LDA.w .speed_angular,Y
|1CF6A3| STA.w $03A9,X

|1CF6A6| REP #$20

|1CF6A8| LDA.b $20
|1CF6AA| CLC
|1CF6AB| ADC.w #$000C
|1CF6AE| STA.l $7F5810

|1CF6B2| LDA.b $22
|1CF6B4| CLC
|1CF6B5| ADC.w #$0008
|1CF6B8| STA.l $7F580E

|1CF6BC| SEP #$20

|1CF6BE| JSL Ancilla_CheckInitialTile_A
|1CF6C2| BCS .continue

|1CF6C4| PLB

|1CF6C5| RTL

;---------------------------------------------------------------------------------------------------

.continue
|1CF6C6| LDY.w $0C72,X

|1CF6C9| LDA.l $7F5810
|1CF6CD| CLC
|1CF6CE| ADC.w .offset_y_low,Y
|1CF6D1| STA.w $0BFA,X

|1CF6D4| LDA.l $7F5811
|1CF6D8| ADC.w .offset_y_high,Y
|1CF6DB| STA.w $0C0E,X

|1CF6DE| LDA.l $7F580E
|1CF6E2| CLC
|1CF6E3| ADC.w .offset_x_low,Y
|1CF6E6| STA.w $0C04,X

|1CF6E9| LDA.l $7F580F
|1CF6ED| ADC.w .offset_x_high,Y
|1CF6F0| STA.w $0C18,X

|1CF6F3| JSL CalculateAncillaSFXPan
|1CF6F7| ORA.b #$01 ; SFX3.01
|1CF6F9| STA.w $012F

|1CF6FC| LDA.b #$04 ; ANCILLA 04
|1CF6FE| STA.w $0C4A,X

|1CF701| LDA.b #$07
|1CF703| STA.w $0C68,X

|1CF706| LDA.b #$10
|1CF708| STA.w $0C90,X

|1CF70B| PLB

|1CF70C| RTL

;===================================================================================================

pool Ancilla0C_SwordBeam

.char
|1CF70D| db $D7, $B7, $80, $83

.extra_char
|1CF711| db $B7, $80, $83

.offset_y_low
|1CF714| db   0,   0,  -6,  -6

.offset_y_high
|1CF718| db   0,   0,  -1,  -1

.offset_x_low
|1CF71C| db  -8, -10,   0,   0

.offset_x_high
|1CF720| db  -1,  -1,   0,   0

endpool

;---------------------------------------------------------------------------------------------------

Ancilla0C_SwordBeam:
|1CF724| PHB
|1CF725| PHK
|1CF726| PLB

|1CF727| PHX

|1CF728| LDA.b #$02
|1CF72A| STA.b $73

|1CF72C| LDA.b $11
|1CF72E| BEQ .do_beam_stuff

|1CF730| BRL .draw

;---------------------------------------------------------------------------------------------------

.do_beam_stuff
|1CF733| LDA.l $7F5810
|1CF737| STA.w $0BFA,X

|1CF73A| LDA.l $7F5811
|1CF73E| STA.w $0C0E,X

|1CF741| LDA.l $7F580E
|1CF745| STA.w $0C04,X

|1CF748| LDA.l $7F580F
|1CF74C| STA.w $0C18,X

|1CF74F| JSR SwordBeam_Move_Y
|1CF752| JSR SwordBeam_Move_X

|1CF755| LDA.w $0BFA,X
|1CF758| STA.l $7F5810

|1CF75C| LDA.w $0C0E,X
|1CF75F| STA.l $7F5811

|1CF763| LDA.w $0C04,X
|1CF766| STA.l $7F580E

|1CF76A| LDA.w $0C18,X
|1CF76D| STA.l $7F580F

|1CF771| LDA.w $0394,X
|1CF774| AND.b #$0F
|1CF776| BNE .no_sfx

|1CF778| JSL CalculateAncillaSFXPan
|1CF77C| ORA.b #$01 ; SFX3.01
|1CF77E| STA.w $012F

.no_sfx
|1CF781| INC.w $0394,X
|1CF784| JSL Ancilla_CheckSpriteCollision_long
|1CF788| BCS .hit_sprite

|1CF78A| JSL Ancilla_CheckTileCollision_long
|1CF78E| BCC .no_collision

.hit_sprite
|1CF790| LDY.w $0C72,X

|1CF793| LDA.w $0BFA,X
|1CF796| CLC
|1CF797| ADC.w .offset_y_low,Y
|1CF79A| STA.w $0BFA,X

|1CF79D| LDA.w $0C0E,X
|1CF7A0| ADC.w .offset_y_high,Y
|1CF7A3| STA.w $0C0E,X

|1CF7A6| LDA.w $0C04,X
|1CF7A9| CLC
|1CF7AA| ADC.w .offset_x_low,Y
|1CF7AD| STA.w $0C04,X

|1CF7B0| LDA.w $0C18,X
|1CF7B3| ADC.w .offset_x_high,Y
|1CF7B6| STA.w $0C18,X

|1CF7B9| LDA.b #$04 ; ANCILLA 04
|1CF7BB| STA.w $0C4A,X

|1CF7BE| LDA.b #$07
|1CF7C0| STA.w $0C68,X

|1CF7C3| LDA.b #$10
|1CF7C5| STA.w $0C90,X

|1CF7C8| BRL .exit

;---------------------------------------------------------------------------------------------------

.no_collision
|1CF7CB| DEC.w $03B1,X
|1CF7CE| BPL .draw

|1CF7D0| LDA.b #$04
|1CF7D2| STA.b $73

|1CF7D4| LDA.b #$02
|1CF7D6| STA.w $03B1,X

.draw
|1CF7D9| LDA.w $03A9,X
|1CF7DC| STA.b $76

|1CF7DE| LDY.b #$00
|1CF7E0| LDX.b #$03

;---------------------------------------------------------------------------------------------------

.next_object
|1CF7E2| STX.b $72

|1CF7E4| LDA.b $11
|1CF7E6| BNE .no_rotation

|1CF7E8| LDA.l $7F5800,X
|1CF7EC| CLC
|1CF7ED| ADC.b $76
|1CF7EF| AND.b #$3F
|1CF7F1| STA.l $7F5800,X

.no_rotation
|1CF7F5| PHX
|1CF7F6| PHY

|1CF7F7| LDA.l $7F5808
|1CF7FB| STA.b $08

|1CF7FD| LDA.l $7F5800,X
|1CF801| JSL Ancilla_GetRadialProjection_long
|1CF805| JSL Sparkle_PrepOAMFromRadial

|1CF809| PLY

|1CF80A| JSL Ancilla_SetOAM_XY_long

|1CF80E| LDX.b $72

|1CF810| LDA.w .char,X
|1CF813| STA.b ($90),Y

|1CF815| INY

|1CF816| LDA.b $73
|1CF818| ORA.b $65
|1CF81A| STA.b ($90),Y

|1CF81C| INY
|1CF81D| PHY

|1CF81E| TYA
|1CF81F| SEC
|1CF820| SBC.b #$04

|1CF822| LSR A
|1CF823| LSR A
|1CF824| TAY

|1CF825| LDA.b #$00
|1CF827| STA.b ($92),Y

|1CF829| PLY

|1CF82A| PLX
|1CF82B| DEX
|1CF82C| BPL .next_object

;---------------------------------------------------------------------------------------------------

|1CF82E| PLX
|1CF82F| PHX

|1CF830| LDA.b $11
|1CF832| BNE .dont_rotate_extra

|1CF834| DEC.w $039F,X
|1CF837| BPL .skip_extra

|1CF839| LDA.b #$00
|1CF83B| STA.w $039F,X

|1CF83E| LDA.w $03A4,X
|1CF841| INC A
|1CF842| AND.b #$03
|1CF844| STA.w $03A4,X

|1CF847| CMP.b #$03
|1CF849| BNE .dont_rotate_extra

|1CF84B| LDA.l $7F5804
|1CF84F| CLC
|1CF850| ADC.b $76
|1CF852| AND.b #$3F
|1CF854| STA.l $7F5804

.dont_rotate_extra
|1CF858| LDA.w $03A4,X
|1CF85B| STA.b $72

|1CF85D| CMP.b #$03
|1CF85F| BEQ .skip_extra

|1CF861| PHY

|1CF862| LDA.l $7F5808
|1CF866| STA.b $08

|1CF868| LDA.l $7F5804
|1CF86C| JSL Ancilla_GetRadialProjection_long
|1CF870| JSL Sparkle_PrepOAMFromRadial

|1CF874| PLY

|1CF875| JSL Ancilla_SetOAM_XY_long

|1CF879| LDX.b $72

|1CF87B| LDA.w .extra_char,X
|1CF87E| STA.b ($90),Y

|1CF880| INY
|1CF881| LDA.b #$04
|1CF883| ORA.b $65
|1CF885| STA.b ($90),Y

|1CF887| INY
|1CF888| TYA
|1CF889| SEC
|1CF88A| SBC.b #$04

|1CF88C| LSR A
|1CF88D| LSR A
|1CF88E| TAY
|1CF88F| LDA.b #$00
|1CF891| STA.b ($92),Y

.skip_extra
|1CF893| PLX
|1CF894| PHX

;---------------------------------------------------------------------------------------------------

|1CF895| LDY.b #$01

.check_next
|1CF897| LDA.b ($90),Y
|1CF899| CMP.b #$F0
|1CF89B| BNE .exit

|1CF89D| INY ; +4
|1CF89E| INY
|1CF89F| INY
|1CF8A0| INY
|1CF8A1| CPY.b #$11
|1CF8A3| BNE .check_next

;---------------------------------------------------------------------------------------------------

|1CF8A5| STZ.w $0C4A,X

.exit
|1CF8A8| PLX
|1CF8A9| PLB

|1CF8AA| RTL

;===================================================================================================

pool Ancilla0D_SpinAttackFullChargeSpark_long

.offset_y_low
|1CF8AB| db  -8,  27,  12,  12

.offset_y_high
|1CF8AF| db  -1,   0,   0,   0

.offset_x_low
|1CF8B3| db   4,   4, -13,  20

.offset_x_high
|1CF8B7| db   0,   0,  -1,   0

.prop
|1CF8BB| db $20, $10, $30, $20

endpool

;---------------------------------------------------------------------------------------------------

Ancilla0D_SpinAttackFullChargeSpark_long:
|1CF8BF| PHB
|1CF8C0| PHK
|1CF8C1| PLB

|1CF8C2| LDA.w $0C68,X
|1CF8C5| BNE .stay

|1CF8C7| STZ.w $0C4A,X

|1CF8CA| BRA .exit

;---------------------------------------------------------------------------------------------------

.stay
|1CF8CC| LDA.b $2F
|1CF8CE| LSR A
|1CF8CF| TAY

|1CF8D0| LDA.b $20
|1CF8D2| CLC
|1CF8D3| ADC.w .offset_y_low,Y
|1CF8D6| STA.b $00

|1CF8D8| LDA.b $21
|1CF8DA| ADC.w .offset_y_high,Y
|1CF8DD| STA.b $01

|1CF8DF| LDA.b $22
|1CF8E1| CLC
|1CF8E2| ADC.w .offset_x_low,Y
|1CF8E5| STA.b $02

|1CF8E7| LDA.b $23
|1CF8E9| ADC.w .offset_x_high,Y
|1CF8EC| STA.b $03

|1CF8EE| REP #$20

|1CF8F0| LDA.b $00
|1CF8F2| SEC
|1CF8F3| SBC.b $E8
|1CF8F5| STA.b $00

|1CF8F7| LDA.b $02
|1CF8F9| SEC
|1CF8FA| SBC.b $E2
|1CF8FC| STA.b $02

|1CF8FE| SEP #$20

|1CF900| LDY.w $0C7C,X

|1CF903| LDA.w .prop,Y
|1CF906| STA.b $65
|1CF908| STZ.b $64

|1CF90A| LDY.b #$00
|1CF90C| JSL Ancilla_SetOAM_XY_long

|1CF910| LDA.b #$D7
|1CF912| STA.b ($90),Y

|1CF914| INY

|1CF915| LDA.b #$02
|1CF917| ORA.b $65
|1CF919| STA.b ($90),Y

|1CF91B| LDA.b #$00
|1CF91D| STA.b ($92)

.exit
|1CF91F| PLB

|1CF920| RTL

;===================================================================================================

pool AncillaSpawn_SwordChargeSparkle

.offset_y
|1CF921| dw   5,  12,   8,   8

.offset_x
|1CF929| dw   0,   3,   4,   5

.mask_y
|1CF931| db $00, $00, $07, $07

.mask_x
|1CF935| db $70, $70, $00, $00

endpool

;---------------------------------------------------------------------------------------------------

AncillaSpawn_SwordChargeSparkle:
|1CF939| PHB
|1CF93A| PHK
|1CF93B| PLB

|1CF93C| LDX.b #$09

.next_slot
|1CF93E| LDA.w $0C4A,X
|1CF941| BEQ .free_slot

|1CF943| DEX
|1CF944| BPL .next_slot

|1CF946| BRL .exit

;---------------------------------------------------------------------------------------------------

.free_slot
|1CF949| LDA.b #$3C ; ANCILLA 3C
|1CF94B| STA.w $0C4A,X

|1CF94E| STZ.w $0C5E,X

|1CF951| LDA.b #$04
|1CF953| STA.w $0C68,X

|1CF956| LDA.b $EE
|1CF958| STA.w $0C7C,X

|1CF95B| STZ.b $74
|1CF95D| STZ.b $75

|1CF95F| LDA.b $2F
|1CF961| LSR A
|1CF962| TAY

|1CF963| LDA.w .mask_y,Y
|1CF966| BNE .off_axis_y

|1CF968| LDA.w $0079
|1CF96B| LSR A
|1CF96C| LSR A

|1CF96D| CPY.b #$00
|1CF96F| BNE .correct_sign_y

|1CF971| EOR.b #$FF
|1CF973| INC A

.correct_sign_y
|1CF974| STA.b $74

|1CF976| LDA.b #$00

.off_axis_y
|1CF978| STA.b $72

|1CF97A| LDA.w .mask_x,Y
|1CF97D| BNE .off_axis_x

|1CF97F| LDA.w $0079
|1CF982| LSR A
|1CF983| LSR A

|1CF984| CPY.b #$02
|1CF986| BNE .correct_sign_x

|1CF988| EOR.b #$FF
|1CF98A| INC A

.correct_sign_x
|1CF98B| STA.b $75

|1CF98D| LDA.b #$00

.off_axis_x
|1CF98F| STA.b $73

;---------------------------------------------------------------------------------------------------

|1CF991| JSL GetRandomNumber
|1CF995| STA.b $08

|1CF997| AND.b $72
|1CF999| STA.b $04
|1CF99B| STZ.b $05

|1CF99D| LDA.b $08
|1CF99F| AND.b $73
|1CF9A1| LSR A
|1CF9A2| LSR A
|1CF9A3| LSR A
|1CF9A4| LSR A
|1CF9A5| STA.b $06
|1CF9A7| STZ.b $07

;---------------------------------------------------------------------------------------------------

|1CF9A9| LDY.b $2F

|1CF9AB| REP #$20

|1CF9AD| LDA.b $74
|1CF9AF| AND.w #$00FF
|1CF9B2| CMP.w #$0080
|1CF9B5| BCC .positive_y

|1CF9B7| ORA.w #$FF00

.positive_y
|1CF9BA| CLC
|1CF9BB| ADC.b $20

|1CF9BD| CLC
|1CF9BE| ADC.w .offset_y,Y

|1CF9C1| CLC
|1CF9C2| ADC.b $04
|1CF9C4| STA.b $00

;---------------------------------------------------------------------------------------------------

|1CF9C6| LDA.b $75
|1CF9C8| AND.w #$00FF
|1CF9CB| CMP.w #$0080
|1CF9CE| BCC .positive_x

|1CF9D0| ORA.w #$FF00

.positive_x
|1CF9D3| CLC
|1CF9D4| ADC.b $22

|1CF9D6| CLC
|1CF9D7| ADC.w .offset_x,Y

|1CF9DA| CLC
|1CF9DB| ADC.b $06
|1CF9DD| STA.b $02

|1CF9DF| SEP #$20

|1CF9E1| LDA.b $00
|1CF9E3| STA.w $0BFA,X

|1CF9E6| LDA.b $01
|1CF9E8| STA.w $0C0E,X

|1CF9EB| LDA.b $02
|1CF9ED| STA.w $0C04,X

|1CF9F0| LDA.b $03
|1CF9F2| STA.w $0C18,X

.exit
|1CF9F5| PLB

|1CF9F6| RTL

;===================================================================================================

SwordBeam_Move_X:
|1CF9F7| TXA
|1CF9F8| CLC
|1CF9F9| ADC.b #$0A
|1CF9FB| TAX

|1CF9FC| JSR SwordBeam_Move_Y

|1CF9FF| LDX.w $0FA0

|1CFA02| RTS

;===================================================================================================

SwordBeam_Move_Y:
|1CFA03| LDA.w $0C22,X
|1CFA06| ASL A
|1CFA07| ASL A
|1CFA08| ASL A
|1CFA09| ASL A
|1CFA0A| CLC
|1CFA0B| ADC.w $0C36,X
|1CFA0E| STA.w $0C36,X

|1CFA11| LDY.b #$00

|1CFA13| LDA.w $0C22,X
|1CFA16| PHP

|1CFA17| LSR A
|1CFA18| LSR A
|1CFA19| LSR A
|1CFA1A| LSR A

|1CFA1B| PLP
|1CFA1C| BPL .positive_velocity

|1CFA1E| ORA.b #$F0

|1CFA20| DEY

.positive_velocity
|1CFA21| ADC.w $0BFA,X
|1CFA24| STA.w $0BFA,X

|1CFA27| TYA
|1CFA28| ADC.w $0C0E,X
|1CFA2B| STA.w $0C0E,X

|1CFA2E| RTS

;===================================================================================================

PrepareToDie:
|1CFA2F| PHB
|1CFA30| PHK
|1CFA31| PLB

|1CFA32| LDA.b #$02
|1CFA34| STA.b $2F

|1CFA36| LDA.b #$01
|1CFA38| STA.w $036B

|1CFA3B| STZ.w $030D
|1CFA3E| STZ.w $030A

|1CFA41| LDA.b #$05
|1CFA43| STA.w $030B

|1CFA46| LDA.b #$00
|1CFA48| STA.l $7EF372
|1CFA4C| STA.l $7EF36D

|1CFA50| JSL ResetLinkProperties_C

|1CFA54| STZ.w $02F5
|1CFA57| STZ.w $0351
|1CFA5A| STZ.w $02E0

|1CFA5D| STZ.b $48
|1CFA5F| STZ.w $02EC

|1CFA62| STZ.b $4D
|1CFA64| STZ.b $46

|1CFA66| STZ.w $0373
|1CFA69| STZ.w $02E1

|1CFA6C| STZ.b $5E
|1CFA6E| STZ.w $03F7

|1CFA71| LDA.l $7EF357
|1CFA75| BEQ .no_pearl

|1CFA77| STZ.b $56

.no_pearl
|1CFA79| STZ.w $03F5
|1CFA7C| STZ.w $03F6

|1CFA7F| JSL CalculateLinkSFXPan
|1CFA83| ORA.b #$27 ; SFX2.27
|1CFA85| STA.w $012E

|1CFA88| LDA.b #$06
|1CFA8A| CMP.l $7EF35C
|1CFA8E| BEQ .fairy

|1CFA90| CMP.l $7EF35D
|1CFA94| BEQ .fairy

|1CFA96| CMP.l $7EF35E
|1CFA9A| BEQ .fairy

|1CFA9C| CMP.l $7EF35F
|1CFAA0| BEQ .fairy

|1CFAA2| STZ.w $05FC
|1CFAA5| STZ.w $05FD

.fairy
|1CFAA8| PLB

|1CFAA9| RTL

;===================================================================================================
; Sets receive items to finish as soon as possible
;===================================================================================================
RushToTerminateReceiveItem:
|1CFAAA| PHX

|1CFAAB| LDX.b #$04

.next_slot
|1CFAAD| LDA.w $0C4A,X
|1CFAB0| CMP.b #$22 ; ANCILLA 22
|1CFAB2| BNE .not_receive_item

|1CFAB4| LDA.b #$01
|1CFAB6| STA.w $03B1,X

.not_receive_item
|1CFAB9| DEX
|1CFABA| BPL .next_slot

|1CFABC| PLX

|1CFABD| RTL

;===================================================================================================

DashTremor_Twiddle:
|1CFABE| LDY.w $0C72,X

|1CFAC1| LDA.w $0BFA,X
|1CFAC4| STA.b $00

|1CFAC6| LDA.w $0C0E,X
|1CFAC9| STA.b $01

|1CFACB| REP #$20

|1CFACD| LDA.b $00
|1CFACF| EOR.w #$FFFF
|1CFAD2| INC A
|1CFAD3| STA.b $00

|1CFAD5| SEP #$20

|1CFAD7| LDA.b $00
|1CFAD9| STA.w $0BFA,X

|1CFADC| LDA.b $01
|1CFADE| STA.w $0C0E,X

;---------------------------------------------------------------------------------------------------

; Skip when indoors
|1CFAE1| LDA.b $1B
|1CFAE3| BNE .exit

|1CFAE5| CPY.b #$02
|1CFAE7| BNE .horizontal

|1CFAE9| REP #$20

|1CFAEB| LDA.w $0600
|1CFAEE| CLC
|1CFAEF| ADC.w #$0001
|1CFAF2| STA.b $02

|1CFAF4| LDA.w $0602
|1CFAF7| CLC
|1CFAF8| ADC.w #$FFFF
|1CFAFB| STA.b $04

|1CFAFD| LDA.b $00
|1CFAFF| CLC
|1CFB00| ADC.b $E8
|1CFB02| CMP.b $02
|1CFB04| BEQ .vertical_zero
|1CFB06| BCC .vertical_zero

|1CFB08| CMP.b $04
|1CFB0A| BEQ .vertical_zero
|1CFB0C| BCC .exit

.vertical_zero
|1CFB0E| BRA .zero

;---------------------------------------------------------------------------------------------------

.horizontal
|1CFB10| REP #$20

|1CFB12| LDA.w $0604
|1CFB15| CLC
|1CFB16| ADC.w #$0001
|1CFB19| STA.b $02

|1CFB1B| LDA.w $0606
|1CFB1E| CLC
|1CFB1F| ADC.w #$FFFF
|1CFB22| STA.b $04

|1CFB24| LDA.b $00
|1CFB26| CLC
|1CFB27| ADC.b $E2
|1CFB29| CMP.b $02
|1CFB2B| BEQ .zero
|1CFB2D| BCC .zero

|1CFB2F| CMP.b $04
|1CFB31| BEQ .zero
|1CFB33| BCC .exit

.zero
|1CFB35| STZ.b $00

.exit
|1CFB37| SEP #$20

|1CFB39| RTL

;===================================================================================================

BombosBlastRandomPosition:
|1CFB3A| db $B6, $5D, $A1, $30, $69, $B5, $A3, $24
|1CFB42| db $96, $AC, $73, $5F, $92, $48, $52, $81
|1CFB4A| db $39, $95, $7F, $20, $88, $5D, $34, $98
|1CFB52| db $BC, $D2, $51, $77, $A2, $47, $94, $B2
|1CFB5A| db $34, $DA, $30, $62, $9F, $76, $51, $46
|1CFB62| db $98, $5C, $9B, $61, $58, $95, $4C, $BA
|1CFB6A| db $7E, $CB, $12, $D0, $70, $A6, $46, $BF
|1CFB72| db $40, $50, $7E, $8C, $2D, $61, $AC, $88
|1CFB7A| db $20, $6A, $72, $5F, $D2, $28, $52, $80

;===================================================================================================

pool Ancilla_GetRadialProjection

.multiplier_x
|1CFB82| db $00, $19, $31, $4A, $61, $78, $8E, $A2
|1CFB8A| db $B5, $C5, $D4, $E1, $EC, $F4, $FB, $FE
|1CFB92| db $FF, $FE, $FB, $F4, $EC, $E1, $D4, $C5
|1CFB9A| db $B5, $A2, $8E, $78, $61, $4A, $31, $19
|1CFBA2| db $00, $19, $31, $4A, $61, $78, $8E, $A2
|1CFBAA| db $B5, $C5, $D4, $E1, $EC, $F4, $FB, $FE
|1CFBB2| db $FF, $FE, $FB, $F4, $EC, $E1, $D4, $C5
|1CFBBA| db $B5, $A2, $8E, $78, $61, $4A, $31, $19

.multiplier_y
|1CFBC2| db $FF, $FE, $FB, $F4, $EC, $E1, $D4, $C5
|1CFBCA| db $B5, $A2, $8E, $78, $61, $4A, $31, $19
|1CFBD2| db $00, $19, $31, $4A, $61, $78, $8E, $A2
|1CFBDA| db $B5, $C5, $D4, $E1, $EC, $F4, $FB, $FE
|1CFBE2| db $FF, $FE, $FB, $F4, $EC, $E1, $D4, $C5
|1CFBEA| db $B5, $A2, $8E, $78, $61, $4A, $31, $19
|1CFBF2| db $00, $19, $31, $4A, $61, $78, $8E, $A2
|1CFBFA| db $B5, $C5, $D4, $E1, $EC, $F4, $FB, $FE

.meta_sign_y
|1CFC02| db $01, $01, $01, $01, $01, $01, $01, $01
|1CFC0A| db $01, $01, $01, $01, $01, $01, $01, $01
|1CFC12| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC1A| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC22| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC2A| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC32| db $01, $01, $01, $01, $01, $01, $01, $01
|1CFC3A| db $01, $01, $01, $01, $01, $01, $01, $01

.meta_sign_x
|1CFC42| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC4A| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC52| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC5A| db $00, $00, $00, $00, $00, $00, $00, $00
|1CFC62| db $00, $01, $01, $01, $01, $01, $01, $01
|1CFC6A| db $01, $01, $01, $01, $01, $01, $01, $01
|1CFC72| db $01, $01, $01, $01, $01, $01, $01, $01
|1CFC7A| db $01, $01, $01, $01, $01, $01, $01, $01

endpool

;===================================================================================================

SomariaBlockFission:
.offset_y
|1CFC82| dw -10, -10,   2,   2,  -8,   0,  -8,   0
|1CFC92| dw -12, -12,   4,   4,  -8,   0,  -8,   0

.offset_x
|1CFCA2| dw  -8,   0,  -8,   0, -10, -10,   2,   2
|1CFCB2| dw  -8,   0,  -8,   0, -12, -12,   4,   4

.char
|1CFCC2| db $C6, $C6, $C6, $C6, $C4, $C4, $C4, $C4
|1CFCCA| db $D2, $D2, $D2, $D2, $C5, $C5, $C5, $C5

.prop
|1CFCD2| db $C6, $86, $46, $06, $46, $C6, $06, $86
|1CFCDA| db $C6, $86, $46, $06, $46, $C6, $06, $86

;===================================================================================================

CheckIfBunny:
; Why is recoil even checked for?
|1CFCE2| LDA.b $5D
|1CFCE4| CMP.b #$02 ; LINKSTATE 02
|1CFCE6| BNE .exit

; This is where Lonk happens.
; That should be LDA.w $02E0.
; Someone messed up.
|1CFCE8| LDY.b #$00 ; LINKSTATE 00

|1CFCEA| LDA.b $E0
|1CFCEC| BEQ .set

; Check for pearl
|1CFCEE| LDY.b #$17 ; LINKSTATE 17

|1CFCF0| LDA.l $7EF357
|1CFCF4| BEQ .set

; Temp bunny
|1CFCF6| LDY.b #$1C ; LINKSTATE 1C

.set
|1CFCF8| STY.b $5D

.exit
|1CFCFA| RTL

;===================================================================================================
; Only deletes them on the Waterfall of Wishing overworld screen
;===================================================================================================
DeleteWaterfallSplashes:
|1CFCFB| LDA.b $8A
|1CFCFD| CMP.b #$0F ; OW 0F
|1CFCFF| BNE .not_waterfall

|1CFD01| LDX.b #$04

.next_slot
|1CFD03| LDA.w $0C4A,X
|1CFD06| CMP.b #$41 ; ANCILLA 41
|1CFD08| BNE .not_water

|1CFD0A| STZ.w $0C4A,X

.not_water
|1CFD0D| DEX
|1CFD0E| BPL .next_slot

.not_waterfall
|1CFD10| RTL

;===================================================================================================

Ancilla_TerminateOffScreen:
|1CFD11| LDA.w $0BFA,Y
|1CFD14| STA.b $0C

|1CFD16| LDA.w $0C0E,Y
|1CFD19| STA.b $0D

|1CFD1B| LDA.w $0C04,Y
|1CFD1E| STA.b $0E

|1CFD20| LDA.w $0C18,Y
|1CFD23| STA.b $0F

|1CFD25| REP #$20

|1CFD27| LDA.b $0C
|1CFD29| SEC
|1CFD2A| SBC.b $E8
|1CFD2C| CMP.w #$00F0
|1CFD2F| BCS .terminate

|1CFD31| LDA.b $0E
|1CFD33| SEC
|1CFD34| SBC.b $E2
|1CFD36| CMP.w #$00F4
|1CFD39| BCC .on_screen

.terminate
|1CFD3B| SEP #$20

|1CFD3D| LDA.b #$00
|1CFD3F| STA.w $0C4A,Y

.on_screen
|1CFD42| SEP #$20

|1CFD44| RTL

;===================================================================================================

PrepAndSetForcedYItem:
|1CFD45| PHX

|1CFD46| STA.w $03FC

|1CFD49| JSL ResetLinkProperties_C

|1CFD4D| LDX.b #$04

.next_slot
|1CFD4F| LDA.w $0C4A,X

; Byrna spark dies
|1CFD52| CMP.b #$30 ; ANCILLA 30
|1CFD54| BEQ .delete

; Other byrna spark dies
|1CFD56| CMP.b #$31 ; ANCILLA 31
|1CFD58| BEQ .delete

; Boomerang dies
|1CFD5A| CMP.b #$05 ; ANCILLA 05
|1CFD5C| BNE .keep

|1CFD5E| STZ.w $035F

.delete
|1CFD61| STZ.w $0C4A,X

.keep
|1CFD64| DEX
|1CFD65| BPL .next_slot

|1CFD67| PLX

|1CFD68| RTL

;===================================================================================================

PrepAndDisplayMessage:
|1CFD69| LDA.b $10
|1CFD6B| CMP.b #$0E
|1CFD6D| BEQ .exit

|1CFD6F| STZ.w $0223
|1CFD72| STZ.w $1CD8

|1CFD75| LDA.b #$02
|1CFD77| STA.b $11

|1CFD79| LDA.b $10
|1CFD7B| STA.w $010C

|1CFD7E| LDA.b #$0E
|1CFD80| STA.b $10

.exit
|1CFD82| RTL

;===================================================================================================

AncillaAdd_SwordChargeSparkle_preserveX:
|1CFD83| PHB
|1CFD84| PHK
|1CFD85| PLB

|1CFD86| PHX
|1CFD87| JSL AncillaAdd_SwordChargeSparkle
|1CFD8B| PLX

|1CFD8C| PLB

|1CFD8D| RTL

;===================================================================================================
; FREE ROM: 0x272
;===================================================================================================
NULL_1CFD8E:
|1CFD8E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFD96| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFD9E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDA6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDAE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDB6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDBE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDC6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDCE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDD6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDDE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDE6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDEE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDF6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFDFE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE06| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE0E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE16| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE1E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE26| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE2E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE36| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE3E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE46| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE4E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE56| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE5E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE66| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE6E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE76| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE7E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE86| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE8E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE96| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFE9E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEA6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEAE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEB6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEBE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEC6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFECE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFED6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEDE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEE6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEEE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEF6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFEFE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF06| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF0E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF16| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF1E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF26| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF2E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF36| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF3E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF46| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF4E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF56| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF5E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF66| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF6E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF76| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF7E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF86| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF8E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF96| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFF9E| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFA6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFAE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFB6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFBE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFC6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFCE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFD6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFDE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFE6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFEE| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFF6| db $FF, $FF, $FF, $FF, $FF, $FF, $FF, $FF
|1CFFFE| db $FF, $FF

;===================================================================================================
